--------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_
> 0/code/Workshop_1.log
  log type:  text
 opened on:   9 Jun 2019, 11:34:20

. set more off

. 
. ******************************************
. * 3 Reading a text data set              *
. ******************************************
. 
. infile storeid str12 status2 empft2 emppt2 nmgrs2 /*
>   */ wage_st2 hrsopen2 psoda2 pfry2 pmeal2 /*
>   */ using "$path/raw_data/interview2.txt", clear
(410 observations read)

. 
. desc

Contains data
  obs:           410                          
 vars:            10                          
 size:        19,680                          
--------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------
storeid         float   %9.0g                 
status2         str12   %12s                  
empft2          float   %9.0g                 
emppt2          float   %9.0g                 
nmgrs2          float   %9.0g                 
wage_st2        float   %9.0g                 
hrsopen2        float   %9.0g                 
psoda2          float   %9.0g                 
pfry2           float   %9.0g                 
pmeal2          float   %9.0g                 
--------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. duplicates report /*finds all duplicate values in each variable */

Duplicates in terms of all variables

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |          410             0
--------------------------------------

. 
. ******************************************
. * 4 Sorting and browsing the data        *
. ******************************************
. 
. sort storeid

. gsort -storeid /*inverse sorting */

. 
. browse storeid empft2 emppt2 nmgrs2

. 
. ******************************************
. * 5 Getting the number of observations   *
. ******************************************
. 
. count
  410

. count if status2=="answer"
  399

. tab status2, missing /*tabulate missing values */

     status2 |      Freq.     Percent        Cum.
-------------+-----------------------------------
      answer |        399       97.32       97.32
      highwa |          1        0.24       97.56
      mallfi |          1        0.24       97.80
      perman |          6        1.46       99.27
      refuse |          1        0.24       99.51
      renova |          2        0.49      100.00
-------------+-----------------------------------
       Total |        410      100.00

. bysort status2: egen obsstatus2 = count(storeid) /*create a column
>  with the count of status 2 for each restaurant*/

. gen obsno=_n /*create a column with the observation number*/

. bysort status2: gen obsno2=_n /* cac with the observation number s
> orted by status 2*/

. bysort status2: gen obsno3=_N /* same as before, create a column w
> ith the count of status 2 for each restaurant*/

. 
. ******************************************
. * 6 Saving the data set                  *
. ******************************************
. 
. save "$path/mod_data/interview2.dta", replace
file /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_0/mod_da
> ta/interview2.dta saved

. 
. ******************************************
. * 7 Merging data sets                    *
. ******************************************
. 
. duplicates report storeid /*the variable we will merge by is uniqu
> e or not*/

Duplicates in terms of storeid

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |          410             0
--------------------------------------

. 
. clear all /*just one dataset in the memory*/

. 
. cd "/$path/mod_data/"
/Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_0/mod_data

. use "$path/raw_data/interview1.dta", clear

. 
. sort storeid

. duplicates report storeid

Duplicates in terms of storeid

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |          410             0
--------------------------------------

. 
. merge 1:1 storeid using "$path/raw_data/interview2.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               410  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. ******************************************
. * 7.1 Labeling data sets                 *
. ******************************************
. 
. label var storeid "Unique fast-food restaurant id"

. label var status2 "Character variable for the restaurant’s status 
> for second interview"

. label var empft2 "Number of full-time employed in second interview
> "

. label var emppt2 "Number of part-time employed in second interview
> "

. label var nmgrs2 "Number of managers and assistant managers in the
>  second interview"

. label var wage_st2 "Hourly starting wage in the second interview"

. label var hrsopen2 "Number of hours open per day"

. label var psoda2 "Price of medium soda including tax"

. label var pfry2 "Price of small fries including tax"

. label var pmeal2 "Price of a standard meal including tax"

. label var status "Character variable for the restaurant’s status f
> or second interview"

. label var empft "Number of full-time employed in first interview"

. label var emppt "Number of part-time employed in first interview"

. label var nmgrs "Number of managers and assistant managers in the 
> first interview"

. label var wage_st "Hourly starting wage in the first interview"

. label var hrsopen "Number of hours open per day in the first inter
> view"

. label var psoda "Price of medium soda including tax in the first i
> nterview"

. label var pfry "Price of small fries including tax in the first in
> terview"

. label var pmeal "Price of a standard meal including tax in the fir
> st interview"

. la var nj "Dummy for New Jersey. 1 = New Jersey, 0 = Pennsylvania"

. la var co_owned "Dummy equal to 1 if company-owned and dummy equal
>  0 if franchisee-owned"

. la var chain "Character variable for the chain for which the indiv
> idual restaurant belongs. BurgerKing, KFC, Roy Rogers, and Wendys"
note: label truncated to 80 characters

. 
. ******************************************
. * 8 Limiting the data set                *
. ******************************************
. 
. keep if (status2=="answer" & wage_st!=. & wage_st2!=.)| status2=="
> perman"
(35 observations deleted)

. 
. ******************************************
. * 9 Generate new variables               *
. ******************************************
. 
. *construct a variable measuring each store’s total employment
. gen emptot      = emppt * .5 +  empft   + nmgrs                   
>                  
(11 missing values generated)

. gen emptot2 = emppt2* .5 +      empft2  + nmgrs2
(7 missing values generated)

. 
. gen demp        = emptot2-emptot /*change in total employment*/   
>                                                        
(18 missing values generated)

. gen dwage       = wage_st2-wage_st /*change in wages*/ 
(6 missing values generated)

. 
. *construct dummies and a chain variable
. gen kfc = (chain=="KFC")

. gen bk  = (chain=="Burger King")

. gen roy = (chain=="Roy Rogers")

. gen wen = (chain=="Wendys")

. gen chain_num = 1*(chain=="Burger King")+2*(chain=="KFC")+ ///
>         3*(chain=="Roy Rogers")+4*(chain=="Wendys")

. 
. 
. * interactions between chain dummies and the nj dummy
. xi i.chain /*create dummies of the selected string variable (alter
> native)*/
i.chain           _Ichain_1-4         (_Ichain_1 for chain==Burger K
> ing omitted)

. xi i.chain*i.nj, noomit /*STATA will select all variables starting
>  by "_Ichain" no matter their suffix */
i.chain*i.nj      _IchaXnj_#_#        (coded as above)

. 
. save "$path/mod_data/interview2.dta", replace
file /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_0/mod_da
> ta/interview2.dta saved

. 
. ******************************************
. * 10 Descriptive statistics              *
. ******************************************
. 
. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        
> Max
-------------+------------------------------------------------------
> ---
     storeid |        375    246.3893    148.6327          1        
> 522
       chain |          0
    co_owned |        375    .3466667    .4765443          0        
>   1
       empft |        370    8.390541    8.616933          0        
>  60
       emppt |        371     18.7035    10.17288          0        
>  60
-------------+------------------------------------------------------
> ---
       nmgrs |        369    3.411382     .982029          1        
>  10
     wage_st |        375     4.61816    .3469756       4.25       5
> .75
     hrsopen |        375      14.472    2.825569          7        
>  24
       psoda |        368     1.04769      .08946        .73       1
> .49
        pfry |        361    .9236011    .1058211        .67       1
> .27
-------------+------------------------------------------------------
> ---
          nj |        375        .816    .3880019          0        
>   1
       pmeal |        355    3.309239    .6531408       2.47       5
> .86
     status2 |          0
      empft2 |        370    8.247297    7.781592          0        
>  40
      emppt2 |        372    18.56586     10.7181          0        
>  60
-------------+------------------------------------------------------
> ---
      nmgrs2 |        374    3.498663    1.160393          0        
>   8
    wage_st2 |        369    4.996613    .2552656       4.25       6
> .25
    hrsopen2 |        368    14.49796    2.766238          8        
>  24
      psoda2 |        359    1.046908    .0948075        .41        
> 1.4
       pfry2 |        355     .942676    .1106345        .69       1
> .37
-------------+------------------------------------------------------
> ---
      pmeal2 |        352    3.353608    .6477256       2.14       5
> .17
  obsstatus2 |        375     392.712    49.37759          6        
> 399
       obsno |        375       205.4    115.7995          2        
> 407
      obsno2 |        375     198.984     115.699          1        
> 398
      obsno3 |        375     392.712    49.37759          6        
> 399
-------------+------------------------------------------------------
> ---
      emptot |        364    21.09835    9.883686          5        
>  85
     emptot2 |        368    20.98438     8.97432          0       6
> 0.5
        demp |        357    -.237535    8.825485      -41.5        
>  28
       dwage |        369    .3754473    .3970775       -.75        
>   2
         kfc |        375          .2    .4005344          0        
>   1
-------------+------------------------------------------------------
> ---
          bk |        375    .4186667    .4939996          0        
>   1
         roy |        375        .248    .4324288          0        
>   1
         wen |        375    .1333333    .3403888          0        
>   1
   chain_num |        375       2.096    1.092688          1        
>   4
   _Ichain_1 |        375    .4186667    .4939996          0        
>   1
-------------+------------------------------------------------------
> ---
   _Ichain_2 |        375          .2    .4005344          0        
>   1
   _Ichain_3 |        375        .248    .4324288          0        
>   1
   _Ichain_4 |        375    .1333333    .3403888          0        
>   1
      _Inj_0 |        375        .184    .3880019          0        
>   1
      _Inj_1 |        375        .816    .3880019          0        
>   1
-------------+------------------------------------------------------
> ---
_IchaXnj_1_0 |        375    .0853333    .2797503          0        
>   1
_IchaXnj_1_1 |        375    .3333333    .4720343          0        
>   1
_IchaXnj_2_0 |        375    .0266667    .1613225          0        
>   1
_IchaXnj_2_1 |        375    .1733333    .3790409          0        
>   1
_IchaXnj_3_0 |        375    .0426667    .2023745          0        
>   1
-------------+------------------------------------------------------
> ---
_IchaXnj_3_1 |        375    .2053333    .4044847          0        
>   1
_IchaXnj_4_0 |        375    .0293333    .1689646          0        
>   1
_IchaXnj_4_1 |        375        .104    .3056684          0        
>   1

. 
. su wage_st wage_st2, detail /*summarize detailed of selected varia
> bles*
> At least 25 per cent of the stores’ starting wages are equal to th
> e minimum 
> wage of $4.25, but at the second interview less than 10 per cent o
> f the restaurants
> have a minimum wage of $4.25. */

         Hourly starting wage in the first interview
-------------------------------------------------------------
      Percentiles      Smallest
 1%         4.25           4.25
 5%         4.25           4.25
10%         4.25           4.25       Obs                 375
25%         4.25           4.25       Sum of Wgt.         375

50%          4.5                      Mean            4.61816
                        Largest       Std. Dev.      .3469756
75%            5            5.5
90%            5           5.56       Variance       .1203921
95%         5.25           5.62       Skewness       .6559428
99%          5.5           5.75       Kurtosis        2.66278

        Hourly starting wage in the second interview
-------------------------------------------------------------
      Percentiles      Smallest
 1%         4.25           4.25
 5%         4.25           4.25
10%         4.75           4.25       Obs                 369
25%         5.05           4.25       Sum of Wgt.         369

50%         5.05                      Mean           4.996613
                        Largest       Std. Dev.      .2552656
75%         5.05           5.67
90%         5.05           5.67       Variance       .0651605
95%         5.25           5.75       Skewness       -1.09536
99%         5.67           6.25       Kurtosis       7.414656

. 
. tab status2

   Character |
variable for |
         the |
  restaurant |
   ’s status |
  for second |
   interview |      Freq.     Percent        Cum.
-------------+-----------------------------------
      answer |        369       98.40       98.40
      perman |          6        1.60      100.00
-------------+-----------------------------------
       Total |        375      100.00

. 
. egen wage_stM = mean(wage_st) /*used egen given that it's the mean
>  of another variable*/

. 
. bysort chain: egen wage_stchain = mean(wage_st) /*average starting
>  wage for each of the fast food chains*/

. 
. tab chain, g(chaindum)

   Character |
variable for |
   the chain |
   for which |
         the |
  individual |
  restaurant |
 belongs. Bu |      Freq.     Percent        Cum.
-------------+-----------------------------------
 Burger King |        157       41.87       41.87
         KFC |         75       20.00       61.87
  Roy Rogers |         93       24.80       86.67
      Wendys |         50       13.33      100.00
-------------+-----------------------------------
       Total |        375      100.00

. 
. ta chain nj, column /*fast-food chains distribution across  NJ and
>  Penn */

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Character |
variable for |
   the chain |
   for which |
         the | Dummy for New Jersey.
  individual |  1 = New Jersey, 0 =
  restaurant |     Pennsylvania
 belongs. Bu |         0          1 |     Total
-------------+----------------------+----------
 Burger King |        32        125 |       157 
             |     46.38      40.85 |     41.87 
-------------+----------------------+----------
         KFC |        10         65 |        75 
             |     14.49      21.24 |     20.00 
-------------+----------------------+----------
  Roy Rogers |        16         77 |        93 
             |     23.19      25.16 |     24.80 
-------------+----------------------+----------
      Wendys |        11         39 |        50 
             |     15.94      12.75 |     13.33 
-------------+----------------------+----------
       Total |        69        306 |       375 
             |    100.00     100.00 |    100.00 


. 
. tab1 chain nj

-> tabulation of chain  

   Character |
variable for |
   the chain |
   for which |
         the |
  individual |
  restaurant |
 belongs. Bu |      Freq.     Percent        Cum.
-------------+-----------------------------------
 Burger King |        157       41.87       41.87
         KFC |         75       20.00       61.87
  Roy Rogers |         93       24.80       86.67
      Wendys |         50       13.33      100.00
-------------+-----------------------------------
       Total |        375      100.00

-> tabulation of nj  

  Dummy for |
New Jersey. |
    1 = New |
Jersey, 0 = |
Pennsylvani |
          a |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         69       18.40       18.40
          1 |        306       81.60      100.00
------------+-----------------------------------
      Total |        375      100.00

. 
. tabstat empft emppt nmgrs wage_st hrsopen, by(nj)

Summary statistics: mean
  by categories of: nj (Dummy for New Jersey. 1 = New Jersey, 0 = Pe
> nnsylvania)

      nj |     empft     emppt     nmgrs   wage_st   hrsopen
---------+--------------------------------------------------
       0 |  10.56618  19.35294  3.558824  4.646957  14.65942
       1 |  7.900662  18.55776  3.378073  4.611667  14.42974
---------+--------------------------------------------------
   Total |  8.390541   18.7035  3.411382   4.61816    14.472
------------------------------------------------------------

. 
. ******************************************
. * 11 Graphs                              *
. ******************************************
. 
. graph drop _all /*display every graph created by the do file*/

. 
. hist wage_st, name(fig1)
(bin=19, start=4.25, width=.07894737)

. hist wage_st2, name(fig2)
(bin=19, start=4.25, width=.10526316)

. graph combine fig1 fig2, name(fig3)
(note:  clockdir by_legend_position not found in scheme, default
        attributes used)
(note:  clockdir by_legend_position not found in scheme, default
        attributes used)

. graph save fig3 "$path/graphs/figure3.gph", replace
(file /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_0/graph
> s/figure3.gph saved)

. graph export "$path/graphs/figure3.png", name(fig3) replace
(file /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_0/graph
> s/figure3.png written in PNG format)

. 
. graph bar (mean) dwage, over(nj) name(fig4)

. /* The increase in the minimum wage in New
> Jersey had a larger effect of starting wages 
> in New Jersey compared to Pennsylvania? This
> point it's essential for the Dif-n-Dif*/
. 
. preserve /*create a temporary copy of active dataframe*/

. 
. keep storeid chain nj wage_st wage_st2 emptot emptot2

. rename wage_st wage_st1

. rename emptot emptot1

. reshape long wage_st emptot, i(storeid) j(time) /*
> for every storeid create an after/before variable(time), reshaping
> the wages and total employment in just 1 column*/
(note: j = 1 2)

Data                               wide   ->   long
--------------------------------------------------------------------
> ---------
Number of obs.                      375   ->     750
Number of variables                   7   ->       6
j variable (2 values)                     ->   time
xij variables:
                      wage_st1 wage_st2   ->   wage_st
                        emptot1 emptot2   ->   emptot
--------------------------------------------------------------------
> ---------

. collapse (mean) wage_st emptot, by(nj time) /*we are just interest
> ed in the means*/

. graph twoway (connected wage_st time if nj==0, xlabel(1(1)2)) ///
>                          (connected wage_st time if nj==1, xlabel(
> 1(1)2)), ///
>                          legend(label(1 "Pennsylvania") label(2 "N
> ew Jersey")) ///
>                          name(fig5)

. graph twoway (connected emptot time if nj==0, xlabel(1(1)2)) ///
>                          (connected emptot time if nj==1, xlabel(1
> (1)2)), ///
>                          legend(label(1 "Pennsylvania") label(2 "N
> ew Jersey")) ///
>                          name(fig6)

. graph combine fig5 fig6, name(fig7)

. 
. /* Both starting wages and employment in the fast food restaurants
>  increase
> in New Jersey, whereas starting wages and employment in the fast f
> ood restaurants
> decrease in Pennsylvania. This contradicts standard economic theor
> y. */
. 
. graph save fig7 "$path/graphs/figure7.gph", replace
(file /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_0/graph
> s/figure7.gph saved)

. graph export "$path/graphs/figure7.png", name(fig7) replace
(file /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_0/graph
> s/figure7.png written in PNG format)

. 
. restore /*going back to the original "unchanged" dataframe*/

. 
. ******************************************
. * 12 While loops and locals              *
. ******************************************
. 
. local i = 1

. while `i' <= 4 {
  2.         display "Results for chain number `i'
  3.         su wage_st if chain_num == `i'
  4.         local i = `i'+1
  5.         }
Results for chain number 1

    Variable |        Obs        Mean    Std. Dev.       Min        
> Max
-------------+------------------------------------------------------
> ---
     wage_st |        157    4.534331    .3266934       4.25       5
> .56
Results for chain number 2

    Variable |        Obs        Mean    Std. Dev.       Min        
> Max
-------------+------------------------------------------------------
> ---
     wage_st |         75    4.600533    .3319227       4.25        
> 5.5
Results for chain number 3

    Variable |        Obs        Mean    Std. Dev.       Min        
> Max
-------------+------------------------------------------------------
> ---
     wage_st |         93    4.700215    .3331209       4.25       5
> .62
Results for chain number 4

    Variable |        Obs        Mean    Std. Dev.       Min        
> Max
-------------+------------------------------------------------------
> ---
     wage_st |         50      4.7552    .3865929       4.25       5
> .75

.         
. ******************************************
. * 13 Accessing estimation results        *
. ******************************************
. 
. su wage_st

    Variable |        Obs        Mean    Std. Dev.       Min        
> Max
-------------+------------------------------------------------------
> ---
     wage_st |        375     4.61816    .3469756       4.25       5
> .75

. return list /*a list of all the currently saved results and their 
> names*/

scalars:
                  r(N) =  375
              r(sum_w) =  375
               r(mean) =  4.61816
                r(Var) =  .1203920598930481
                 r(sd) =  .3469755897654014
                r(min) =  4.25
                r(max) =  5.75
                r(sum) =  1731.81

. 
. scalar avgwage = r(mean) /*save the results in a scalar*/

. 
. reg demp nj, robust /*surprising positive coefficient of employime
> nt
> diff over New Jersey, the state that raised the minimum wage*/

Linear regression                               Number of obs     = 
>        357
                                                F(1, 355)         = 
>       2.56
                                                Prob > F          = 
>     0.1102
                                                R-squared         = 
>     0.0106
                                                Root MSE          = 
>     8.7909

--------------------------------------------------------------------
> ----------
             |               Robust
        demp |      Coef.   Std. Err.      t    P>|t|     [95% Conf.
>  Interval]
-------------+------------------------------------------------------
> ----------
          nj |   2.325831   1.452285     1.60   0.110    -.5303316  
>   5.181994
       _cons |  -2.126866   1.371683    -1.55   0.122    -4.824511  
>     .57078
--------------------------------------------------------------------
> ----------

. 
. ereturn list /*to see here the OLS coefficients are saved: e(b)*/

scalars:
                  e(N) =  357
               e(df_m) =  1
               e(df_r) =  355
                  e(F) =  2.564796876064768
                 e(r2) =  .0106177831698663
               e(rmse) =  8.790861345559259
                e(mss) =  294.4157000321466
                e(rss) =  27434.13133488103
               e(r2_a) =  .0078307910097813
                 e(ll) =  -1281.573678066357
               e(ll_0) =  -1283.479085962684
               e(rank) =  2

macros:
            e(cmdline) : "regress demp nj, robust"
              e(title) : "Linear regression"
          e(marginsok) : "XB default"
                e(vce) : "robust"
             e(depvar) : "demp"
                e(cmd) : "regress"
         e(properties) : "b V"
            e(predict) : "regres_p"
              e(model) : "ols"
          e(estat_cmd) : "regress_estat"
            e(vcetype) : "Robust"

matrices:
                  e(b) :  1 x 2
                  e(V) :  2 x 2
       e(V_modelbased) :  2 x 2

functions:
             e(sample)   

. matrix beta=e(b)

. matrix list beta

beta[1,2]
            nj       _cons
y1   2.3258312  -2.1268657

. 
. scalar constant=beta[1,2]

. disp constant
-2.1268657

. 
. scalar beta1=_b[nj]

. disp "The beta estimate for New Jersey is " beta1
The beta estimate for New Jersey is 2.3258312

. 
. scalar se1=_se[nj]

. disp "The corresponding standard errors are " se1
The corresponding standard errors are 1.4522845

. 
. scalar t1=beta1/se1

. disp "The corresponding t-statistic is " t1
The corresponding t-statistic is 1.6014983

.         
. ******************************************
. * 14 Globals                             *
. ******************************************
. 
. global x nj bk kfc roy co_owned

. reg demp $x, robust

Linear regression                               Number of obs     = 
>        357
                                                F(5, 351)         = 
>       1.93
                                                Prob > F          = 
>     0.0889
                                                R-squared         = 
>     0.0231
                                                Root MSE          = 
>     8.7847

--------------------------------------------------------------------
> ----------
             |               Robust
        demp |      Coef.   Std. Err.      t    P>|t|     [95% Conf.
>  Interval]
-------------+------------------------------------------------------
> ----------
          nj |    2.30386   1.450319     1.59   0.113    -.5485487  
>   5.156268
          bk |   .5119647   1.633679     0.31   0.754    -2.701065  
>   3.724995
         kfc |   1.004158   1.567194     0.64   0.522    -2.078113  
>   4.086429
         roy |  -1.705002    1.62052    -1.05   0.293    -4.892152  
>   1.482149
    co_owned |   .3079752   .9114799     0.34   0.736    -1.484674  
>   2.100624
       _cons |  -2.209133   1.828293    -1.21   0.228     -5.80492  
>   1.386655
--------------------------------------------------------------------
> ----------

. 
. ******************************************
. * 15 Producing tables for Excel and TeX  *
. ******************************************
. 
. * ssc install estout, replace
. 
. eststo clear

. eststo Model1: reg demp nj, robust

Linear regression                               Number of obs     = 
>        357
                                                F(1, 355)         = 
>       2.56
                                                Prob > F          = 
>     0.1102
                                                R-squared         = 
>     0.0106
                                                Root MSE          = 
>     8.7909

--------------------------------------------------------------------
> ----------
             |               Robust
        demp |      Coef.   Std. Err.      t    P>|t|     [95% Conf.
>  Interval]
-------------+------------------------------------------------------
> ----------
          nj |   2.325831   1.452285     1.60   0.110    -.5303316  
>   5.181994
       _cons |  -2.126866   1.371683    -1.55   0.122    -4.824511  
>     .57078
--------------------------------------------------------------------
> ----------

. eststo Model2: reg demp $x, robust

Linear regression                               Number of obs     = 
>        357
                                                F(5, 351)         = 
>       1.93
                                                Prob > F          = 
>     0.0889
                                                R-squared         = 
>     0.0231
                                                Root MSE          = 
>     8.7847

--------------------------------------------------------------------
> ----------
             |               Robust
        demp |      Coef.   Std. Err.      t    P>|t|     [95% Conf.
>  Interval]
-------------+------------------------------------------------------
> ----------
          nj |    2.30386   1.450319     1.59   0.113    -.5485487  
>   5.156268
          bk |   .5119647   1.633679     0.31   0.754    -2.701065  
>   3.724995
         kfc |   1.004158   1.567194     0.64   0.522    -2.078113  
>   4.086429
         roy |  -1.705002    1.62052    -1.05   0.293    -4.892152  
>   1.482149
    co_owned |   .3079752   .9114799     0.34   0.736    -1.484674  
>   2.100624
       _cons |  -2.209133   1.828293    -1.21   0.228     -5.80492  
>   1.386655
--------------------------------------------------------------------
> ----------

. 
. estout

--------------------------------------
                   Model1       Model2
                        b            b
--------------------------------------
nj               2.325831      2.30386
bk                            .5119647
kfc                           1.004158
roy                          -1.705002
co_owned                      .3079752
_cons           -2.126866    -2.209133
--------------------------------------

. estout, cells(b(star fmt(3)) se(par fmt(2))) legend

--------------------------------------------
                   Model1          Model2   
                     b/se            b/se   
--------------------------------------------
nj                  2.326           2.304   
                   (1.45)          (1.45)   
bk                                  0.512   
                                   (1.63)   
kfc                                 1.004   
                                   (1.57)   
roy                                -1.705   
                                   (1.62)   
co_owned                            0.308   
                                   (0.91)   
_cons              -2.127          -2.209   
                   (1.37)          (1.83)   
--------------------------------------------
* p<0.05, ** p<0.01, *** p<0.001

. estout, cells(b(star fmt(3)) se(par fmt(2))) legend ///
>         stats(r2 N vce, labels("R-squared" "No. of obs.")) ///
>         varlabels(nj "New Jersey" bk "Burger King" kfc "KFC" ///
>         roy "Roy Rogers" co_owned "Company-owned" ///
>         _cons "Constant") varwidth(14)

----------------------------------------------
                     Model1          Model2   
                       b/se            b/se   
----------------------------------------------
New Jersey            2.326           2.304   
                     (1.45)          (1.45)   
Burger King                           0.512   
                                     (1.63)   
KFC                                   1.004   
                                     (1.57)   
Roy Rogers                           -1.705   
                                     (1.62)   
Company-owned                         0.308   
                                     (0.91)   
Constant             -2.127          -2.209   
                     (1.37)          (1.83)   
----------------------------------------------
R-squared             0.011           0.023   
No. of obs.         357.000         357.000   
vce                  robust          robust   
----------------------------------------------
* p<0.05, ** p<0.01, *** p<0.001

. 
. estout using "$path/results/results1.xls", ///
>         cells(b(star fmt(3)) se(par fmt(2))) ///
>         legend stats(r2 N vce, labels("R-squared" "No. of obs.")) 
> ///
>         varlabels(nj "New Jersey" bk "Burger King" kfc "KFC" ///
>         roy "Roy Rogers" co_owned "Company-owned" ///
>         _cons "Constant") varwidth(14) replace
(output written to /Users/mac/GitHub/Applied-Econometrics-Stata-/Wor
> kshop_0/results/results1.xls)

. 
. estout using "$path/results/results1.txt", ///
>         cells(b(star fmt(3)) se(par fmt(2))) ///
>         legend stats(r2 N vce, labels("R-squared" "No. of obs.")) 
> ///
>         varlabels(nj "New Jersey" bk "Burger King" kfc "KFC" ///
>         roy "Roy Rogers" co_owned "Company-owned" ///
>         _cons "Constant") varwidth(14) style(tex) replace
(output written to /Users/mac/GitHub/Applied-Econometrics-Stata-/Wor
> kshop_0/results/results1.txt)

.         
. * ssc install outreg2, replace
. 
. label var nj "New Jersey"       

. label var bk "Burger King"

. label var kfc "KFC"

. label var roy "Roy Rogers"

. label var co_owned "Company-owned"      

. 
. outreg2 using "$path/results/Results4a.dta", replace ctitle(Model1
> ) label: ///
> reg demp nj, robust

Linear regression                               Number of obs     = 
>        357
                                                F(1, 355)         = 
>       2.56
                                                Prob > F          = 
>     0.1102
                                                R-squared         = 
>     0.0106
                                                Root MSE          = 
>     8.7909

--------------------------------------------------------------------
> ----------
             |               Robust
        demp |      Coef.   Std. Err.      t    P>|t|     [95% Conf.
>  Interval]
-------------+------------------------------------------------------
> ----------
          nj |   2.325831   1.452285     1.60   0.110    -.5303316  
>   5.181994
       _cons |  -2.126866   1.371683    -1.55   0.122    -4.824511  
>     .57078
--------------------------------------------------------------------
> ----------
dir : seeout

. 
. outreg2 using "$path/results/Results4b.dta", replace ctitle(Model1
> ) label: ///
> reg demp $x, robust

Linear regression                               Number of obs     = 
>        357
                                                F(5, 351)         = 
>       1.93
                                                Prob > F          = 
>     0.0889
                                                R-squared         = 
>     0.0231
                                                Root MSE          = 
>     8.7847

--------------------------------------------------------------------
> ----------
             |               Robust
        demp |      Coef.   Std. Err.      t    P>|t|     [95% Conf.
>  Interval]
-------------+------------------------------------------------------
> ----------
          nj |    2.30386   1.450319     1.59   0.113    -.5485487  
>   5.156268
          bk |   .5119647   1.633679     0.31   0.754    -2.701065  
>   3.724995
         kfc |   1.004158   1.567194     0.64   0.522    -2.078113  
>   4.086429
         roy |  -1.705002    1.62052    -1.05   0.293    -4.892152  
>   1.482149
    co_owned |   .3079752   .9114799     0.34   0.736    -1.484674  
>   2.100624
       _cons |  -2.209133   1.828293    -1.21   0.228     -5.80492  
>   1.386655
--------------------------------------------------------------------
> ----------
dir : seeout

. 
. preserve

. use Results4a_dta, clear
file Results4a_dta.dta not found
r(601);

end of do-file

r(601);

. do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD02175.0000
> 00"

. use Results4a_dta, clear
file Results4a_dta.dta not found
r(601);

end of do-file

r(601);

. do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD02175.0000
> 00"

. use Results4a.dta, clear
file Results4a.dta not found
r(601);

end of do-file

r(601);

. do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD02175.0000
> 00"

. use "$path/results/Results4b.dta", clear
file
    /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_0/resul
    > ts/Results4b.dta not Stata format
r(610);

end of do-file

r(610);

. do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD02175.0000
> 00"

. export excel using Results4.xls, replace sheet("Model1")
too few variables specified
r(102);

end of do-file

r(102);

. do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD02175.0000
> 00"

. use "$path/results/Results4b.dta"
file
    /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_0/resul
    > ts/Results4b.dta not Stata format
r(610);

end of do-file

r(610);

. do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD02175.0000
> 00"

. outreg2 using Results4a, dta replace ctitle(Model1) label: reg dem
> p nj, robust
variable demp not found
r(111);

end of do-file

r(111);

. cls

. do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD02175.0000
> 00"

. cls

. clear all

. capture log c
