------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mac/GitHub/Applied-Econometrics-Stata-/Workshop_2/code/Workshop_2.log
  log type:  text
 opened on:  11 Jun 2019, 18:28:55

. set more off

. 
. ******************************************
. *   Load data & labeling                 *
. ******************************************
. 
. use "$path/raw_data/autor2003.dta", clear
(EOW SVCs, CPS, rulings research data set)

. 
. ******************************************
. *   Descriptive statistics               *
. ******************************************
. 
. *Set time series and cross sectional dimensions
. 
. tsset state year /*strongly balanced*/
       panel variable:  state (strongly balanced)
        time variable:  year, 79 to 95
                delta:  1 unit

. 
. /*How many observations are contained in the data set and how are
> they distributed on years.*/
. 
. tab year D  /*50 observations from 1975 to 1995*/

   Year of |  Employment-at-will
observatio |   exception ruling
         n |         0          1 |     Total
-----------+----------------------+----------
        79 |        43          7 |        50 
        80 |        41          9 |        50 
        81 |        40         10 |        50 
        82 |        38         12 |        50 
        83 |        28         22 |        50 
        84 |        25         25 |        50 
        85 |        18         32 |        50 
        86 |        15         35 |        50 
        87 |        10         40 |        50 
        88 |         8         42 |        50 
        89 |         9         41 |        50 
        90 |         9         41 |        50 
        91 |         9         41 |        50 
        92 |         9         41 |        50 
        93 |         9         41 |        50 
        94 |         9         41 |        50 
        95 |         9         41 |        50 
-----------+----------------------+----------
     Total |       329        521 |       850 


. 
. /*Log THS employment and the fraction of states with exception
> rulings by year in the same diagram. Applying separate y-axes 
> for the two variables */
. 
. preserve

. collapse D  lnths lnemp stfrac, by(year) /*cannot make the graph without collapse*/

. gr two  (connect D year,         lcolor(red)  mcolor(red)  lpattern(solid) ) ///
>                 (connect lnths year, lcolor(blue) mcolor(blue) lpattern(solid) yaxis(2) ) ///
>                 , legend( lab(1 "Exception ruling") lab(2 "THS employment"))    ///
>                 title("Exception ruling and THS employment by year") xtitle("Year") ///
>                 saving(Fig1, replace)
(file Fig1.gph saved)

.                 graph export "graphs/Fig1.eps", replace
(file graphs/Fig1.eps written in EPS format)

. 
. /*The figure shows that exception rulings increased gradually starting in 1983.
> The fraction of states with exception ruling reached its maximum by 1988
> where approximately 80 percent of all states had exception rulings. The blue
> line show log THS employment. THS employment increased starting in 1984
> and continued to increase throughout the observation period. The THS em-
> ployment increase appears with a lag relative to the exception rulings.*/
. 
. 
. /*The THS fraction of total employment and log total employment against year. 
> Applying separate y-axes for the two variables*/
. 
. gr two  (connect stfrac year, lcolor(red)  mcolor(red)  lpattern(solid) ) ///
>                 (connect lnemp year,  lcolor(blue) mcolor(blue) lpattern(solid) yaxis(2) ) ///
>                 , legend( lab(1 "THS fraction") lab(2 "Log of total employment"))       ///
>                 title("Total employment and THS share by year") xtitle("Year")   ///
>                 saving(Fig2, replace)
(file Fig2.gph saved)

.                 graph export "graphs/Fig2.eps", replace
(file graphs/Fig2.eps written in EPS format)

. 
. /*The figure illustrates that both total employment and the THS share are in-
> creasing over the period considered. Also here the THS employment share
> appears to increase with a lag relative to total employment, and it is thus not
> clear how the exception ruling rate drives THS employment.*/
. 
. 
. /*Log total employment and log THS employment against year*/
. 
. gr two  (connect lnemp year,  lcolor(red)  mcolor(red)  lpattern(solid) ) ///
>                 (connect lnths year,  lcolor(blue) mcolor(blue) lpattern(solid) yaxis(2) ) ///
>                 , legend( lab(1 "THS empl") lab(2 "Overall empl")) ///
>                 title("Total and THS employment by year") xtitle("Year") ///
>                 saving(Fig3, replace)
(file Fig3.gph saved)

.                 graph export "graphs/Fig3.eps", replace
(file graphs/Fig3.eps written in EPS format)

. restore

. 
. /*This figure shows that the log employment in the THS industry is very closely
> correlated with overall employment over the period considered.*/
. 
. /* Based on the numbers presented in Figure 1-3 it is clear that THS employment
> has grown in the same period as the exception rulings appeared across US
> states. However, there is a very close connection between THS employment
> and total employment, both of which increased in the same period as the
> exception rulings swept across the country. It is therefore not possible to
> 2 conclude based on the graphical evidence whether exception rulings has caused
> THS employments. */
. 
. 
. *******************************************************
. *   Differences-in Differences model                  *
. *******************************************************
. 
. * xi i.state i.year i.state*year  /*Create dummies and interaction term*/
. 
. /*First, we estimate a simple version of the model that does not include
> interaction term */
. 
. reg lnths D  lnemp                       , cluster(state)

Linear regression                               Number of obs     =        850
                                                F(2, 49)          =     215.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8208
                                                Root MSE          =      .7246

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           D |   .5410928    .143892     3.76   0.000      .251931    .8302546
       lnemp |    1.48888   .0788778    18.88   0.000     1.330369    1.647391
       _cons |  -12.41318   1.199615   -10.35   0.000     -14.8239   -10.00246
------------------------------------------------------------------------------

. outreg2 using "results/table1", replace excel dec(4) ctitle("OLS") ///
> addtext(State FE, NO, Year FE, NO, StateXyear, NO, Clustered err, YES)
results/table1.xml
dir : seeout

. 
. /*The effect of introducing an exception ruling is to increase THS employment by
> 54 percent. However, the regression does not include any of the fixed effects.*/
. 
. * State dummies, year dummies, and state*time trends;
. xi i.state*year 
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.state*year      _IstaXyear_#        (coded as above)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg lnths D lnemp i.year                 , cluster(state) /*Year Fix effecs*/

Linear regression                               Number of obs     =        850
                                                F(18, 49)         =     143.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9136
                                                Root MSE          =     .50787

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           D |  -.0402029   .1363369    -0.29   0.769    -.3141822    .2337764
       lnemp |   1.443832    .067588    21.36   0.000     1.308009    1.579656
             |
        year |
         80  |  -.0177994   .0321506    -0.55   0.582    -.0824085    .0468097
         81  |  -.0346292   .0496891    -0.70   0.489    -.1344833    .0652249
         82  |  -.0322538   .0574139    -0.56   0.577    -.1476314    .0831239
         83  |   .0051925   .0578272     0.09   0.929    -.1110157    .1214006
         84  |    .326594   .0663361     4.92   0.000     .1932866    .4599013
         85  |   .5246585   .0867216     6.05   0.000      .350385    .6989321
         86  |   .6163453   .0881333     6.99   0.000     .4392349    .7934557
         87  |   .7195628   .1009275     7.13   0.000     .5167414    .9223842
         88  |   1.004868   .1065524     9.43   0.000     .7907427    1.218993
         89  |   1.062489   .1024737    10.37   0.000     .8565607    1.268418
         90  |   1.084327    .107581    10.08   0.000     .8681348    1.300519
         91  |   1.127223   .1079253    10.44   0.000     .9103385    1.344107
         92  |   1.257437   .1069359    11.76   0.000     1.042542    1.472333
         93  |   1.500292   .1115374    13.45   0.000      1.27615    1.724435
         94  |   1.609426   .1157581    13.90   0.000     1.376801     1.84205
         95  |   1.681598   .1173389    14.33   0.000     1.445796    1.917399
             |
       _cons |  -12.15634   1.006813   -12.07   0.000    -14.17961   -10.13308
------------------------------------------------------------------------------

. outreg2 using "results/table1", append excel dec(4) ctitle("OLS") ///
> addtext(State FE, NO, Year FE, YES, StateXyear, NO, Clustered err, YES)
results/table1.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg lnths D lnemp i.year i.state          , cluster(state) /*Year and State Fix effecs*/

Linear regression                               Number of obs     =        850
                                                F(17, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9727
                                                Root MSE          =     .29436

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           D |   .1279696   .0915282     1.40   0.168    -.0559632    .3119024
       lnemp |   2.013695   .4366315     4.61   0.000     1.136251    2.891139
             |
        year |
         80  |  -.0271011   .0335374    -0.81   0.423     -.094497    .0402948
         81  |  -.0520864   .0517957    -1.01   0.320    -.1561738     .052001
         82  |  -.0464878   .0609064    -0.76   0.449    -.1688839    .0759082
         83  |  -.0478298   .0605516    -0.79   0.433    -.1695127    .0738531
         84  |   .2378591   .0673139     3.53   0.001     .1025867    .3731315
         85  |   .3974986   .0851085     4.67   0.000     .2264667    .5685305
         86  |   .4701224   .0923542     5.09   0.000     .2845296    .6557151
         87  |   .5428393   .1058637     5.13   0.000     .3300982    .7555803
         88  |   .8029633   .1147031     7.00   0.000     .5724588    1.033468
         89  |   .8479019   .1208701     7.01   0.000     .6050044    1.090799
         90  |   .8593748   .1365562     6.29   0.000     .5849549    1.133795
         91  |   .9053851   .1435989     6.30   0.000     .6168123    1.193958
         92  |   1.028154   .1469509     7.00   0.000     .7328454    1.323463
         93  |   1.257026   .1482435     8.48   0.000       .95912    1.554933
         94  |   1.347562   .1620852     8.31   0.000      1.02184    1.673284
         95  |   1.404545   .1733557     8.10   0.000     1.056174    1.752917
             |
       state |
         12  |   .5731177   .0483885    11.84   0.000     .4758774    .6703579
         13  |   .1322159   .3109255     0.43   0.673    -.4926123    .7570441
         14  |   -.755224   .7875584    -0.96   0.342    -2.337882    .8274339
         15  |   1.124781   .0987861    11.39   0.000     .9262625    1.323299
         16  |  -.2493057   .5132262    -0.49   0.629    -1.280672     .782061
         21  |  -1.833339   1.215117    -1.51   0.138    -4.275208    .6085295
         22  |  -1.156605   .8595422    -1.35   0.185    -2.883919    .5707099
         23  |  -1.648396   1.032282    -1.60   0.117    -3.722844    .4260523
         31  |  -1.473357   .9893356    -1.49   0.143    -3.461501    .5147877
         32  |  -1.033771   .6988883    -1.48   0.145    -2.438239    .3706979
         33  |  -1.496451   1.023711    -1.46   0.150    -3.553675     .560772
         34  |  -1.200927   .8930844    -1.34   0.185    -2.995648    .5937932
         35  |  -.7375311   .6564929    -1.12   0.267    -2.056803    .5817408
         41  |  -.4563678   .6212807    -0.73   0.466    -1.704878    .7921425
         42  |  -.7799299   .3936272    -1.98   0.053    -1.570953    .0110935
         43  |  -.8592412   .6720034    -1.28   0.207    -2.209683    .4912002
         44  |  -.6889873   .2620627    -2.63   0.011    -1.215622   -.1623525
         45  |  -.0601448   .2498676    -0.24   0.811    -.5622727     .441983
         46  |   .1316943   .1603362     0.82   0.415    -.1905133     .453902
         47  |   -.603323   .3367097    -1.79   0.079    -1.279966    .0733204
         51  |   1.608219   .2022138     7.95   0.000     1.201855    2.014583
         52  |  -.6689812   .6168619    -1.08   0.283    -1.908612    .5706492
         54  |  -1.091003   .7358035    -1.48   0.145    -2.569656     .387649
         55  |  -.5047244    .127089    -3.97   0.000    -.7601193   -.2493296
         56  |  -1.176983    .789819    -1.49   0.143    -2.764184    .4102176
         57  |   -.487013   .4681042    -1.04   0.303    -1.427704    .4536776
         58  |  -.7812736   .7682007    -1.02   0.314    -2.325031    .7624835
         59  |  -.9759733   1.007957    -0.97   0.338    -3.001538    1.049591
         61  |  -.6214781   .4551376    -1.37   0.178    -1.536111    .2931552
         62  |  -.7941831   .6275074    -1.27   0.212    -2.055206    .4668403
         63  |  -.9663281   .5098013    -1.90   0.064    -1.990812    .0581559
         64  |  -1.067561   .2975517    -3.59   0.001    -1.665514   -.4696087
         71  |  -.1598117   .2560968    -0.62   0.536    -.6744575    .3548341
         72  |  -.2426113    .544676    -0.45   0.658    -1.337179    .8519561
         73  |  -.2002489   .3947622    -0.51   0.614    -.9935533    .5930555
         74  |  -1.678949    1.15716    -1.45   0.153    -4.004349      .64645
         81  |  -.5913223   .2120122    -2.79   0.008    -1.017377   -.1652678
         82  |  -.0201297    .120502    -0.17   0.868    -.2622876    .2220283
         83  |    .051365   .3692334     0.14   0.890    -.6906374    .7933673
         84  |  -.2025523   .4880194    -0.42   0.680    -1.183264    .7781593
         85  |   .0510225   .0542057     0.94   0.351     -.057908     .159953
         86  |   .0431513   .4444131     0.10   0.923    -.8499303     .936233
         87  |   .2522165   .1526288     1.65   0.105    -.0545025    .5589355
         88  |    .206757   .0421452     4.91   0.000     .1220631    .2914509
         91  |  -.9931089   .5975125    -1.66   0.103    -2.193855    .2076374
         92  |  -.2757928   .3764868    -0.73   0.467    -1.032371    .4807857
         93  |  -1.986518   1.374525    -1.45   0.155    -4.748729    .7756932
         94  |   .1445305   .3384578     0.43   0.671    -.5356259     .824687
         95  |   .3407262   .0384788     8.85   0.000     .2634002    .4180523
             |
       _cons |  -19.58999   5.648716    -3.47   0.001    -30.94151   -8.238467
------------------------------------------------------------------------------

. outreg2 using "results/table1", append excel dec(4) ctitle("OLS") ///
> addtext(State FE, YES, Year FE, YES, StateXyear, NO, Clustered err, YES)
results/table1.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg lnths D lnemp i.year i.state  i.state##i.year   , cluster(state) /*Year and State Fix effecs*/
matsize too small
    You have attempted to create a matrix with too many rows or columns or attempted to fit a model with too many variables.  You need
    to increase matsize; it is currently 800.  Use set matsize; see help matsize.

    If you are using factor variables and included an interaction that has lots of missing cells, either increase matsize or set
    emptycells drop to reduce the required matrix size; see help set emptycells.

    If you are using factor variables, you might have accidentally treated a continuous variable as a categorical, resulting in lots of
    categories.  Use the c. operator on such variables.
r(908);

end of do-file
r(908);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg lnths D lnemp i.year i.state  _IstaXyear*  , cluster(state) /*Year and State Fix effecs*/

Linear regression                               Number of obs     =        850
                                                F(16, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

                                  (Std. Err. adjusted for 50 clusters in state)
-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0583994     2.49   0.016     .0277837    .2624997
        lnemp |   1.499868   .4271839     3.51   0.001     .6414103    2.358326
              |
         year |
          80  |   .0228275   .0318813     0.72   0.477    -.0412404    .0868954
          81  |   .0501135   .0498013     1.01   0.319    -.0499659    .1501929
          82  |   .0943474   .0560909     1.68   0.099    -.0183715    .2070663
          83  |   .1425118   .0460038     3.10   0.003     .0500638    .2349599
          84  |    .498567   .0492231    10.13   0.000     .3996495    .5974845
          85  |   .7175139    .060448    11.87   0.000      .596039    .8389889
          86  |   .8454916   .0651168    12.98   0.000     .7146346    .9763487
          87  |   .9771231   .0753424    12.97   0.000     .8257169    1.128529
          88  |   1.301494   .0700871    18.57   0.000     1.160648    1.442339
          89  |   1.409538   .0782071    18.02   0.000     1.252375    1.566701
          90  |    1.47865   .0853992    17.31   0.000     1.307034    1.650266
          91  |   1.570146     .08527    18.41   0.000      1.39879    1.741502
          92  |   1.747922   .0898576    19.45   0.000     1.567347    1.928498
          93  |   2.037697   .0979778    20.80   0.000     1.840803     2.23459
          94  |   2.193295   .1143771    19.18   0.000     1.963445    2.423144
          95  |   2.312267   .1266629    18.26   0.000     2.057729    2.566806
              |
        state |
          12  |   4.161048   .4647597     8.95   0.000     3.227078    5.095017
          13  |  -2.989472   .4977384    -6.01   0.000    -3.989715   -1.989229
          14  |    9.11025    1.41176     6.45   0.000     6.273212    11.94729
          15  |    5.00001    .416609    12.00   0.000     4.162802    5.837217
          16  |   10.60946   1.136461     9.34   0.000     8.325655    12.89326
          21  |   9.848309   1.738079     5.67   0.000     6.355508    13.34111
          22  |   9.587233   1.304661     7.35   0.000     6.965417    12.20905
          23  |   6.610883   1.417544     4.66   0.000     3.762221    9.459545
          31  |   3.834553   1.299659     2.95   0.005      1.22279    6.446317
          32  |   3.723175   .9322915     3.99   0.000     1.849665    5.596685
          33  |   3.855385   1.304079     2.96   0.005      1.23474    6.476029
          34  |   3.898319   1.054135     3.70   0.001     1.779954    6.016683
          35  |    7.70993   .8332104     9.25   0.000     6.035531    9.384329
          41  |    9.25227   .6997398    13.22   0.000      7.84609    10.65845
          42  |   5.727127   .8074531     7.09   0.000     4.104489    7.349765
          43  |   6.353889    .709584     8.95   0.000     4.927927    7.779852
          44  |    1.83218   .3932353     4.66   0.000     1.041944    2.622416
          45  |   3.992405   .4942637     8.08   0.000     2.999145    4.985665
          46  |   4.272376   .4250511    10.05   0.000     3.418204    5.126548
          47  |   .4720782   .6460612     0.73   0.468    -.8262304    1.770387
          51  |   10.16903   .4052272    25.09   0.000       9.3547    10.98337
          52  |   8.228764   .8355439     9.85   0.000     6.549676    9.907853
          54  |   6.705244   .6395896    10.48   0.000     5.419941    7.990548
          55  |   5.491493    .901498     6.09   0.000     3.679865    7.303121
          56  |   .6147688    .517063     1.19   0.240    -.4243083    1.653846
          57  |   .1733435    .604218     0.29   0.775    -1.040878    1.387565
          58  |   4.597464   .3511137    13.09   0.000     3.891874    5.303053
          59  |   2.910721   .3745213     7.77   0.000     2.158092    3.663349
          61  |   3.429778   .5337292     6.43   0.000      2.35721    4.502347
          62  |   1.529689   .4964817     3.08   0.003     .5319718    2.527406
          63  |   .1110399    .722517     0.15   0.878    -1.340912    1.562992
          64  |  -8.360757   .3425248   -24.41   0.000    -9.049086   -7.672428
          71  |   -2.84782   .4006998    -7.11   0.000    -3.653057   -2.042584
          72  |   7.545168   1.054001     7.16   0.000     5.427074    9.663261
          73  |   5.065417   .8452861     5.99   0.000     3.366751    6.764083
          74  |   4.444996   1.314643     3.38   0.001     1.803122    7.086869
          81  |  -4.667171   .4807288    -9.71   0.000    -5.633232    -3.70111
          82  |   .6493388   .3036154     2.14   0.037     .0392008    1.259477
          83  |   1.764114   .6144766     2.87   0.006     .5292773    2.998951
          84  |   8.679613   .5472741    15.86   0.000     7.579824    9.779401
          85  |   2.398924   .1461975    16.41   0.000      2.10513    2.692719
          86  |   7.228274   .3636178    19.88   0.000     6.497557    7.958991
          87  |  -.2487644   .4919375    -0.51   0.615     -1.23735     .739821
          88  |   5.872883   .9510628     6.18   0.000     3.961651    7.784116
          91  |   5.839442   .2104484    27.75   0.000      5.41653    6.262354
          92  |   3.007486    .244874    12.28   0.000     2.515393    3.499578
          93  |    8.27507   1.377914     6.01   0.000     5.506047    11.04409
          94  |   4.072716   .5625016     7.24   0.000     2.942327    5.203106
          95  |   9.403113   .4564124    20.60   0.000     8.485918    10.32031
              |
_IstaXyear_12 |    -.04131   .0049986    -8.26   0.000    -.0513551   -.0312649
_IstaXyear_13 |   .0317075   .0045957     6.90   0.000      .022472     .040943
_IstaXyear_14 |  -.1027491   .0081759   -12.57   0.000    -.1191792   -.0863191
_IstaXyear_15 |  -.0450472   .0051637    -8.72   0.000     -.055424   -.0346704
_IstaXyear_16 |  -.1178754   .0078515   -15.01   0.000    -.1336535   -.1020973
_IstaXyear_21 |  -.1178324   .0067422   -17.48   0.000    -.1313813   -.1042834
_IstaXyear_22 |  -.1118645   .0064469   -17.35   0.000    -.1248201    -.098909
_IstaXyear_23 |  -.0809985    .004695   -17.25   0.000    -.0904335   -.0715636
_IstaXyear_31 |  -.0476254   .0045549   -10.46   0.000    -.0567789   -.0384719
_IstaXyear_32 |  -.0452292    .005205    -8.69   0.000     -.055689   -.0347694
_IstaXyear_33 |  -.0476682   .0034772   -13.71   0.000     -.054656   -.0406805
_IstaXyear_34 |  -.0465305    .002303   -20.20   0.000    -.0511585   -.0419024
_IstaXyear_35 |  -.0882184   .0046681   -18.90   0.000    -.0975994   -.0788375
_IstaXyear_41 |  -.1031885    .003611   -28.58   0.000     -.110445    -.095932
_IstaXyear_42 |  -.0694882   .0059369   -11.70   0.000     -.081419   -.0575575
_IstaXyear_43 |  -.0738372   .0013738   -53.75   0.000     -.076598   -.0710764
_IstaXyear_44 |  -.0324975    .005867    -5.54   0.000    -.0442878   -.0207072
_IstaXyear_45 |  -.0499423    .003894   -12.83   0.000    -.0577676   -.0421169
_IstaXyear_46 |  -.0454383   .0038444   -11.82   0.000     -.053164   -.0377126
_IstaXyear_47 |  -.0078129   .0047253    -1.65   0.105    -.0173088    .0016829
_IstaXyear_51 |  -.1008186   .0026013   -38.76   0.000     -.106046   -.0955911
_IstaXyear_52 |  -.0939309   .0047831   -19.64   0.000    -.1035429   -.0843189
_IstaXyear_54 |  -.0796572   .0041069   -19.40   0.000    -.0879103   -.0714041
_IstaXyear_55 |  -.0672679   .0090454    -7.44   0.000    -.0854453   -.0490904
_IstaXyear_56 |  -.0099554   .0029376    -3.39   0.001    -.0158588   -.0040521
_IstaXyear_57 |  -.0012724   .0050557    -0.25   0.802    -.0114322    .0088874
_IstaXyear_58 |  -.0514796   .0046174   -11.15   0.000    -.0607586   -.0422006
_IstaXyear_59 |  -.0310693   .0070556    -4.40   0.000    -.0452481   -.0168905
_IstaXyear_61 |  -.0404103   .0036192   -11.17   0.000    -.0476833   -.0331373
_IstaXyear_62 |  -.0182214   .0027364    -6.66   0.000    -.0237203   -.0127224
_IstaXyear_63 |  -.0054994   .0050414    -1.09   0.281    -.0156305    .0046316
_IstaXyear_64 |   .0876899   .0006739   130.11   0.000     .0863356    .0890442
_IstaXyear_71 |   .0343497   .0043848     7.83   0.000     .0255381    .0431614
_IstaXyear_72 |  -.0822234   .0060358   -13.62   0.000    -.0943528   -.0700939
_IstaXyear_73 |  -.0551852   .0052766   -10.46   0.000    -.0657889   -.0445814
_IstaXyear_74 |  -.0547346    .004764   -11.49   0.000    -.0643081    -.045161
_IstaXyear_81 |   .0440522   .0063244     6.97   0.000     .0313428    .0567617
_IstaXyear_82 |   -.009325   .0021347    -4.37   0.000    -.0136149   -.0050351
_IstaXyear_83 |   -.024653   .0103674    -2.38   0.021     -.045487    -.003819
_IstaXyear_84 |  -.0954928   .0036364   -26.26   0.000    -.1028004   -.0881851
_IstaXyear_85 |  -.0262562   .0021443   -12.24   0.000    -.0305653    -.021947
_IstaXyear_86 |   -.076577    .007714    -9.93   0.000    -.0920789    -.061075
_IstaXyear_87 |   .0077712   .0063311     1.23   0.226    -.0049516     .020494
_IstaXyear_88 |    -.06463   .0112713    -5.73   0.000    -.0872805   -.0419794
_IstaXyear_91 |  -.0704529   .0043004   -16.38   0.000    -.0790949   -.0618109
_IstaXyear_92 |  -.0326463   .0014192   -23.00   0.000    -.0354982   -.0297944
_IstaXyear_93 |  -.0993569   .0003808  -260.91   0.000    -.1001222   -.0985916
_IstaXyear_94 |  -.0497143   .0038949   -12.76   0.000    -.0575414   -.0418872
_IstaXyear_95 |  -.1042808   .0049639   -21.01   0.000    -.1142562   -.0943054
        _cons |  -13.32548   5.525634    -2.41   0.020    -24.42966   -2.221303
-------------------------------------------------------------------------------

. outreg2 using "results/table1", append excel dec(4) ctitle("OLS") ///
> drop(_Iy*) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Clustered err, YES)
results/table1.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gr two  (connect lnemp year,  lcolor(red)  mcolor(red)  lpattern(solid) ) ///
>                 (connect lnths year,  lcolor(blue) mcolor(blue) lpattern(solid) yaxis(2) ) ///
>                 , legend( lab(1 "THS empl") lab(2 "Overall empl")) ///
>                 title("Total and THS employment by year") xtitle("Year") ///
>                 saving("graphs/Fig3", replace)
(note: file graphs/Fig3.gph not found)
(file graphs/Fig3.gph saved)

.                 graph export "graphs/Fig3.eps", replace
(file graphs/Fig3.eps written in EPS format)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg lnths D lnemp i.year                 , cluster(state) /*Year Fix effecs*/

Linear regression                               Number of obs     =        850
                                                F(18, 49)         =     143.98
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9136
                                                Root MSE          =     .50787

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           D |  -.0402029   .1363369    -0.29   0.769    -.3141822    .2337764
       lnemp |   1.443832    .067588    21.36   0.000     1.308009    1.579656
             |
        year |
         80  |  -.0177994   .0321506    -0.55   0.582    -.0824085    .0468097
         81  |  -.0346292   .0496891    -0.70   0.489    -.1344833    .0652249
         82  |  -.0322538   .0574139    -0.56   0.577    -.1476314    .0831239
         83  |   .0051925   .0578272     0.09   0.929    -.1110157    .1214006
         84  |    .326594   .0663361     4.92   0.000     .1932866    .4599013
         85  |   .5246585   .0867216     6.05   0.000      .350385    .6989321
         86  |   .6163453   .0881333     6.99   0.000     .4392349    .7934557
         87  |   .7195628   .1009275     7.13   0.000     .5167414    .9223842
         88  |   1.004868   .1065524     9.43   0.000     .7907427    1.218993
         89  |   1.062489   .1024737    10.37   0.000     .8565607    1.268418
         90  |   1.084327    .107581    10.08   0.000     .8681348    1.300519
         91  |   1.127223   .1079253    10.44   0.000     .9103385    1.344107
         92  |   1.257437   .1069359    11.76   0.000     1.042542    1.472333
         93  |   1.500292   .1115374    13.45   0.000      1.27615    1.724435
         94  |   1.609426   .1157581    13.90   0.000     1.376801     1.84205
         95  |   1.681598   .1173389    14.33   0.000     1.445796    1.917399
             |
       _cons |  -12.15634   1.006813   -12.07   0.000    -14.17961   -10.13308
------------------------------------------------------------------------------

. outreg2 using "results/table1", append excel dec(4) ctitle("OLS") ///
> addtext(State FE, NO, Year FE, YES, StateXyear, NO, Clustered err, YES)
results/table1.xml
dir : seeout

. 
. reg lnths D lnemp i.year i.state          , cluster(state) /*Year and State Fix effecs*/

Linear regression                               Number of obs     =        850
                                                F(17, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9727
                                                Root MSE          =     .29436

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           D |   .1279696   .0915282     1.40   0.168    -.0559632    .3119024
       lnemp |   2.013695   .4366315     4.61   0.000     1.136251    2.891139
             |
        year |
         80  |  -.0271011   .0335374    -0.81   0.423     -.094497    .0402948
         81  |  -.0520864   .0517957    -1.01   0.320    -.1561738     .052001
         82  |  -.0464878   .0609064    -0.76   0.449    -.1688839    .0759082
         83  |  -.0478298   .0605516    -0.79   0.433    -.1695127    .0738531
         84  |   .2378591   .0673139     3.53   0.001     .1025867    .3731315
         85  |   .3974986   .0851085     4.67   0.000     .2264667    .5685305
         86  |   .4701224   .0923542     5.09   0.000     .2845296    .6557151
         87  |   .5428393   .1058637     5.13   0.000     .3300982    .7555803
         88  |   .8029633   .1147031     7.00   0.000     .5724588    1.033468
         89  |   .8479019   .1208701     7.01   0.000     .6050044    1.090799
         90  |   .8593748   .1365562     6.29   0.000     .5849549    1.133795
         91  |   .9053851   .1435989     6.30   0.000     .6168123    1.193958
         92  |   1.028154   .1469509     7.00   0.000     .7328454    1.323463
         93  |   1.257026   .1482435     8.48   0.000       .95912    1.554933
         94  |   1.347562   .1620852     8.31   0.000      1.02184    1.673284
         95  |   1.404545   .1733557     8.10   0.000     1.056174    1.752917
             |
       state |
         12  |   .5731177   .0483885    11.84   0.000     .4758774    .6703579
         13  |   .1322159   .3109255     0.43   0.673    -.4926123    .7570441
         14  |   -.755224   .7875584    -0.96   0.342    -2.337882    .8274339
         15  |   1.124781   .0987861    11.39   0.000     .9262625    1.323299
         16  |  -.2493057   .5132262    -0.49   0.629    -1.280672     .782061
         21  |  -1.833339   1.215117    -1.51   0.138    -4.275208    .6085295
         22  |  -1.156605   .8595422    -1.35   0.185    -2.883919    .5707099
         23  |  -1.648396   1.032282    -1.60   0.117    -3.722844    .4260523
         31  |  -1.473357   .9893356    -1.49   0.143    -3.461501    .5147877
         32  |  -1.033771   .6988883    -1.48   0.145    -2.438239    .3706979
         33  |  -1.496451   1.023711    -1.46   0.150    -3.553675     .560772
         34  |  -1.200927   .8930844    -1.34   0.185    -2.995648    .5937932
         35  |  -.7375311   .6564929    -1.12   0.267    -2.056803    .5817408
         41  |  -.4563678   .6212807    -0.73   0.466    -1.704878    .7921425
         42  |  -.7799299   .3936272    -1.98   0.053    -1.570953    .0110935
         43  |  -.8592412   .6720034    -1.28   0.207    -2.209683    .4912002
         44  |  -.6889873   .2620627    -2.63   0.011    -1.215622   -.1623525
         45  |  -.0601448   .2498676    -0.24   0.811    -.5622727     .441983
         46  |   .1316943   .1603362     0.82   0.415    -.1905133     .453902
         47  |   -.603323   .3367097    -1.79   0.079    -1.279966    .0733204
         51  |   1.608219   .2022138     7.95   0.000     1.201855    2.014583
         52  |  -.6689812   .6168619    -1.08   0.283    -1.908612    .5706492
         54  |  -1.091003   .7358035    -1.48   0.145    -2.569656     .387649
         55  |  -.5047244    .127089    -3.97   0.000    -.7601193   -.2493296
         56  |  -1.176983    .789819    -1.49   0.143    -2.764184    .4102176
         57  |   -.487013   .4681042    -1.04   0.303    -1.427704    .4536776
         58  |  -.7812736   .7682007    -1.02   0.314    -2.325031    .7624835
         59  |  -.9759733   1.007957    -0.97   0.338    -3.001538    1.049591
         61  |  -.6214781   .4551376    -1.37   0.178    -1.536111    .2931552
         62  |  -.7941831   .6275074    -1.27   0.212    -2.055206    .4668403
         63  |  -.9663281   .5098013    -1.90   0.064    -1.990812    .0581559
         64  |  -1.067561   .2975517    -3.59   0.001    -1.665514   -.4696087
         71  |  -.1598117   .2560968    -0.62   0.536    -.6744575    .3548341
         72  |  -.2426113    .544676    -0.45   0.658    -1.337179    .8519561
         73  |  -.2002489   .3947622    -0.51   0.614    -.9935533    .5930555
         74  |  -1.678949    1.15716    -1.45   0.153    -4.004349      .64645
         81  |  -.5913223   .2120122    -2.79   0.008    -1.017377   -.1652678
         82  |  -.0201297    .120502    -0.17   0.868    -.2622876    .2220283
         83  |    .051365   .3692334     0.14   0.890    -.6906374    .7933673
         84  |  -.2025523   .4880194    -0.42   0.680    -1.183264    .7781593
         85  |   .0510225   .0542057     0.94   0.351     -.057908     .159953
         86  |   .0431513   .4444131     0.10   0.923    -.8499303     .936233
         87  |   .2522165   .1526288     1.65   0.105    -.0545025    .5589355
         88  |    .206757   .0421452     4.91   0.000     .1220631    .2914509
         91  |  -.9931089   .5975125    -1.66   0.103    -2.193855    .2076374
         92  |  -.2757928   .3764868    -0.73   0.467    -1.032371    .4807857
         93  |  -1.986518   1.374525    -1.45   0.155    -4.748729    .7756932
         94  |   .1445305   .3384578     0.43   0.671    -.5356259     .824687
         95  |   .3407262   .0384788     8.85   0.000     .2634002    .4180523
             |
       _cons |  -19.58999   5.648716    -3.47   0.001    -30.94151   -8.238467
------------------------------------------------------------------------------

. outreg2 using "results/table1", append excel dec(4) ctitle("OLS") ///
> addtext(State FE, YES, Year FE, YES, StateXyear, NO, Clustered err, YES)
results/table1.xml
dir : seeout

. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  , cluster(state) /*Year and State Fix effecs*/

Linear regression                               Number of obs     =        850
                                                F(16, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

                                  (Std. Err. adjusted for 50 clusters in state)
-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0583994     2.49   0.016     .0277837    .2624997
        lnemp |   1.499868   .4271839     3.51   0.001     .6414103    2.358326
              |
         year |
          80  |   .0228275   .0318813     0.72   0.477    -.0412404    .0868954
          81  |   .0501135   .0498013     1.01   0.319    -.0499659    .1501929
          82  |   .0943474   .0560909     1.68   0.099    -.0183715    .2070663
          83  |   .1425118   .0460038     3.10   0.003     .0500638    .2349599
          84  |    .498567   .0492231    10.13   0.000     .3996495    .5974845
          85  |   .7175139    .060448    11.87   0.000      .596039    .8389889
          86  |   .8454916   .0651168    12.98   0.000     .7146346    .9763487
          87  |   .9771231   .0753424    12.97   0.000     .8257169    1.128529
          88  |   1.301494   .0700871    18.57   0.000     1.160648    1.442339
          89  |   1.409538   .0782071    18.02   0.000     1.252375    1.566701
          90  |    1.47865   .0853992    17.31   0.000     1.307034    1.650266
          91  |   1.570146     .08527    18.41   0.000      1.39879    1.741502
          92  |   1.747922   .0898576    19.45   0.000     1.567347    1.928498
          93  |   2.037697   .0979778    20.80   0.000     1.840803     2.23459
          94  |   2.193295   .1143771    19.18   0.000     1.963445    2.423144
          95  |   2.312267   .1266629    18.26   0.000     2.057729    2.566806
              |
        state |
          12  |   4.161048   .4647597     8.95   0.000     3.227078    5.095017
          13  |  -2.989472   .4977384    -6.01   0.000    -3.989715   -1.989229
          14  |    9.11025    1.41176     6.45   0.000     6.273212    11.94729
          15  |    5.00001    .416609    12.00   0.000     4.162802    5.837217
          16  |   10.60946   1.136461     9.34   0.000     8.325655    12.89326
          21  |   9.848309   1.738079     5.67   0.000     6.355508    13.34111
          22  |   9.587233   1.304661     7.35   0.000     6.965417    12.20905
          23  |   6.610883   1.417544     4.66   0.000     3.762221    9.459545
          31  |   3.834553   1.299659     2.95   0.005      1.22279    6.446317
          32  |   3.723175   .9322915     3.99   0.000     1.849665    5.596685
          33  |   3.855385   1.304079     2.96   0.005      1.23474    6.476029
          34  |   3.898319   1.054135     3.70   0.001     1.779954    6.016683
          35  |    7.70993   .8332104     9.25   0.000     6.035531    9.384329
          41  |    9.25227   .6997398    13.22   0.000      7.84609    10.65845
          42  |   5.727127   .8074531     7.09   0.000     4.104489    7.349765
          43  |   6.353889    .709584     8.95   0.000     4.927927    7.779852
          44  |    1.83218   .3932353     4.66   0.000     1.041944    2.622416
          45  |   3.992405   .4942637     8.08   0.000     2.999145    4.985665
          46  |   4.272376   .4250511    10.05   0.000     3.418204    5.126548
          47  |   .4720782   .6460612     0.73   0.468    -.8262304    1.770387
          51  |   10.16903   .4052272    25.09   0.000       9.3547    10.98337
          52  |   8.228764   .8355439     9.85   0.000     6.549676    9.907853
          54  |   6.705244   .6395896    10.48   0.000     5.419941    7.990548
          55  |   5.491493    .901498     6.09   0.000     3.679865    7.303121
          56  |   .6147688    .517063     1.19   0.240    -.4243083    1.653846
          57  |   .1733435    .604218     0.29   0.775    -1.040878    1.387565
          58  |   4.597464   .3511137    13.09   0.000     3.891874    5.303053
          59  |   2.910721   .3745213     7.77   0.000     2.158092    3.663349
          61  |   3.429778   .5337292     6.43   0.000      2.35721    4.502347
          62  |   1.529689   .4964817     3.08   0.003     .5319718    2.527406
          63  |   .1110399    .722517     0.15   0.878    -1.340912    1.562992
          64  |  -8.360757   .3425248   -24.41   0.000    -9.049086   -7.672428
          71  |   -2.84782   .4006998    -7.11   0.000    -3.653057   -2.042584
          72  |   7.545168   1.054001     7.16   0.000     5.427074    9.663261
          73  |   5.065417   .8452861     5.99   0.000     3.366751    6.764083
          74  |   4.444996   1.314643     3.38   0.001     1.803122    7.086869
          81  |  -4.667171   .4807288    -9.71   0.000    -5.633232    -3.70111
          82  |   .6493388   .3036154     2.14   0.037     .0392008    1.259477
          83  |   1.764114   .6144766     2.87   0.006     .5292773    2.998951
          84  |   8.679613   .5472741    15.86   0.000     7.579824    9.779401
          85  |   2.398924   .1461975    16.41   0.000      2.10513    2.692719
          86  |   7.228274   .3636178    19.88   0.000     6.497557    7.958991
          87  |  -.2487644   .4919375    -0.51   0.615     -1.23735     .739821
          88  |   5.872883   .9510628     6.18   0.000     3.961651    7.784116
          91  |   5.839442   .2104484    27.75   0.000      5.41653    6.262354
          92  |   3.007486    .244874    12.28   0.000     2.515393    3.499578
          93  |    8.27507   1.377914     6.01   0.000     5.506047    11.04409
          94  |   4.072716   .5625016     7.24   0.000     2.942327    5.203106
          95  |   9.403113   .4564124    20.60   0.000     8.485918    10.32031
              |
_IstaXyear_12 |    -.04131   .0049986    -8.26   0.000    -.0513551   -.0312649
_IstaXyear_13 |   .0317075   .0045957     6.90   0.000      .022472     .040943
_IstaXyear_14 |  -.1027491   .0081759   -12.57   0.000    -.1191792   -.0863191
_IstaXyear_15 |  -.0450472   .0051637    -8.72   0.000     -.055424   -.0346704
_IstaXyear_16 |  -.1178754   .0078515   -15.01   0.000    -.1336535   -.1020973
_IstaXyear_21 |  -.1178324   .0067422   -17.48   0.000    -.1313813   -.1042834
_IstaXyear_22 |  -.1118645   .0064469   -17.35   0.000    -.1248201    -.098909
_IstaXyear_23 |  -.0809985    .004695   -17.25   0.000    -.0904335   -.0715636
_IstaXyear_31 |  -.0476254   .0045549   -10.46   0.000    -.0567789   -.0384719
_IstaXyear_32 |  -.0452292    .005205    -8.69   0.000     -.055689   -.0347694
_IstaXyear_33 |  -.0476682   .0034772   -13.71   0.000     -.054656   -.0406805
_IstaXyear_34 |  -.0465305    .002303   -20.20   0.000    -.0511585   -.0419024
_IstaXyear_35 |  -.0882184   .0046681   -18.90   0.000    -.0975994   -.0788375
_IstaXyear_41 |  -.1031885    .003611   -28.58   0.000     -.110445    -.095932
_IstaXyear_42 |  -.0694882   .0059369   -11.70   0.000     -.081419   -.0575575
_IstaXyear_43 |  -.0738372   .0013738   -53.75   0.000     -.076598   -.0710764
_IstaXyear_44 |  -.0324975    .005867    -5.54   0.000    -.0442878   -.0207072
_IstaXyear_45 |  -.0499423    .003894   -12.83   0.000    -.0577676   -.0421169
_IstaXyear_46 |  -.0454383   .0038444   -11.82   0.000     -.053164   -.0377126
_IstaXyear_47 |  -.0078129   .0047253    -1.65   0.105    -.0173088    .0016829
_IstaXyear_51 |  -.1008186   .0026013   -38.76   0.000     -.106046   -.0955911
_IstaXyear_52 |  -.0939309   .0047831   -19.64   0.000    -.1035429   -.0843189
_IstaXyear_54 |  -.0796572   .0041069   -19.40   0.000    -.0879103   -.0714041
_IstaXyear_55 |  -.0672679   .0090454    -7.44   0.000    -.0854453   -.0490904
_IstaXyear_56 |  -.0099554   .0029376    -3.39   0.001    -.0158588   -.0040521
_IstaXyear_57 |  -.0012724   .0050557    -0.25   0.802    -.0114322    .0088874
_IstaXyear_58 |  -.0514796   .0046174   -11.15   0.000    -.0607586   -.0422006
_IstaXyear_59 |  -.0310693   .0070556    -4.40   0.000    -.0452481   -.0168905
_IstaXyear_61 |  -.0404103   .0036192   -11.17   0.000    -.0476833   -.0331373
_IstaXyear_62 |  -.0182214   .0027364    -6.66   0.000    -.0237203   -.0127224
_IstaXyear_63 |  -.0054994   .0050414    -1.09   0.281    -.0156305    .0046316
_IstaXyear_64 |   .0876899   .0006739   130.11   0.000     .0863356    .0890442
_IstaXyear_71 |   .0343497   .0043848     7.83   0.000     .0255381    .0431614
_IstaXyear_72 |  -.0822234   .0060358   -13.62   0.000    -.0943528   -.0700939
_IstaXyear_73 |  -.0551852   .0052766   -10.46   0.000    -.0657889   -.0445814
_IstaXyear_74 |  -.0547346    .004764   -11.49   0.000    -.0643081    -.045161
_IstaXyear_81 |   .0440522   .0063244     6.97   0.000     .0313428    .0567617
_IstaXyear_82 |   -.009325   .0021347    -4.37   0.000    -.0136149   -.0050351
_IstaXyear_83 |   -.024653   .0103674    -2.38   0.021     -.045487    -.003819
_IstaXyear_84 |  -.0954928   .0036364   -26.26   0.000    -.1028004   -.0881851
_IstaXyear_85 |  -.0262562   .0021443   -12.24   0.000    -.0305653    -.021947
_IstaXyear_86 |   -.076577    .007714    -9.93   0.000    -.0920789    -.061075
_IstaXyear_87 |   .0077712   .0063311     1.23   0.226    -.0049516     .020494
_IstaXyear_88 |    -.06463   .0112713    -5.73   0.000    -.0872805   -.0419794
_IstaXyear_91 |  -.0704529   .0043004   -16.38   0.000    -.0790949   -.0618109
_IstaXyear_92 |  -.0326463   .0014192   -23.00   0.000    -.0354982   -.0297944
_IstaXyear_93 |  -.0993569   .0003808  -260.91   0.000    -.1001222   -.0985916
_IstaXyear_94 |  -.0497143   .0038949   -12.76   0.000    -.0575414   -.0418872
_IstaXyear_95 |  -.1042808   .0049639   -21.01   0.000    -.1142562   -.0943054
        _cons |  -13.32548   5.525634    -2.41   0.020    -24.42966   -2.221303
-------------------------------------------------------------------------------

. outreg2 using "results/table1", append excel dec(4) ctitle("OLS") ///
> drop(_IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Cluster)
results/table1.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg lnths D lnemp i.year i.state  _IstaXyear*  , cluster(state) 

Linear regression                               Number of obs     =        850
                                                F(16, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

                                  (Std. Err. adjusted for 50 clusters in state)
-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0583994     2.49   0.016     .0277837    .2624997
        lnemp |   1.499868   .4271839     3.51   0.001     .6414103    2.358326
              |
         year |
          80  |   .0228275   .0318813     0.72   0.477    -.0412404    .0868954
          81  |   .0501135   .0498013     1.01   0.319    -.0499659    .1501929
          82  |   .0943474   .0560909     1.68   0.099    -.0183715    .2070663
          83  |   .1425118   .0460038     3.10   0.003     .0500638    .2349599
          84  |    .498567   .0492231    10.13   0.000     .3996495    .5974845
          85  |   .7175139    .060448    11.87   0.000      .596039    .8389889
          86  |   .8454916   .0651168    12.98   0.000     .7146346    .9763487
          87  |   .9771231   .0753424    12.97   0.000     .8257169    1.128529
          88  |   1.301494   .0700871    18.57   0.000     1.160648    1.442339
          89  |   1.409538   .0782071    18.02   0.000     1.252375    1.566701
          90  |    1.47865   .0853992    17.31   0.000     1.307034    1.650266
          91  |   1.570146     .08527    18.41   0.000      1.39879    1.741502
          92  |   1.747922   .0898576    19.45   0.000     1.567347    1.928498
          93  |   2.037697   .0979778    20.80   0.000     1.840803     2.23459
          94  |   2.193295   .1143771    19.18   0.000     1.963445    2.423144
          95  |   2.312267   .1266629    18.26   0.000     2.057729    2.566806
              |
        state |
          12  |   4.161048   .4647597     8.95   0.000     3.227078    5.095017
          13  |  -2.989472   .4977384    -6.01   0.000    -3.989715   -1.989229
          14  |    9.11025    1.41176     6.45   0.000     6.273212    11.94729
          15  |    5.00001    .416609    12.00   0.000     4.162802    5.837217
          16  |   10.60946   1.136461     9.34   0.000     8.325655    12.89326
          21  |   9.848309   1.738079     5.67   0.000     6.355508    13.34111
          22  |   9.587233   1.304661     7.35   0.000     6.965417    12.20905
          23  |   6.610883   1.417544     4.66   0.000     3.762221    9.459545
          31  |   3.834553   1.299659     2.95   0.005      1.22279    6.446317
          32  |   3.723175   .9322915     3.99   0.000     1.849665    5.596685
          33  |   3.855385   1.304079     2.96   0.005      1.23474    6.476029
          34  |   3.898319   1.054135     3.70   0.001     1.779954    6.016683
          35  |    7.70993   .8332104     9.25   0.000     6.035531    9.384329
          41  |    9.25227   .6997398    13.22   0.000      7.84609    10.65845
          42  |   5.727127   .8074531     7.09   0.000     4.104489    7.349765
          43  |   6.353889    .709584     8.95   0.000     4.927927    7.779852
          44  |    1.83218   .3932353     4.66   0.000     1.041944    2.622416
          45  |   3.992405   .4942637     8.08   0.000     2.999145    4.985665
          46  |   4.272376   .4250511    10.05   0.000     3.418204    5.126548
          47  |   .4720782   .6460612     0.73   0.468    -.8262304    1.770387
          51  |   10.16903   .4052272    25.09   0.000       9.3547    10.98337
          52  |   8.228764   .8355439     9.85   0.000     6.549676    9.907853
          54  |   6.705244   .6395896    10.48   0.000     5.419941    7.990548
          55  |   5.491493    .901498     6.09   0.000     3.679865    7.303121
          56  |   .6147688    .517063     1.19   0.240    -.4243083    1.653846
          57  |   .1733435    .604218     0.29   0.775    -1.040878    1.387565
          58  |   4.597464   .3511137    13.09   0.000     3.891874    5.303053
          59  |   2.910721   .3745213     7.77   0.000     2.158092    3.663349
          61  |   3.429778   .5337292     6.43   0.000      2.35721    4.502347
          62  |   1.529689   .4964817     3.08   0.003     .5319718    2.527406
          63  |   .1110399    .722517     0.15   0.878    -1.340912    1.562992
          64  |  -8.360757   .3425248   -24.41   0.000    -9.049086   -7.672428
          71  |   -2.84782   .4006998    -7.11   0.000    -3.653057   -2.042584
          72  |   7.545168   1.054001     7.16   0.000     5.427074    9.663261
          73  |   5.065417   .8452861     5.99   0.000     3.366751    6.764083
          74  |   4.444996   1.314643     3.38   0.001     1.803122    7.086869
          81  |  -4.667171   .4807288    -9.71   0.000    -5.633232    -3.70111
          82  |   .6493388   .3036154     2.14   0.037     .0392008    1.259477
          83  |   1.764114   .6144766     2.87   0.006     .5292773    2.998951
          84  |   8.679613   .5472741    15.86   0.000     7.579824    9.779401
          85  |   2.398924   .1461975    16.41   0.000      2.10513    2.692719
          86  |   7.228274   .3636178    19.88   0.000     6.497557    7.958991
          87  |  -.2487644   .4919375    -0.51   0.615     -1.23735     .739821
          88  |   5.872883   .9510628     6.18   0.000     3.961651    7.784116
          91  |   5.839442   .2104484    27.75   0.000      5.41653    6.262354
          92  |   3.007486    .244874    12.28   0.000     2.515393    3.499578
          93  |    8.27507   1.377914     6.01   0.000     5.506047    11.04409
          94  |   4.072716   .5625016     7.24   0.000     2.942327    5.203106
          95  |   9.403113   .4564124    20.60   0.000     8.485918    10.32031
              |
_IstaXyear_12 |    -.04131   .0049986    -8.26   0.000    -.0513551   -.0312649
_IstaXyear_13 |   .0317075   .0045957     6.90   0.000      .022472     .040943
_IstaXyear_14 |  -.1027491   .0081759   -12.57   0.000    -.1191792   -.0863191
_IstaXyear_15 |  -.0450472   .0051637    -8.72   0.000     -.055424   -.0346704
_IstaXyear_16 |  -.1178754   .0078515   -15.01   0.000    -.1336535   -.1020973
_IstaXyear_21 |  -.1178324   .0067422   -17.48   0.000    -.1313813   -.1042834
_IstaXyear_22 |  -.1118645   .0064469   -17.35   0.000    -.1248201    -.098909
_IstaXyear_23 |  -.0809985    .004695   -17.25   0.000    -.0904335   -.0715636
_IstaXyear_31 |  -.0476254   .0045549   -10.46   0.000    -.0567789   -.0384719
_IstaXyear_32 |  -.0452292    .005205    -8.69   0.000     -.055689   -.0347694
_IstaXyear_33 |  -.0476682   .0034772   -13.71   0.000     -.054656   -.0406805
_IstaXyear_34 |  -.0465305    .002303   -20.20   0.000    -.0511585   -.0419024
_IstaXyear_35 |  -.0882184   .0046681   -18.90   0.000    -.0975994   -.0788375
_IstaXyear_41 |  -.1031885    .003611   -28.58   0.000     -.110445    -.095932
_IstaXyear_42 |  -.0694882   .0059369   -11.70   0.000     -.081419   -.0575575
_IstaXyear_43 |  -.0738372   .0013738   -53.75   0.000     -.076598   -.0710764
_IstaXyear_44 |  -.0324975    .005867    -5.54   0.000    -.0442878   -.0207072
_IstaXyear_45 |  -.0499423    .003894   -12.83   0.000    -.0577676   -.0421169
_IstaXyear_46 |  -.0454383   .0038444   -11.82   0.000     -.053164   -.0377126
_IstaXyear_47 |  -.0078129   .0047253    -1.65   0.105    -.0173088    .0016829
_IstaXyear_51 |  -.1008186   .0026013   -38.76   0.000     -.106046   -.0955911
_IstaXyear_52 |  -.0939309   .0047831   -19.64   0.000    -.1035429   -.0843189
_IstaXyear_54 |  -.0796572   .0041069   -19.40   0.000    -.0879103   -.0714041
_IstaXyear_55 |  -.0672679   .0090454    -7.44   0.000    -.0854453   -.0490904
_IstaXyear_56 |  -.0099554   .0029376    -3.39   0.001    -.0158588   -.0040521
_IstaXyear_57 |  -.0012724   .0050557    -0.25   0.802    -.0114322    .0088874
_IstaXyear_58 |  -.0514796   .0046174   -11.15   0.000    -.0607586   -.0422006
_IstaXyear_59 |  -.0310693   .0070556    -4.40   0.000    -.0452481   -.0168905
_IstaXyear_61 |  -.0404103   .0036192   -11.17   0.000    -.0476833   -.0331373
_IstaXyear_62 |  -.0182214   .0027364    -6.66   0.000    -.0237203   -.0127224
_IstaXyear_63 |  -.0054994   .0050414    -1.09   0.281    -.0156305    .0046316
_IstaXyear_64 |   .0876899   .0006739   130.11   0.000     .0863356    .0890442
_IstaXyear_71 |   .0343497   .0043848     7.83   0.000     .0255381    .0431614
_IstaXyear_72 |  -.0822234   .0060358   -13.62   0.000    -.0943528   -.0700939
_IstaXyear_73 |  -.0551852   .0052766   -10.46   0.000    -.0657889   -.0445814
_IstaXyear_74 |  -.0547346    .004764   -11.49   0.000    -.0643081    -.045161
_IstaXyear_81 |   .0440522   .0063244     6.97   0.000     .0313428    .0567617
_IstaXyear_82 |   -.009325   .0021347    -4.37   0.000    -.0136149   -.0050351
_IstaXyear_83 |   -.024653   .0103674    -2.38   0.021     -.045487    -.003819
_IstaXyear_84 |  -.0954928   .0036364   -26.26   0.000    -.1028004   -.0881851
_IstaXyear_85 |  -.0262562   .0021443   -12.24   0.000    -.0305653    -.021947
_IstaXyear_86 |   -.076577    .007714    -9.93   0.000    -.0920789    -.061075
_IstaXyear_87 |   .0077712   .0063311     1.23   0.226    -.0049516     .020494
_IstaXyear_88 |    -.06463   .0112713    -5.73   0.000    -.0872805   -.0419794
_IstaXyear_91 |  -.0704529   .0043004   -16.38   0.000    -.0790949   -.0618109
_IstaXyear_92 |  -.0326463   .0014192   -23.00   0.000    -.0354982   -.0297944
_IstaXyear_93 |  -.0993569   .0003808  -260.91   0.000    -.1001222   -.0985916
_IstaXyear_94 |  -.0497143   .0038949   -12.76   0.000    -.0575414   -.0418872
_IstaXyear_95 |  -.1042808   .0049639   -21.01   0.000    -.1142562   -.0943054
        _cons |  -13.32548   5.525634    -2.41   0.020    -24.42966   -2.221303
-------------------------------------------------------------------------------

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg lnths D lnemp i.year i.state  _IstaXyear*  , r /*OLS + robust se*/

Linear regression                               Number of obs     =        850
                                                F(116, 733)       =    1267.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0343738     4.22   0.000     .0776589    .2126244
        lnemp |   1.499868   .2744967     5.46   0.000     .9609748    2.038762
              |
         year |
          80  |   .0228275   .0457262     0.50   0.618    -.0669424    .1125974
          81  |   .0501135   .0459611     1.09   0.276    -.0401175    .1403445
          82  |   .0943474   .0500853     1.88   0.060    -.0039803    .1926751
          83  |   .1425118   .0464957     3.07   0.002     .0512312    .2337925
          84  |    .498567   .0537563     9.27   0.000     .3930323    .6041017
          85  |   .7175139    .064882    11.06   0.000     .5901372    .8448907
          86  |   .8454916   .0741009    11.41   0.000     .7000163    .9909669
          87  |   .9771231   .0837868    11.66   0.000     .8126323    1.141614
          88  |   1.301494    .084743    15.36   0.000     1.135126    1.467861
          89  |   1.409538   .0940368    14.99   0.000     1.224924    1.594151
          90  |    1.47865   .1021715    14.47   0.000     1.278067    1.679234
          91  |   1.570146   .1082885    14.50   0.000     1.357553    1.782738
          92  |   1.747922   .1133281    15.42   0.000     1.525436    1.970409
          93  |   2.037697   .1221159    16.69   0.000     1.797958    2.277435
          94  |   2.193295   .1324259    16.56   0.000     1.933315    2.453274
          95  |   2.312267   .1417715    16.31   0.000     2.033941    2.590594
              |
        state |
          12  |   4.161048    1.84052     2.26   0.024     .5477283    7.774367
          13  |  -2.989472   2.028842    -1.47   0.141    -6.972507    .9935623
          14  |    9.11025    1.14942     7.93   0.000     6.853703     11.3668
          15  |    5.00001   1.159479     4.31   0.000     2.723713    7.276306
          16  |   10.60946   1.099627     9.65   0.000     8.450665    12.76825
          21  |   9.848309   1.291515     7.63   0.000     7.312799    12.38382
          22  |   9.587233   1.193792     8.03   0.000     7.243573    11.93089
          23  |   6.610883   1.121555     5.89   0.000      4.40904    8.812726
          31  |   3.834553   1.075218     3.57   0.000     1.723679    5.945427
          32  |   3.723175   1.008239     3.69   0.000     1.743794    5.702555
          33  |   3.855385    1.13311     3.40   0.001     1.630858    6.079912
          34  |   3.898319    1.27107     3.07   0.002     1.402947    6.393691
          35  |    7.70993    .898434     8.58   0.000     5.946119    9.473741
          41  |    9.25227   1.209408     7.65   0.000     6.877954    11.62659
          42  |   5.727127   1.156614     4.95   0.000     3.456456    7.997797
          43  |   6.353889   .9156868     6.94   0.000     4.556208    8.151571
          44  |    1.83218   2.247035     0.82   0.415    -2.579211    6.243571
          45  |   3.992405   1.879351     2.12   0.034     .3028526    7.681958
          46  |   4.272376   .9529567     4.48   0.000     2.401526    6.143226
          47  |   .4720782   .8938149     0.53   0.598    -1.282664    2.226821
          51  |   10.16903   1.014345    10.03   0.000     8.177667     12.1604
          52  |   8.228764   .9534479     8.63   0.000      6.35695    10.10058
          54  |   6.705244   .9691691     6.92   0.000     4.802566    8.607923
          55  |   5.491493    .976355     5.62   0.000     3.574707    7.408278
          56  |   .6147688   .9053289     0.68   0.497    -1.162578    2.392116
          57  |   .1733435   .8362726     0.21   0.836    -1.468432    1.815119
          58  |   4.597464   .8161614     5.63   0.000     2.995171    6.199756
          59  |   2.910721   .8587114     3.39   0.001     1.224894    4.596548
          61  |   3.429778   .9351579     3.67   0.000     1.593871    5.265686
          62  |   1.529689   1.041769     1.47   0.142    -.5155183    3.574896
          63  |   .1110399   1.114614     0.10   0.921    -2.077176    2.299256
          64  |  -8.360757    1.42726    -5.86   0.000    -11.16276   -5.558752
          71  |   -2.84782   1.156303    -2.46   0.014     -5.11788   -.5777605
          72  |   7.545168    1.06944     7.06   0.000     5.445636    9.644699
          73  |   5.065417   1.083656     4.67   0.000     2.937978    7.192856
          74  |   4.444996   1.277701     3.48   0.001     1.936606    6.953385
          81  |  -4.667171   1.188281    -3.93   0.000     -7.00001   -2.334332
          82  |   .6493388   1.007269     0.64   0.519    -1.328137    2.626814
          83  |   1.764114   1.545995     1.14   0.254    -1.270992    4.799221
          84  |   8.679613   .8978519     9.67   0.000     6.916945    10.44228
          85  |   2.398924   .8130916     2.95   0.003     .8026583     3.99519
          86  |   7.228274   .9034971     8.00   0.000     5.454524    9.002025
          87  |  -.2487644   1.173761    -0.21   0.832    -2.553099     2.05557
          88  |   5.872883   1.025537     5.73   0.000     3.859543    7.886224
          91  |   5.839442   .8143364     7.17   0.000     4.240732    7.438152
          92  |   3.007486   .8020193     3.75   0.000     1.432957    4.582014
          93  |    8.27507   1.134572     7.29   0.000     6.047673    10.50247
          94  |   4.072716   1.111653     3.66   0.000     1.890314    6.255119
          95  |   9.403113   1.043833     9.01   0.000     7.353855    11.45237
              |
_IstaXyear_12 |    -.04131   .0211214    -1.96   0.051    -.0827757    .0001556
_IstaXyear_13 |   .0317075   .0226103     1.40   0.161    -.0126811    .0760961
_IstaXyear_14 |  -.1027491   .0097698   -10.52   0.000    -.1219292   -.0835691
_IstaXyear_15 |  -.0450472   .0134773    -3.34   0.001    -.0715058   -.0185886
_IstaXyear_16 |  -.1178754   .0107679   -10.95   0.000    -.1390151   -.0967357
_IstaXyear_21 |  -.1178324    .008974   -13.13   0.000    -.1354503   -.1002145
_IstaXyear_22 |  -.1118645   .0107739   -10.38   0.000    -.1330158   -.0907132
_IstaXyear_23 |  -.0809985   .0080791   -10.03   0.000    -.0968596   -.0651375
_IstaXyear_31 |  -.0476254    .008447    -5.64   0.000    -.0642085   -.0310422
_IstaXyear_32 |  -.0452292   .0099742    -4.53   0.000    -.0648105   -.0256479
_IstaXyear_33 |  -.0476682    .008969    -5.31   0.000    -.0652762   -.0300602
_IstaXyear_34 |  -.0465305   .0120168    -3.87   0.000    -.0701218   -.0229391
_IstaXyear_35 |  -.0882184   .0089432    -9.86   0.000    -.1057759    -.070661
_IstaXyear_41 |  -.1031885   .0128823    -8.01   0.000    -.1284791    -.077898
_IstaXyear_42 |  -.0694882   .0126827    -5.48   0.000    -.0943871   -.0445894
_IstaXyear_43 |  -.0738372   .0088361    -8.36   0.000    -.0911844   -.0564901
_IstaXyear_44 |  -.0324975   .0249469    -1.30   0.193    -.0814734    .0164784
_IstaXyear_45 |  -.0499423   .0208388    -2.40   0.017    -.0908531   -.0090314
_IstaXyear_46 |  -.0454383   .0104174    -4.36   0.000    -.0658898   -.0249868
_IstaXyear_47 |  -.0078129   .0095131    -0.82   0.412    -.0264892    .0108633
_IstaXyear_51 |  -.1008186    .011119    -9.07   0.000    -.1226474   -.0789897
_IstaXyear_52 |  -.0939309   .0096566    -9.73   0.000    -.1128888   -.0749729
_IstaXyear_54 |  -.0796572   .0103697    -7.68   0.000     -.100015   -.0592994
_IstaXyear_55 |  -.0672679   .0105383    -6.38   0.000    -.0879567    -.046579
_IstaXyear_56 |  -.0099554   .0097213    -1.02   0.306    -.0290404    .0091295
_IstaXyear_57 |  -.0012724   .0092504    -0.14   0.891    -.0194328     .016888
_IstaXyear_58 |  -.0514796   .0092972    -5.54   0.000    -.0697318   -.0332273
_IstaXyear_59 |  -.0310693   .0103735    -3.00   0.003    -.0514346   -.0107039
_IstaXyear_61 |  -.0404103   .0101995    -3.96   0.000     -.060434   -.0203866
_IstaXyear_62 |  -.0182214   .0113764    -1.60   0.110    -.0405556    .0041129
_IstaXyear_63 |  -.0054994   .0119773    -0.46   0.646    -.0290133    .0180145
_IstaXyear_64 |   .0876899   .0163389     5.37   0.000     .0556133    .1197665
_IstaXyear_71 |   .0343497   .0132692     2.59   0.010     .0082996    .0603999
_IstaXyear_72 |  -.0822234   .0100972    -8.14   0.000    -.1020462   -.0624006
_IstaXyear_73 |  -.0551852   .0111107    -4.97   0.000    -.0769977   -.0333727
_IstaXyear_74 |  -.0547346   .0117161    -4.67   0.000    -.0777356   -.0317335
_IstaXyear_81 |   .0440522   .0135285     3.26   0.001      .017493    .0706114
_IstaXyear_82 |   -.009325   .0113939    -0.82   0.413    -.0316936    .0130437
_IstaXyear_83 |   -.024653   .0167958    -1.47   0.143    -.0576267    .0083206
_IstaXyear_84 |  -.0954928   .0097869    -9.76   0.000    -.1147065    -.076279
_IstaXyear_85 |  -.0262562   .0091504    -2.87   0.004    -.0442202   -.0082921
_IstaXyear_86 |   -.076577   .0111457    -6.87   0.000    -.0984582   -.0546957
_IstaXyear_87 |   .0077712   .0136503     0.57   0.569    -.0190272    .0345695
_IstaXyear_88 |    -.06463   .0117603    -5.50   0.000    -.0877179    -.041542
_IstaXyear_91 |  -.0704529   .0093461    -7.54   0.000    -.0888012   -.0521045
_IstaXyear_92 |  -.0326463   .0087623    -3.73   0.000    -.0498485   -.0154442
_IstaXyear_93 |  -.0993569   .0082086   -12.10   0.000    -.1154722   -.0832416
_IstaXyear_94 |  -.0497143   .0122473    -4.06   0.000    -.0737582   -.0256704
_IstaXyear_95 |  -.1042808    .011792    -8.84   0.000    -.1274308   -.0811307
        _cons |  -13.32548   3.559779    -3.74   0.000    -20.31406   -6.336901
-------------------------------------------------------------------------------

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  , cluster(state) /*OLS + State Cluster*/

Linear regression                               Number of obs     =        850
                                                F(16, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

                                  (Std. Err. adjusted for 50 clusters in state)
-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0583994     2.49   0.016     .0277837    .2624997
        lnemp |   1.499868   .4271839     3.51   0.001     .6414103    2.358326
              |
         year |
          80  |   .0228275   .0318813     0.72   0.477    -.0412404    .0868954
          81  |   .0501135   .0498013     1.01   0.319    -.0499659    .1501929
          82  |   .0943474   .0560909     1.68   0.099    -.0183715    .2070663
          83  |   .1425118   .0460038     3.10   0.003     .0500638    .2349599
          84  |    .498567   .0492231    10.13   0.000     .3996495    .5974845
          85  |   .7175139    .060448    11.87   0.000      .596039    .8389889
          86  |   .8454916   .0651168    12.98   0.000     .7146346    .9763487
          87  |   .9771231   .0753424    12.97   0.000     .8257169    1.128529
          88  |   1.301494   .0700871    18.57   0.000     1.160648    1.442339
          89  |   1.409538   .0782071    18.02   0.000     1.252375    1.566701
          90  |    1.47865   .0853992    17.31   0.000     1.307034    1.650266
          91  |   1.570146     .08527    18.41   0.000      1.39879    1.741502
          92  |   1.747922   .0898576    19.45   0.000     1.567347    1.928498
          93  |   2.037697   .0979778    20.80   0.000     1.840803     2.23459
          94  |   2.193295   .1143771    19.18   0.000     1.963445    2.423144
          95  |   2.312267   .1266629    18.26   0.000     2.057729    2.566806
              |
        state |
          12  |   4.161048   .4647597     8.95   0.000     3.227078    5.095017
          13  |  -2.989472   .4977384    -6.01   0.000    -3.989715   -1.989229
          14  |    9.11025    1.41176     6.45   0.000     6.273212    11.94729
          15  |    5.00001    .416609    12.00   0.000     4.162802    5.837217
          16  |   10.60946   1.136461     9.34   0.000     8.325655    12.89326
          21  |   9.848309   1.738079     5.67   0.000     6.355508    13.34111
          22  |   9.587233   1.304661     7.35   0.000     6.965417    12.20905
          23  |   6.610883   1.417544     4.66   0.000     3.762221    9.459545
          31  |   3.834553   1.299659     2.95   0.005      1.22279    6.446317
          32  |   3.723175   .9322915     3.99   0.000     1.849665    5.596685
          33  |   3.855385   1.304079     2.96   0.005      1.23474    6.476029
          34  |   3.898319   1.054135     3.70   0.001     1.779954    6.016683
          35  |    7.70993   .8332104     9.25   0.000     6.035531    9.384329
          41  |    9.25227   .6997398    13.22   0.000      7.84609    10.65845
          42  |   5.727127   .8074531     7.09   0.000     4.104489    7.349765
          43  |   6.353889    .709584     8.95   0.000     4.927927    7.779852
          44  |    1.83218   .3932353     4.66   0.000     1.041944    2.622416
          45  |   3.992405   .4942637     8.08   0.000     2.999145    4.985665
          46  |   4.272376   .4250511    10.05   0.000     3.418204    5.126548
          47  |   .4720782   .6460612     0.73   0.468    -.8262304    1.770387
          51  |   10.16903   .4052272    25.09   0.000       9.3547    10.98337
          52  |   8.228764   .8355439     9.85   0.000     6.549676    9.907853
          54  |   6.705244   .6395896    10.48   0.000     5.419941    7.990548
          55  |   5.491493    .901498     6.09   0.000     3.679865    7.303121
          56  |   .6147688    .517063     1.19   0.240    -.4243083    1.653846
          57  |   .1733435    .604218     0.29   0.775    -1.040878    1.387565
          58  |   4.597464   .3511137    13.09   0.000     3.891874    5.303053
          59  |   2.910721   .3745213     7.77   0.000     2.158092    3.663349
          61  |   3.429778   .5337292     6.43   0.000      2.35721    4.502347
          62  |   1.529689   .4964817     3.08   0.003     .5319718    2.527406
          63  |   .1110399    .722517     0.15   0.878    -1.340912    1.562992
          64  |  -8.360757   .3425248   -24.41   0.000    -9.049086   -7.672428
          71  |   -2.84782   .4006998    -7.11   0.000    -3.653057   -2.042584
          72  |   7.545168   1.054001     7.16   0.000     5.427074    9.663261
          73  |   5.065417   .8452861     5.99   0.000     3.366751    6.764083
          74  |   4.444996   1.314643     3.38   0.001     1.803122    7.086869
          81  |  -4.667171   .4807288    -9.71   0.000    -5.633232    -3.70111
          82  |   .6493388   .3036154     2.14   0.037     .0392008    1.259477
          83  |   1.764114   .6144766     2.87   0.006     .5292773    2.998951
          84  |   8.679613   .5472741    15.86   0.000     7.579824    9.779401
          85  |   2.398924   .1461975    16.41   0.000      2.10513    2.692719
          86  |   7.228274   .3636178    19.88   0.000     6.497557    7.958991
          87  |  -.2487644   .4919375    -0.51   0.615     -1.23735     .739821
          88  |   5.872883   .9510628     6.18   0.000     3.961651    7.784116
          91  |   5.839442   .2104484    27.75   0.000      5.41653    6.262354
          92  |   3.007486    .244874    12.28   0.000     2.515393    3.499578
          93  |    8.27507   1.377914     6.01   0.000     5.506047    11.04409
          94  |   4.072716   .5625016     7.24   0.000     2.942327    5.203106
          95  |   9.403113   .4564124    20.60   0.000     8.485918    10.32031
              |
_IstaXyear_12 |    -.04131   .0049986    -8.26   0.000    -.0513551   -.0312649
_IstaXyear_13 |   .0317075   .0045957     6.90   0.000      .022472     .040943
_IstaXyear_14 |  -.1027491   .0081759   -12.57   0.000    -.1191792   -.0863191
_IstaXyear_15 |  -.0450472   .0051637    -8.72   0.000     -.055424   -.0346704
_IstaXyear_16 |  -.1178754   .0078515   -15.01   0.000    -.1336535   -.1020973
_IstaXyear_21 |  -.1178324   .0067422   -17.48   0.000    -.1313813   -.1042834
_IstaXyear_22 |  -.1118645   .0064469   -17.35   0.000    -.1248201    -.098909
_IstaXyear_23 |  -.0809985    .004695   -17.25   0.000    -.0904335   -.0715636
_IstaXyear_31 |  -.0476254   .0045549   -10.46   0.000    -.0567789   -.0384719
_IstaXyear_32 |  -.0452292    .005205    -8.69   0.000     -.055689   -.0347694
_IstaXyear_33 |  -.0476682   .0034772   -13.71   0.000     -.054656   -.0406805
_IstaXyear_34 |  -.0465305    .002303   -20.20   0.000    -.0511585   -.0419024
_IstaXyear_35 |  -.0882184   .0046681   -18.90   0.000    -.0975994   -.0788375
_IstaXyear_41 |  -.1031885    .003611   -28.58   0.000     -.110445    -.095932
_IstaXyear_42 |  -.0694882   .0059369   -11.70   0.000     -.081419   -.0575575
_IstaXyear_43 |  -.0738372   .0013738   -53.75   0.000     -.076598   -.0710764
_IstaXyear_44 |  -.0324975    .005867    -5.54   0.000    -.0442878   -.0207072
_IstaXyear_45 |  -.0499423    .003894   -12.83   0.000    -.0577676   -.0421169
_IstaXyear_46 |  -.0454383   .0038444   -11.82   0.000     -.053164   -.0377126
_IstaXyear_47 |  -.0078129   .0047253    -1.65   0.105    -.0173088    .0016829
_IstaXyear_51 |  -.1008186   .0026013   -38.76   0.000     -.106046   -.0955911
_IstaXyear_52 |  -.0939309   .0047831   -19.64   0.000    -.1035429   -.0843189
_IstaXyear_54 |  -.0796572   .0041069   -19.40   0.000    -.0879103   -.0714041
_IstaXyear_55 |  -.0672679   .0090454    -7.44   0.000    -.0854453   -.0490904
_IstaXyear_56 |  -.0099554   .0029376    -3.39   0.001    -.0158588   -.0040521
_IstaXyear_57 |  -.0012724   .0050557    -0.25   0.802    -.0114322    .0088874
_IstaXyear_58 |  -.0514796   .0046174   -11.15   0.000    -.0607586   -.0422006
_IstaXyear_59 |  -.0310693   .0070556    -4.40   0.000    -.0452481   -.0168905
_IstaXyear_61 |  -.0404103   .0036192   -11.17   0.000    -.0476833   -.0331373
_IstaXyear_62 |  -.0182214   .0027364    -6.66   0.000    -.0237203   -.0127224
_IstaXyear_63 |  -.0054994   .0050414    -1.09   0.281    -.0156305    .0046316
_IstaXyear_64 |   .0876899   .0006739   130.11   0.000     .0863356    .0890442
_IstaXyear_71 |   .0343497   .0043848     7.83   0.000     .0255381    .0431614
_IstaXyear_72 |  -.0822234   .0060358   -13.62   0.000    -.0943528   -.0700939
_IstaXyear_73 |  -.0551852   .0052766   -10.46   0.000    -.0657889   -.0445814
_IstaXyear_74 |  -.0547346    .004764   -11.49   0.000    -.0643081    -.045161
_IstaXyear_81 |   .0440522   .0063244     6.97   0.000     .0313428    .0567617
_IstaXyear_82 |   -.009325   .0021347    -4.37   0.000    -.0136149   -.0050351
_IstaXyear_83 |   -.024653   .0103674    -2.38   0.021     -.045487    -.003819
_IstaXyear_84 |  -.0954928   .0036364   -26.26   0.000    -.1028004   -.0881851
_IstaXyear_85 |  -.0262562   .0021443   -12.24   0.000    -.0305653    -.021947
_IstaXyear_86 |   -.076577    .007714    -9.93   0.000    -.0920789    -.061075
_IstaXyear_87 |   .0077712   .0063311     1.23   0.226    -.0049516     .020494
_IstaXyear_88 |    -.06463   .0112713    -5.73   0.000    -.0872805   -.0419794
_IstaXyear_91 |  -.0704529   .0043004   -16.38   0.000    -.0790949   -.0618109
_IstaXyear_92 |  -.0326463   .0014192   -23.00   0.000    -.0354982   -.0297944
_IstaXyear_93 |  -.0993569   .0003808  -260.91   0.000    -.1001222   -.0985916
_IstaXyear_94 |  -.0497143   .0038949   -12.76   0.000    -.0575414   -.0418872
_IstaXyear_95 |  -.1042808   .0049639   -21.01   0.000    -.1142562   -.0943054
        _cons |  -13.32548   5.525634    -2.41   0.020    -24.42966   -2.221303
-------------------------------------------------------------------------------

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg lnths D lnemp i.year i.state  _IstaXyear*  /*OLS*/

      Source |       SS           df       MS      Number of obs   =       850
-------------+----------------------------------   F(116, 733)     =    542.38
       Model |  2453.11017       116  21.1475015   Prob > F        =    0.0000
    Residual |  28.5800091       733  .038990463   R-squared       =    0.9885
-------------+----------------------------------   Adj R-squared   =    0.9867
       Total |  2481.69018       849  2.92307442   Root MSE        =    .19746

-------------------------------------------------------------------------------
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417    .033961     4.27   0.000     .0784692    .2118141
        lnemp |   1.499868   .2162408     6.94   0.000     1.075343    1.924394
              |
         year |
          80  |   .0228275   .0406728     0.56   0.575    -.0570217    .1026767
          81  |   .0501135   .0440825     1.14   0.256    -.0364295    .1366565
          82  |   .0943474   .0490485     1.92   0.055    -.0019448    .1906396
          83  |   .1425118   .0554341     2.57   0.010     .0336833    .2513404
          84  |    .498567   .0635292     7.85   0.000     .3738462    .6232879
          85  |   .7175139    .072529     9.89   0.000     .5751247    .8599032
          86  |   .8454916   .0813005    10.40   0.000     .6858821    1.005101
          87  |   .9771231   .0910154    10.74   0.000     .7984411    1.155805
          88  |   1.301494    .101362    12.84   0.000     1.102499    1.500488
          89  |   1.409538    .111538    12.64   0.000     1.190566     1.62851
          90  |    1.47865   .1212414    12.20   0.000     1.240628    1.716672
          91  |   1.570146   .1293665    12.14   0.000     1.316173    1.824119
          92  |   1.747922   .1389311    12.58   0.000     1.475172    2.020673
          93  |   2.037697   .1493741    13.64   0.000     1.744445    2.330949
          94  |   2.193295    .160511    13.66   0.000     1.878179    2.508411
          95  |   2.312267   .1713015    13.50   0.000     1.975967    2.648567
              |
        state |
          12  |   4.161048    1.23827     3.36   0.001      1.73007    6.592026
          13  |  -2.989472   1.246612    -2.40   0.017    -5.436827   -.5421174
          14  |    9.11025   1.376268     6.62   0.000     6.408353    11.81215
          15  |    5.00001   1.221696     4.09   0.000     2.601569     7.39845
          16  |   10.60946    1.31773     8.05   0.000     8.022485    13.19643
          21  |   9.848309   1.471267     6.69   0.000     6.959909    12.73671
          22  |   9.587233   1.352823     7.09   0.000     6.931363     12.2431
          23  |   6.610883   1.397944     4.73   0.000     3.866432    9.355334
          31  |   3.834553   1.356969     2.83   0.005     1.170544    6.498563
          32  |   3.723175   1.281958     2.90   0.004     1.206428    6.239922
          33  |   3.855385   1.373686     2.81   0.005     1.158556    6.552213
          34  |   3.898319   1.311929     2.97   0.003     1.322733    6.473904
          35  |    7.70993   1.266857     6.09   0.000     5.222829    10.19703
          41  |    9.25227   1.248656     7.41   0.000     6.800901    11.70364
          42  |   5.727127   1.264198     4.53   0.000     3.245246    8.209008
          43  |   6.353889   1.260443     5.04   0.000      3.87938    8.828398
          44  |    1.83218   1.225896     1.49   0.135    -.5745051    4.238866
          45  |   3.992405   1.243343     3.21   0.001     1.551467    6.433344
          46  |   4.272376   1.223684     3.49   0.001     1.870034    6.674719
          47  |   .4720782   1.243323     0.38   0.704    -1.968821    2.912977
          51  |   10.16903   1.223606     8.31   0.000     7.766844    12.57123
          52  |   8.228764   1.267183     6.49   0.000     5.741024     10.7165
          54  |   6.705244   1.241757     5.40   0.000     4.267419    9.143069
          55  |   5.491493   1.277077     4.30   0.000     2.984328    7.998658
          56  |   .6147688   1.231136     0.50   0.618    -1.802204    3.031741
          57  |   .1733435   1.242562     0.14   0.889    -2.266062    2.612749
          58  |   4.597464   1.216648     3.78   0.000     2.208934    6.985993
          59  |   2.910721   1.218351     2.39   0.017      .518848    5.302593
          61  |   3.429778   1.231484     2.79   0.005     1.012122    5.847435
          62  |   1.529689   1.227033     1.25   0.213    -.8792287    3.938607
          63  |   .1110399   1.253971     0.09   0.929    -2.350763    2.572843
          64  |  -8.360757   1.216051    -6.88   0.000    -10.74812   -5.973398
          71  |   -2.84782   1.225918    -2.32   0.020     -5.25455   -.4410907
          72  |   7.545168   1.314219     5.74   0.000     4.965085    10.12525
          73  |   5.065417    1.27841     3.96   0.000     2.555634    7.575199
          74  |   4.444996   1.355047     3.28   0.001      1.78476    7.105232
          81  |  -4.667171   1.235994    -3.78   0.000    -7.093681   -2.240661
          82  |   .6493388   1.214442     0.53   0.593     -1.73486    3.033538
          83  |   1.764114    1.24143     1.42   0.156    -.6730677    4.201296
          84  |   8.679613    1.23266     7.04   0.000     6.259647    11.09958
          85  |   2.398924   1.208146     1.99   0.047     .0270863    4.770763
          86  |   7.228274   1.227414     5.89   0.000     4.818607    9.637941
          87  |  -.2487644   1.245979    -0.20   0.842    -2.694877    2.197348
          88  |   5.872883   1.319585     4.45   0.000     3.282266      8.4635
          91  |   5.839442   1.209379     4.83   0.000     3.465184    8.213701
          92  |   3.007486   1.211038     2.48   0.013     .6299691    5.385002
          93  |    8.27507   1.392033     5.94   0.000     5.542223    11.00792
          94  |   4.072716   1.252498     3.25   0.001     1.613805    6.531628
          95  |   9.403113   1.239463     7.59   0.000     6.969792    11.83643
              |
_IstaXyear_12 |    -.04131   .0141624    -2.92   0.004    -.0691137   -.0135063
_IstaXyear_13 |   .0317075   .0141038     2.25   0.025     .0040188    .0593962
_IstaXyear_14 |  -.1027491    .014368    -7.15   0.000    -.1309565   -.0745418
_IstaXyear_15 |  -.0450472   .0140699    -3.20   0.001    -.0726693   -.0174251
_IstaXyear_16 |  -.1178754   .0143208    -8.23   0.000    -.1459901   -.0897608
_IstaXyear_21 |  -.1178324    .014182    -8.31   0.000    -.1456745   -.0899902
_IstaXyear_22 |  -.1118645   .0141856    -7.89   0.000    -.1397138   -.0840153
_IstaXyear_23 |  -.0809985   .0140278    -5.77   0.000    -.1085379   -.0534592
_IstaXyear_31 |  -.0476254   .0139982    -3.40   0.001    -.0751067    -.020144
_IstaXyear_32 |  -.0452292   .0141455    -3.20   0.001    -.0729997   -.0174587
_IstaXyear_33 |  -.0476682   .0139366    -3.42   0.001    -.0750286   -.0203079
_IstaXyear_34 |  -.0465305   .0138672    -3.36   0.001    -.0737547   -.0193062
_IstaXyear_35 |  -.0882184   .0140968    -6.26   0.000    -.1158933   -.0605435
_IstaXyear_41 |  -.1031885   .0140015    -7.37   0.000    -.1306763   -.0757008
_IstaXyear_42 |  -.0694882    .014172    -4.90   0.000    -.0973107   -.0416658
_IstaXyear_43 |  -.0738372   .0138535    -5.33   0.000    -.1010345     -.04664
_IstaXyear_44 |  -.0324975   .0141241    -2.30   0.022    -.0602261   -.0047689
_IstaXyear_45 |  -.0499423   .0140521    -3.55   0.000    -.0775295   -.0223551
_IstaXyear_46 |  -.0454383   .0139936    -3.25   0.001    -.0729106   -.0179659
_IstaXyear_47 |  -.0078129   .0140572    -0.56   0.579    -.0354101    .0197843
_IstaXyear_51 |  -.1008186   .0138875    -7.26   0.000    -.1280826   -.0735545
_IstaXyear_52 |  -.0939309   .0140948    -6.66   0.000    -.1216018   -.0662599
_IstaXyear_54 |  -.0796572   .0140774    -5.66   0.000    -.1072941   -.0520203
_IstaXyear_55 |  -.0672679   .0144699    -4.65   0.000    -.0956753   -.0388604
_IstaXyear_56 |  -.0099554   .0139047    -0.72   0.474    -.0372533    .0173424
_IstaXyear_57 |  -.0012724   .0141918    -0.09   0.929    -.0291338    .0265891
_IstaXyear_58 |  -.0514796   .0140212    -3.67   0.000     -.079006   -.0239532
_IstaXyear_59 |  -.0310693   .0142789    -2.18   0.030    -.0591016   -.0030369
_IstaXyear_61 |  -.0404103   .0140098    -2.88   0.004    -.0679144   -.0129062
_IstaXyear_62 |  -.0182214   .0139341    -1.31   0.191    -.0455769    .0091342
_IstaXyear_63 |  -.0054994   .0141517    -0.39   0.698    -.0332821    .0222832
_IstaXyear_64 |   .0876899   .0138292     6.34   0.000     .0605404    .1148394
_IstaXyear_71 |   .0343497   .0141108     2.43   0.015     .0066474     .062052
_IstaXyear_72 |  -.0822234   .0141586    -5.81   0.000    -.1100195   -.0544272
_IstaXyear_73 |  -.0551852   .0140806    -3.92   0.000    -.0828283    -.027542
_IstaXyear_74 |  -.0547346   .0140948    -3.88   0.000    -.0824056   -.0270635
_IstaXyear_81 |   .0440522   .0141968     3.10   0.002     .0161811    .0719234
_IstaXyear_82 |   -.009325   .0138671    -0.67   0.502     -.036549     .017899
_IstaXyear_83 |   -.024653   .0146553    -1.68   0.093    -.0534243    .0041183
_IstaXyear_84 |  -.0954928   .0140144    -6.81   0.000    -.1230059   -.0679797
_IstaXyear_85 |  -.0262562   .0138844    -1.89   0.059     -.053514    .0010017
_IstaXyear_86 |   -.076577   .0145529    -5.26   0.000    -.1051474   -.0480066
_IstaXyear_87 |   .0077712   .0144011     0.54   0.590    -.0205012    .0360435
_IstaXyear_88 |    -.06463   .0152062    -4.25   0.000    -.0944829    -.034777
_IstaXyear_91 |  -.0704529   .0139953    -5.03   0.000    -.0979285   -.0429772
_IstaXyear_92 |  -.0326463   .0138436    -2.36   0.019    -.0598242   -.0054684
_IstaXyear_93 |  -.0993569   .0138263    -7.19   0.000    -.1265008    -.072213
_IstaXyear_94 |  -.0497143   .0140522    -3.54   0.000    -.0773017   -.0221269
_IstaXyear_95 |  -.1042808   .0141835    -7.35   0.000    -.1321258   -.0764357
        _cons |  -13.32548   2.805782    -4.75   0.000    -18.83381   -7.817154
-------------------------------------------------------------------------------

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
. /*Cluster robust standard errors allowing for heteroskedasicity as well
> as autocorrelation between observation within states*/
. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  , r /*OLS + robust se*/

Linear regression                               Number of obs     =        850
                                                F(116, 733)       =    1267.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0343738     4.22   0.000     .0776589    .2126244
        lnemp |   1.499868   .2744967     5.46   0.000     .9609748    2.038762
              |
         year |
          80  |   .0228275   .0457262     0.50   0.618    -.0669424    .1125974
          81  |   .0501135   .0459611     1.09   0.276    -.0401175    .1403445
          82  |   .0943474   .0500853     1.88   0.060    -.0039803    .1926751
          83  |   .1425118   .0464957     3.07   0.002     .0512312    .2337925
          84  |    .498567   .0537563     9.27   0.000     .3930323    .6041017
          85  |   .7175139    .064882    11.06   0.000     .5901372    .8448907
          86  |   .8454916   .0741009    11.41   0.000     .7000163    .9909669
          87  |   .9771231   .0837868    11.66   0.000     .8126323    1.141614
          88  |   1.301494    .084743    15.36   0.000     1.135126    1.467861
          89  |   1.409538   .0940368    14.99   0.000     1.224924    1.594151
          90  |    1.47865   .1021715    14.47   0.000     1.278067    1.679234
          91  |   1.570146   .1082885    14.50   0.000     1.357553    1.782738
          92  |   1.747922   .1133281    15.42   0.000     1.525436    1.970409
          93  |   2.037697   .1221159    16.69   0.000     1.797958    2.277435
          94  |   2.193295   .1324259    16.56   0.000     1.933315    2.453274
          95  |   2.312267   .1417715    16.31   0.000     2.033941    2.590594
              |
        state |
          12  |   4.161048    1.84052     2.26   0.024     .5477283    7.774367
          13  |  -2.989472   2.028842    -1.47   0.141    -6.972507    .9935623
          14  |    9.11025    1.14942     7.93   0.000     6.853703     11.3668
          15  |    5.00001   1.159479     4.31   0.000     2.723713    7.276306
          16  |   10.60946   1.099627     9.65   0.000     8.450665    12.76825
          21  |   9.848309   1.291515     7.63   0.000     7.312799    12.38382
          22  |   9.587233   1.193792     8.03   0.000     7.243573    11.93089
          23  |   6.610883   1.121555     5.89   0.000      4.40904    8.812726
          31  |   3.834553   1.075218     3.57   0.000     1.723679    5.945427
          32  |   3.723175   1.008239     3.69   0.000     1.743794    5.702555
          33  |   3.855385    1.13311     3.40   0.001     1.630858    6.079912
          34  |   3.898319    1.27107     3.07   0.002     1.402947    6.393691
          35  |    7.70993    .898434     8.58   0.000     5.946119    9.473741
          41  |    9.25227   1.209408     7.65   0.000     6.877954    11.62659
          42  |   5.727127   1.156614     4.95   0.000     3.456456    7.997797
          43  |   6.353889   .9156868     6.94   0.000     4.556208    8.151571
          44  |    1.83218   2.247035     0.82   0.415    -2.579211    6.243571
          45  |   3.992405   1.879351     2.12   0.034     .3028526    7.681958
          46  |   4.272376   .9529567     4.48   0.000     2.401526    6.143226
          47  |   .4720782   .8938149     0.53   0.598    -1.282664    2.226821
          51  |   10.16903   1.014345    10.03   0.000     8.177667     12.1604
          52  |   8.228764   .9534479     8.63   0.000      6.35695    10.10058
          54  |   6.705244   .9691691     6.92   0.000     4.802566    8.607923
          55  |   5.491493    .976355     5.62   0.000     3.574707    7.408278
          56  |   .6147688   .9053289     0.68   0.497    -1.162578    2.392116
          57  |   .1733435   .8362726     0.21   0.836    -1.468432    1.815119
          58  |   4.597464   .8161614     5.63   0.000     2.995171    6.199756
          59  |   2.910721   .8587114     3.39   0.001     1.224894    4.596548
          61  |   3.429778   .9351579     3.67   0.000     1.593871    5.265686
          62  |   1.529689   1.041769     1.47   0.142    -.5155183    3.574896
          63  |   .1110399   1.114614     0.10   0.921    -2.077176    2.299256
          64  |  -8.360757    1.42726    -5.86   0.000    -11.16276   -5.558752
          71  |   -2.84782   1.156303    -2.46   0.014     -5.11788   -.5777605
          72  |   7.545168    1.06944     7.06   0.000     5.445636    9.644699
          73  |   5.065417   1.083656     4.67   0.000     2.937978    7.192856
          74  |   4.444996   1.277701     3.48   0.001     1.936606    6.953385
          81  |  -4.667171   1.188281    -3.93   0.000     -7.00001   -2.334332
          82  |   .6493388   1.007269     0.64   0.519    -1.328137    2.626814
          83  |   1.764114   1.545995     1.14   0.254    -1.270992    4.799221
          84  |   8.679613   .8978519     9.67   0.000     6.916945    10.44228
          85  |   2.398924   .8130916     2.95   0.003     .8026583     3.99519
          86  |   7.228274   .9034971     8.00   0.000     5.454524    9.002025
          87  |  -.2487644   1.173761    -0.21   0.832    -2.553099     2.05557
          88  |   5.872883   1.025537     5.73   0.000     3.859543    7.886224
          91  |   5.839442   .8143364     7.17   0.000     4.240732    7.438152
          92  |   3.007486   .8020193     3.75   0.000     1.432957    4.582014
          93  |    8.27507   1.134572     7.29   0.000     6.047673    10.50247
          94  |   4.072716   1.111653     3.66   0.000     1.890314    6.255119
          95  |   9.403113   1.043833     9.01   0.000     7.353855    11.45237
              |
_IstaXyear_12 |    -.04131   .0211214    -1.96   0.051    -.0827757    .0001556
_IstaXyear_13 |   .0317075   .0226103     1.40   0.161    -.0126811    .0760961
_IstaXyear_14 |  -.1027491   .0097698   -10.52   0.000    -.1219292   -.0835691
_IstaXyear_15 |  -.0450472   .0134773    -3.34   0.001    -.0715058   -.0185886
_IstaXyear_16 |  -.1178754   .0107679   -10.95   0.000    -.1390151   -.0967357
_IstaXyear_21 |  -.1178324    .008974   -13.13   0.000    -.1354503   -.1002145
_IstaXyear_22 |  -.1118645   .0107739   -10.38   0.000    -.1330158   -.0907132
_IstaXyear_23 |  -.0809985   .0080791   -10.03   0.000    -.0968596   -.0651375
_IstaXyear_31 |  -.0476254    .008447    -5.64   0.000    -.0642085   -.0310422
_IstaXyear_32 |  -.0452292   .0099742    -4.53   0.000    -.0648105   -.0256479
_IstaXyear_33 |  -.0476682    .008969    -5.31   0.000    -.0652762   -.0300602
_IstaXyear_34 |  -.0465305   .0120168    -3.87   0.000    -.0701218   -.0229391
_IstaXyear_35 |  -.0882184   .0089432    -9.86   0.000    -.1057759    -.070661
_IstaXyear_41 |  -.1031885   .0128823    -8.01   0.000    -.1284791    -.077898
_IstaXyear_42 |  -.0694882   .0126827    -5.48   0.000    -.0943871   -.0445894
_IstaXyear_43 |  -.0738372   .0088361    -8.36   0.000    -.0911844   -.0564901
_IstaXyear_44 |  -.0324975   .0249469    -1.30   0.193    -.0814734    .0164784
_IstaXyear_45 |  -.0499423   .0208388    -2.40   0.017    -.0908531   -.0090314
_IstaXyear_46 |  -.0454383   .0104174    -4.36   0.000    -.0658898   -.0249868
_IstaXyear_47 |  -.0078129   .0095131    -0.82   0.412    -.0264892    .0108633
_IstaXyear_51 |  -.1008186    .011119    -9.07   0.000    -.1226474   -.0789897
_IstaXyear_52 |  -.0939309   .0096566    -9.73   0.000    -.1128888   -.0749729
_IstaXyear_54 |  -.0796572   .0103697    -7.68   0.000     -.100015   -.0592994
_IstaXyear_55 |  -.0672679   .0105383    -6.38   0.000    -.0879567    -.046579
_IstaXyear_56 |  -.0099554   .0097213    -1.02   0.306    -.0290404    .0091295
_IstaXyear_57 |  -.0012724   .0092504    -0.14   0.891    -.0194328     .016888
_IstaXyear_58 |  -.0514796   .0092972    -5.54   0.000    -.0697318   -.0332273
_IstaXyear_59 |  -.0310693   .0103735    -3.00   0.003    -.0514346   -.0107039
_IstaXyear_61 |  -.0404103   .0101995    -3.96   0.000     -.060434   -.0203866
_IstaXyear_62 |  -.0182214   .0113764    -1.60   0.110    -.0405556    .0041129
_IstaXyear_63 |  -.0054994   .0119773    -0.46   0.646    -.0290133    .0180145
_IstaXyear_64 |   .0876899   .0163389     5.37   0.000     .0556133    .1197665
_IstaXyear_71 |   .0343497   .0132692     2.59   0.010     .0082996    .0603999
_IstaXyear_72 |  -.0822234   .0100972    -8.14   0.000    -.1020462   -.0624006
_IstaXyear_73 |  -.0551852   .0111107    -4.97   0.000    -.0769977   -.0333727
_IstaXyear_74 |  -.0547346   .0117161    -4.67   0.000    -.0777356   -.0317335
_IstaXyear_81 |   .0440522   .0135285     3.26   0.001      .017493    .0706114
_IstaXyear_82 |   -.009325   .0113939    -0.82   0.413    -.0316936    .0130437
_IstaXyear_83 |   -.024653   .0167958    -1.47   0.143    -.0576267    .0083206
_IstaXyear_84 |  -.0954928   .0097869    -9.76   0.000    -.1147065    -.076279
_IstaXyear_85 |  -.0262562   .0091504    -2.87   0.004    -.0442202   -.0082921
_IstaXyear_86 |   -.076577   .0111457    -6.87   0.000    -.0984582   -.0546957
_IstaXyear_87 |   .0077712   .0136503     0.57   0.569    -.0190272    .0345695
_IstaXyear_88 |    -.06463   .0117603    -5.50   0.000    -.0877179    -.041542
_IstaXyear_91 |  -.0704529   .0093461    -7.54   0.000    -.0888012   -.0521045
_IstaXyear_92 |  -.0326463   .0087623    -3.73   0.000    -.0498485   -.0154442
_IstaXyear_93 |  -.0993569   .0082086   -12.10   0.000    -.1154722   -.0832416
_IstaXyear_94 |  -.0497143   .0122473    -4.06   0.000    -.0737582   -.0256704
_IstaXyear_95 |  -.1042808    .011792    -8.84   0.000    -.1274308   -.0811307
        _cons |  -13.32548   3.559779    -3.74   0.000    -20.31406   -6.336901
-------------------------------------------------------------------------------

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  , cluster(state) /*OLS + State Cluster*/

Linear regression                               Number of obs     =        850
                                                F(16, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

                                  (Std. Err. adjusted for 50 clusters in state)
-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0583994     2.49   0.016     .0277837    .2624997
        lnemp |   1.499868   .4271839     3.51   0.001     .6414103    2.358326
              |
         year |
          80  |   .0228275   .0318813     0.72   0.477    -.0412404    .0868954
          81  |   .0501135   .0498013     1.01   0.319    -.0499659    .1501929
          82  |   .0943474   .0560909     1.68   0.099    -.0183715    .2070663
          83  |   .1425118   .0460038     3.10   0.003     .0500638    .2349599
          84  |    .498567   .0492231    10.13   0.000     .3996495    .5974845
          85  |   .7175139    .060448    11.87   0.000      .596039    .8389889
          86  |   .8454916   .0651168    12.98   0.000     .7146346    .9763487
          87  |   .9771231   .0753424    12.97   0.000     .8257169    1.128529
          88  |   1.301494   .0700871    18.57   0.000     1.160648    1.442339
          89  |   1.409538   .0782071    18.02   0.000     1.252375    1.566701
          90  |    1.47865   .0853992    17.31   0.000     1.307034    1.650266
          91  |   1.570146     .08527    18.41   0.000      1.39879    1.741502
          92  |   1.747922   .0898576    19.45   0.000     1.567347    1.928498
          93  |   2.037697   .0979778    20.80   0.000     1.840803     2.23459
          94  |   2.193295   .1143771    19.18   0.000     1.963445    2.423144
          95  |   2.312267   .1266629    18.26   0.000     2.057729    2.566806
              |
        state |
          12  |   4.161048   .4647597     8.95   0.000     3.227078    5.095017
          13  |  -2.989472   .4977384    -6.01   0.000    -3.989715   -1.989229
          14  |    9.11025    1.41176     6.45   0.000     6.273212    11.94729
          15  |    5.00001    .416609    12.00   0.000     4.162802    5.837217
          16  |   10.60946   1.136461     9.34   0.000     8.325655    12.89326
          21  |   9.848309   1.738079     5.67   0.000     6.355508    13.34111
          22  |   9.587233   1.304661     7.35   0.000     6.965417    12.20905
          23  |   6.610883   1.417544     4.66   0.000     3.762221    9.459545
          31  |   3.834553   1.299659     2.95   0.005      1.22279    6.446317
          32  |   3.723175   .9322915     3.99   0.000     1.849665    5.596685
          33  |   3.855385   1.304079     2.96   0.005      1.23474    6.476029
          34  |   3.898319   1.054135     3.70   0.001     1.779954    6.016683
          35  |    7.70993   .8332104     9.25   0.000     6.035531    9.384329
          41  |    9.25227   .6997398    13.22   0.000      7.84609    10.65845
          42  |   5.727127   .8074531     7.09   0.000     4.104489    7.349765
          43  |   6.353889    .709584     8.95   0.000     4.927927    7.779852
          44  |    1.83218   .3932353     4.66   0.000     1.041944    2.622416
          45  |   3.992405   .4942637     8.08   0.000     2.999145    4.985665
          46  |   4.272376   .4250511    10.05   0.000     3.418204    5.126548
          47  |   .4720782   .6460612     0.73   0.468    -.8262304    1.770387
          51  |   10.16903   .4052272    25.09   0.000       9.3547    10.98337
          52  |   8.228764   .8355439     9.85   0.000     6.549676    9.907853
          54  |   6.705244   .6395896    10.48   0.000     5.419941    7.990548
          55  |   5.491493    .901498     6.09   0.000     3.679865    7.303121
          56  |   .6147688    .517063     1.19   0.240    -.4243083    1.653846
          57  |   .1733435    .604218     0.29   0.775    -1.040878    1.387565
          58  |   4.597464   .3511137    13.09   0.000     3.891874    5.303053
          59  |   2.910721   .3745213     7.77   0.000     2.158092    3.663349
          61  |   3.429778   .5337292     6.43   0.000      2.35721    4.502347
          62  |   1.529689   .4964817     3.08   0.003     .5319718    2.527406
          63  |   .1110399    .722517     0.15   0.878    -1.340912    1.562992
          64  |  -8.360757   .3425248   -24.41   0.000    -9.049086   -7.672428
          71  |   -2.84782   .4006998    -7.11   0.000    -3.653057   -2.042584
          72  |   7.545168   1.054001     7.16   0.000     5.427074    9.663261
          73  |   5.065417   .8452861     5.99   0.000     3.366751    6.764083
          74  |   4.444996   1.314643     3.38   0.001     1.803122    7.086869
          81  |  -4.667171   .4807288    -9.71   0.000    -5.633232    -3.70111
          82  |   .6493388   .3036154     2.14   0.037     .0392008    1.259477
          83  |   1.764114   .6144766     2.87   0.006     .5292773    2.998951
          84  |   8.679613   .5472741    15.86   0.000     7.579824    9.779401
          85  |   2.398924   .1461975    16.41   0.000      2.10513    2.692719
          86  |   7.228274   .3636178    19.88   0.000     6.497557    7.958991
          87  |  -.2487644   .4919375    -0.51   0.615     -1.23735     .739821
          88  |   5.872883   .9510628     6.18   0.000     3.961651    7.784116
          91  |   5.839442   .2104484    27.75   0.000      5.41653    6.262354
          92  |   3.007486    .244874    12.28   0.000     2.515393    3.499578
          93  |    8.27507   1.377914     6.01   0.000     5.506047    11.04409
          94  |   4.072716   .5625016     7.24   0.000     2.942327    5.203106
          95  |   9.403113   .4564124    20.60   0.000     8.485918    10.32031
              |
_IstaXyear_12 |    -.04131   .0049986    -8.26   0.000    -.0513551   -.0312649
_IstaXyear_13 |   .0317075   .0045957     6.90   0.000      .022472     .040943
_IstaXyear_14 |  -.1027491   .0081759   -12.57   0.000    -.1191792   -.0863191
_IstaXyear_15 |  -.0450472   .0051637    -8.72   0.000     -.055424   -.0346704
_IstaXyear_16 |  -.1178754   .0078515   -15.01   0.000    -.1336535   -.1020973
_IstaXyear_21 |  -.1178324   .0067422   -17.48   0.000    -.1313813   -.1042834
_IstaXyear_22 |  -.1118645   .0064469   -17.35   0.000    -.1248201    -.098909
_IstaXyear_23 |  -.0809985    .004695   -17.25   0.000    -.0904335   -.0715636
_IstaXyear_31 |  -.0476254   .0045549   -10.46   0.000    -.0567789   -.0384719
_IstaXyear_32 |  -.0452292    .005205    -8.69   0.000     -.055689   -.0347694
_IstaXyear_33 |  -.0476682   .0034772   -13.71   0.000     -.054656   -.0406805
_IstaXyear_34 |  -.0465305    .002303   -20.20   0.000    -.0511585   -.0419024
_IstaXyear_35 |  -.0882184   .0046681   -18.90   0.000    -.0975994   -.0788375
_IstaXyear_41 |  -.1031885    .003611   -28.58   0.000     -.110445    -.095932
_IstaXyear_42 |  -.0694882   .0059369   -11.70   0.000     -.081419   -.0575575
_IstaXyear_43 |  -.0738372   .0013738   -53.75   0.000     -.076598   -.0710764
_IstaXyear_44 |  -.0324975    .005867    -5.54   0.000    -.0442878   -.0207072
_IstaXyear_45 |  -.0499423    .003894   -12.83   0.000    -.0577676   -.0421169
_IstaXyear_46 |  -.0454383   .0038444   -11.82   0.000     -.053164   -.0377126
_IstaXyear_47 |  -.0078129   .0047253    -1.65   0.105    -.0173088    .0016829
_IstaXyear_51 |  -.1008186   .0026013   -38.76   0.000     -.106046   -.0955911
_IstaXyear_52 |  -.0939309   .0047831   -19.64   0.000    -.1035429   -.0843189
_IstaXyear_54 |  -.0796572   .0041069   -19.40   0.000    -.0879103   -.0714041
_IstaXyear_55 |  -.0672679   .0090454    -7.44   0.000    -.0854453   -.0490904
_IstaXyear_56 |  -.0099554   .0029376    -3.39   0.001    -.0158588   -.0040521
_IstaXyear_57 |  -.0012724   .0050557    -0.25   0.802    -.0114322    .0088874
_IstaXyear_58 |  -.0514796   .0046174   -11.15   0.000    -.0607586   -.0422006
_IstaXyear_59 |  -.0310693   .0070556    -4.40   0.000    -.0452481   -.0168905
_IstaXyear_61 |  -.0404103   .0036192   -11.17   0.000    -.0476833   -.0331373
_IstaXyear_62 |  -.0182214   .0027364    -6.66   0.000    -.0237203   -.0127224
_IstaXyear_63 |  -.0054994   .0050414    -1.09   0.281    -.0156305    .0046316
_IstaXyear_64 |   .0876899   .0006739   130.11   0.000     .0863356    .0890442
_IstaXyear_71 |   .0343497   .0043848     7.83   0.000     .0255381    .0431614
_IstaXyear_72 |  -.0822234   .0060358   -13.62   0.000    -.0943528   -.0700939
_IstaXyear_73 |  -.0551852   .0052766   -10.46   0.000    -.0657889   -.0445814
_IstaXyear_74 |  -.0547346    .004764   -11.49   0.000    -.0643081    -.045161
_IstaXyear_81 |   .0440522   .0063244     6.97   0.000     .0313428    .0567617
_IstaXyear_82 |   -.009325   .0021347    -4.37   0.000    -.0136149   -.0050351
_IstaXyear_83 |   -.024653   .0103674    -2.38   0.021     -.045487    -.003819
_IstaXyear_84 |  -.0954928   .0036364   -26.26   0.000    -.1028004   -.0881851
_IstaXyear_85 |  -.0262562   .0021443   -12.24   0.000    -.0305653    -.021947
_IstaXyear_86 |   -.076577    .007714    -9.93   0.000    -.0920789    -.061075
_IstaXyear_87 |   .0077712   .0063311     1.23   0.226    -.0049516     .020494
_IstaXyear_88 |    -.06463   .0112713    -5.73   0.000    -.0872805   -.0419794
_IstaXyear_91 |  -.0704529   .0043004   -16.38   0.000    -.0790949   -.0618109
_IstaXyear_92 |  -.0326463   .0014192   -23.00   0.000    -.0354982   -.0297944
_IstaXyear_93 |  -.0993569   .0003808  -260.91   0.000    -.1001222   -.0985916
_IstaXyear_94 |  -.0497143   .0038949   -12.76   0.000    -.0575414   -.0418872
_IstaXyear_95 |  -.1042808   .0049639   -21.01   0.000    -.1142562   -.0943054
        _cons |  -13.32548   5.525634    -2.41   0.020    -24.42966   -2.221303
-------------------------------------------------------------------------------

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. /* Simple OLS standard errors assuming standard errors that are robust to 
> arbitrary form of heteroskedasticity */
. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  /*OLS*/

      Source |       SS           df       MS      Number of obs   =       850
-------------+----------------------------------   F(116, 733)     =    542.38
       Model |  2453.11017       116  21.1475015   Prob > F        =    0.0000
    Residual |  28.5800091       733  .038990463   R-squared       =    0.9885
-------------+----------------------------------   Adj R-squared   =    0.9867
       Total |  2481.69018       849  2.92307442   Root MSE        =    .19746

-------------------------------------------------------------------------------
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417    .033961     4.27   0.000     .0784692    .2118141
        lnemp |   1.499868   .2162408     6.94   0.000     1.075343    1.924394
              |
         year |
          80  |   .0228275   .0406728     0.56   0.575    -.0570217    .1026767
          81  |   .0501135   .0440825     1.14   0.256    -.0364295    .1366565
          82  |   .0943474   .0490485     1.92   0.055    -.0019448    .1906396
          83  |   .1425118   .0554341     2.57   0.010     .0336833    .2513404
          84  |    .498567   .0635292     7.85   0.000     .3738462    .6232879
          85  |   .7175139    .072529     9.89   0.000     .5751247    .8599032
          86  |   .8454916   .0813005    10.40   0.000     .6858821    1.005101
          87  |   .9771231   .0910154    10.74   0.000     .7984411    1.155805
          88  |   1.301494    .101362    12.84   0.000     1.102499    1.500488
          89  |   1.409538    .111538    12.64   0.000     1.190566     1.62851
          90  |    1.47865   .1212414    12.20   0.000     1.240628    1.716672
          91  |   1.570146   .1293665    12.14   0.000     1.316173    1.824119
          92  |   1.747922   .1389311    12.58   0.000     1.475172    2.020673
          93  |   2.037697   .1493741    13.64   0.000     1.744445    2.330949
          94  |   2.193295    .160511    13.66   0.000     1.878179    2.508411
          95  |   2.312267   .1713015    13.50   0.000     1.975967    2.648567
              |
        state |
          12  |   4.161048    1.23827     3.36   0.001      1.73007    6.592026
          13  |  -2.989472   1.246612    -2.40   0.017    -5.436827   -.5421174
          14  |    9.11025   1.376268     6.62   0.000     6.408353    11.81215
          15  |    5.00001   1.221696     4.09   0.000     2.601569     7.39845
          16  |   10.60946    1.31773     8.05   0.000     8.022485    13.19643
          21  |   9.848309   1.471267     6.69   0.000     6.959909    12.73671
          22  |   9.587233   1.352823     7.09   0.000     6.931363     12.2431
          23  |   6.610883   1.397944     4.73   0.000     3.866432    9.355334
          31  |   3.834553   1.356969     2.83   0.005     1.170544    6.498563
          32  |   3.723175   1.281958     2.90   0.004     1.206428    6.239922
          33  |   3.855385   1.373686     2.81   0.005     1.158556    6.552213
          34  |   3.898319   1.311929     2.97   0.003     1.322733    6.473904
          35  |    7.70993   1.266857     6.09   0.000     5.222829    10.19703
          41  |    9.25227   1.248656     7.41   0.000     6.800901    11.70364
          42  |   5.727127   1.264198     4.53   0.000     3.245246    8.209008
          43  |   6.353889   1.260443     5.04   0.000      3.87938    8.828398
          44  |    1.83218   1.225896     1.49   0.135    -.5745051    4.238866
          45  |   3.992405   1.243343     3.21   0.001     1.551467    6.433344
          46  |   4.272376   1.223684     3.49   0.001     1.870034    6.674719
          47  |   .4720782   1.243323     0.38   0.704    -1.968821    2.912977
          51  |   10.16903   1.223606     8.31   0.000     7.766844    12.57123
          52  |   8.228764   1.267183     6.49   0.000     5.741024     10.7165
          54  |   6.705244   1.241757     5.40   0.000     4.267419    9.143069
          55  |   5.491493   1.277077     4.30   0.000     2.984328    7.998658
          56  |   .6147688   1.231136     0.50   0.618    -1.802204    3.031741
          57  |   .1733435   1.242562     0.14   0.889    -2.266062    2.612749
          58  |   4.597464   1.216648     3.78   0.000     2.208934    6.985993
          59  |   2.910721   1.218351     2.39   0.017      .518848    5.302593
          61  |   3.429778   1.231484     2.79   0.005     1.012122    5.847435
          62  |   1.529689   1.227033     1.25   0.213    -.8792287    3.938607
          63  |   .1110399   1.253971     0.09   0.929    -2.350763    2.572843
          64  |  -8.360757   1.216051    -6.88   0.000    -10.74812   -5.973398
          71  |   -2.84782   1.225918    -2.32   0.020     -5.25455   -.4410907
          72  |   7.545168   1.314219     5.74   0.000     4.965085    10.12525
          73  |   5.065417    1.27841     3.96   0.000     2.555634    7.575199
          74  |   4.444996   1.355047     3.28   0.001      1.78476    7.105232
          81  |  -4.667171   1.235994    -3.78   0.000    -7.093681   -2.240661
          82  |   .6493388   1.214442     0.53   0.593     -1.73486    3.033538
          83  |   1.764114    1.24143     1.42   0.156    -.6730677    4.201296
          84  |   8.679613    1.23266     7.04   0.000     6.259647    11.09958
          85  |   2.398924   1.208146     1.99   0.047     .0270863    4.770763
          86  |   7.228274   1.227414     5.89   0.000     4.818607    9.637941
          87  |  -.2487644   1.245979    -0.20   0.842    -2.694877    2.197348
          88  |   5.872883   1.319585     4.45   0.000     3.282266      8.4635
          91  |   5.839442   1.209379     4.83   0.000     3.465184    8.213701
          92  |   3.007486   1.211038     2.48   0.013     .6299691    5.385002
          93  |    8.27507   1.392033     5.94   0.000     5.542223    11.00792
          94  |   4.072716   1.252498     3.25   0.001     1.613805    6.531628
          95  |   9.403113   1.239463     7.59   0.000     6.969792    11.83643
              |
_IstaXyear_12 |    -.04131   .0141624    -2.92   0.004    -.0691137   -.0135063
_IstaXyear_13 |   .0317075   .0141038     2.25   0.025     .0040188    .0593962
_IstaXyear_14 |  -.1027491    .014368    -7.15   0.000    -.1309565   -.0745418
_IstaXyear_15 |  -.0450472   .0140699    -3.20   0.001    -.0726693   -.0174251
_IstaXyear_16 |  -.1178754   .0143208    -8.23   0.000    -.1459901   -.0897608
_IstaXyear_21 |  -.1178324    .014182    -8.31   0.000    -.1456745   -.0899902
_IstaXyear_22 |  -.1118645   .0141856    -7.89   0.000    -.1397138   -.0840153
_IstaXyear_23 |  -.0809985   .0140278    -5.77   0.000    -.1085379   -.0534592
_IstaXyear_31 |  -.0476254   .0139982    -3.40   0.001    -.0751067    -.020144
_IstaXyear_32 |  -.0452292   .0141455    -3.20   0.001    -.0729997   -.0174587
_IstaXyear_33 |  -.0476682   .0139366    -3.42   0.001    -.0750286   -.0203079
_IstaXyear_34 |  -.0465305   .0138672    -3.36   0.001    -.0737547   -.0193062
_IstaXyear_35 |  -.0882184   .0140968    -6.26   0.000    -.1158933   -.0605435
_IstaXyear_41 |  -.1031885   .0140015    -7.37   0.000    -.1306763   -.0757008
_IstaXyear_42 |  -.0694882    .014172    -4.90   0.000    -.0973107   -.0416658
_IstaXyear_43 |  -.0738372   .0138535    -5.33   0.000    -.1010345     -.04664
_IstaXyear_44 |  -.0324975   .0141241    -2.30   0.022    -.0602261   -.0047689
_IstaXyear_45 |  -.0499423   .0140521    -3.55   0.000    -.0775295   -.0223551
_IstaXyear_46 |  -.0454383   .0139936    -3.25   0.001    -.0729106   -.0179659
_IstaXyear_47 |  -.0078129   .0140572    -0.56   0.579    -.0354101    .0197843
_IstaXyear_51 |  -.1008186   .0138875    -7.26   0.000    -.1280826   -.0735545
_IstaXyear_52 |  -.0939309   .0140948    -6.66   0.000    -.1216018   -.0662599
_IstaXyear_54 |  -.0796572   .0140774    -5.66   0.000    -.1072941   -.0520203
_IstaXyear_55 |  -.0672679   .0144699    -4.65   0.000    -.0956753   -.0388604
_IstaXyear_56 |  -.0099554   .0139047    -0.72   0.474    -.0372533    .0173424
_IstaXyear_57 |  -.0012724   .0141918    -0.09   0.929    -.0291338    .0265891
_IstaXyear_58 |  -.0514796   .0140212    -3.67   0.000     -.079006   -.0239532
_IstaXyear_59 |  -.0310693   .0142789    -2.18   0.030    -.0591016   -.0030369
_IstaXyear_61 |  -.0404103   .0140098    -2.88   0.004    -.0679144   -.0129062
_IstaXyear_62 |  -.0182214   .0139341    -1.31   0.191    -.0455769    .0091342
_IstaXyear_63 |  -.0054994   .0141517    -0.39   0.698    -.0332821    .0222832
_IstaXyear_64 |   .0876899   .0138292     6.34   0.000     .0605404    .1148394
_IstaXyear_71 |   .0343497   .0141108     2.43   0.015     .0066474     .062052
_IstaXyear_72 |  -.0822234   .0141586    -5.81   0.000    -.1100195   -.0544272
_IstaXyear_73 |  -.0551852   .0140806    -3.92   0.000    -.0828283    -.027542
_IstaXyear_74 |  -.0547346   .0140948    -3.88   0.000    -.0824056   -.0270635
_IstaXyear_81 |   .0440522   .0141968     3.10   0.002     .0161811    .0719234
_IstaXyear_82 |   -.009325   .0138671    -0.67   0.502     -.036549     .017899
_IstaXyear_83 |   -.024653   .0146553    -1.68   0.093    -.0534243    .0041183
_IstaXyear_84 |  -.0954928   .0140144    -6.81   0.000    -.1230059   -.0679797
_IstaXyear_85 |  -.0262562   .0138844    -1.89   0.059     -.053514    .0010017
_IstaXyear_86 |   -.076577   .0145529    -5.26   0.000    -.1051474   -.0480066
_IstaXyear_87 |   .0077712   .0144011     0.54   0.590    -.0205012    .0360435
_IstaXyear_88 |    -.06463   .0152062    -4.25   0.000    -.0944829    -.034777
_IstaXyear_91 |  -.0704529   .0139953    -5.03   0.000    -.0979285   -.0429772
_IstaXyear_92 |  -.0326463   .0138436    -2.36   0.019    -.0598242   -.0054684
_IstaXyear_93 |  -.0993569   .0138263    -7.19   0.000    -.1265008    -.072213
_IstaXyear_94 |  -.0497143   .0140522    -3.54   0.000    -.0773017   -.0221269
_IstaXyear_95 |  -.1042808   .0141835    -7.35   0.000    -.1321258   -.0764357
        _cons |  -13.32548   2.805782    -4.75   0.000    -18.83381   -7.817154
-------------------------------------------------------------------------------

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
. /*Cluster robust standard errors allowing for heteroskedasicity as well
> as autocorrelation between observation within states*/
. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  , r /*OLS + robust se*/

Linear regression                               Number of obs     =        850
                                                F(116, 733)       =    1267.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0343738     4.22   0.000     .0776589    .2126244
        lnemp |   1.499868   .2744967     5.46   0.000     .9609748    2.038762
              |
         year |
          80  |   .0228275   .0457262     0.50   0.618    -.0669424    .1125974
          81  |   .0501135   .0459611     1.09   0.276    -.0401175    .1403445
          82  |   .0943474   .0500853     1.88   0.060    -.0039803    .1926751
          83  |   .1425118   .0464957     3.07   0.002     .0512312    .2337925
          84  |    .498567   .0537563     9.27   0.000     .3930323    .6041017
          85  |   .7175139    .064882    11.06   0.000     .5901372    .8448907
          86  |   .8454916   .0741009    11.41   0.000     .7000163    .9909669
          87  |   .9771231   .0837868    11.66   0.000     .8126323    1.141614
          88  |   1.301494    .084743    15.36   0.000     1.135126    1.467861
          89  |   1.409538   .0940368    14.99   0.000     1.224924    1.594151
          90  |    1.47865   .1021715    14.47   0.000     1.278067    1.679234
          91  |   1.570146   .1082885    14.50   0.000     1.357553    1.782738
          92  |   1.747922   .1133281    15.42   0.000     1.525436    1.970409
          93  |   2.037697   .1221159    16.69   0.000     1.797958    2.277435
          94  |   2.193295   .1324259    16.56   0.000     1.933315    2.453274
          95  |   2.312267   .1417715    16.31   0.000     2.033941    2.590594
              |
        state |
          12  |   4.161048    1.84052     2.26   0.024     .5477283    7.774367
          13  |  -2.989472   2.028842    -1.47   0.141    -6.972507    .9935623
          14  |    9.11025    1.14942     7.93   0.000     6.853703     11.3668
          15  |    5.00001   1.159479     4.31   0.000     2.723713    7.276306
          16  |   10.60946   1.099627     9.65   0.000     8.450665    12.76825
          21  |   9.848309   1.291515     7.63   0.000     7.312799    12.38382
          22  |   9.587233   1.193792     8.03   0.000     7.243573    11.93089
          23  |   6.610883   1.121555     5.89   0.000      4.40904    8.812726
          31  |   3.834553   1.075218     3.57   0.000     1.723679    5.945427
          32  |   3.723175   1.008239     3.69   0.000     1.743794    5.702555
          33  |   3.855385    1.13311     3.40   0.001     1.630858    6.079912
          34  |   3.898319    1.27107     3.07   0.002     1.402947    6.393691
          35  |    7.70993    .898434     8.58   0.000     5.946119    9.473741
          41  |    9.25227   1.209408     7.65   0.000     6.877954    11.62659
          42  |   5.727127   1.156614     4.95   0.000     3.456456    7.997797
          43  |   6.353889   .9156868     6.94   0.000     4.556208    8.151571
          44  |    1.83218   2.247035     0.82   0.415    -2.579211    6.243571
          45  |   3.992405   1.879351     2.12   0.034     .3028526    7.681958
          46  |   4.272376   .9529567     4.48   0.000     2.401526    6.143226
          47  |   .4720782   .8938149     0.53   0.598    -1.282664    2.226821
          51  |   10.16903   1.014345    10.03   0.000     8.177667     12.1604
          52  |   8.228764   .9534479     8.63   0.000      6.35695    10.10058
          54  |   6.705244   .9691691     6.92   0.000     4.802566    8.607923
          55  |   5.491493    .976355     5.62   0.000     3.574707    7.408278
          56  |   .6147688   .9053289     0.68   0.497    -1.162578    2.392116
          57  |   .1733435   .8362726     0.21   0.836    -1.468432    1.815119
          58  |   4.597464   .8161614     5.63   0.000     2.995171    6.199756
          59  |   2.910721   .8587114     3.39   0.001     1.224894    4.596548
          61  |   3.429778   .9351579     3.67   0.000     1.593871    5.265686
          62  |   1.529689   1.041769     1.47   0.142    -.5155183    3.574896
          63  |   .1110399   1.114614     0.10   0.921    -2.077176    2.299256
          64  |  -8.360757    1.42726    -5.86   0.000    -11.16276   -5.558752
          71  |   -2.84782   1.156303    -2.46   0.014     -5.11788   -.5777605
          72  |   7.545168    1.06944     7.06   0.000     5.445636    9.644699
          73  |   5.065417   1.083656     4.67   0.000     2.937978    7.192856
          74  |   4.444996   1.277701     3.48   0.001     1.936606    6.953385
          81  |  -4.667171   1.188281    -3.93   0.000     -7.00001   -2.334332
          82  |   .6493388   1.007269     0.64   0.519    -1.328137    2.626814
          83  |   1.764114   1.545995     1.14   0.254    -1.270992    4.799221
          84  |   8.679613   .8978519     9.67   0.000     6.916945    10.44228
          85  |   2.398924   .8130916     2.95   0.003     .8026583     3.99519
          86  |   7.228274   .9034971     8.00   0.000     5.454524    9.002025
          87  |  -.2487644   1.173761    -0.21   0.832    -2.553099     2.05557
          88  |   5.872883   1.025537     5.73   0.000     3.859543    7.886224
          91  |   5.839442   .8143364     7.17   0.000     4.240732    7.438152
          92  |   3.007486   .8020193     3.75   0.000     1.432957    4.582014
          93  |    8.27507   1.134572     7.29   0.000     6.047673    10.50247
          94  |   4.072716   1.111653     3.66   0.000     1.890314    6.255119
          95  |   9.403113   1.043833     9.01   0.000     7.353855    11.45237
              |
_IstaXyear_12 |    -.04131   .0211214    -1.96   0.051    -.0827757    .0001556
_IstaXyear_13 |   .0317075   .0226103     1.40   0.161    -.0126811    .0760961
_IstaXyear_14 |  -.1027491   .0097698   -10.52   0.000    -.1219292   -.0835691
_IstaXyear_15 |  -.0450472   .0134773    -3.34   0.001    -.0715058   -.0185886
_IstaXyear_16 |  -.1178754   .0107679   -10.95   0.000    -.1390151   -.0967357
_IstaXyear_21 |  -.1178324    .008974   -13.13   0.000    -.1354503   -.1002145
_IstaXyear_22 |  -.1118645   .0107739   -10.38   0.000    -.1330158   -.0907132
_IstaXyear_23 |  -.0809985   .0080791   -10.03   0.000    -.0968596   -.0651375
_IstaXyear_31 |  -.0476254    .008447    -5.64   0.000    -.0642085   -.0310422
_IstaXyear_32 |  -.0452292   .0099742    -4.53   0.000    -.0648105   -.0256479
_IstaXyear_33 |  -.0476682    .008969    -5.31   0.000    -.0652762   -.0300602
_IstaXyear_34 |  -.0465305   .0120168    -3.87   0.000    -.0701218   -.0229391
_IstaXyear_35 |  -.0882184   .0089432    -9.86   0.000    -.1057759    -.070661
_IstaXyear_41 |  -.1031885   .0128823    -8.01   0.000    -.1284791    -.077898
_IstaXyear_42 |  -.0694882   .0126827    -5.48   0.000    -.0943871   -.0445894
_IstaXyear_43 |  -.0738372   .0088361    -8.36   0.000    -.0911844   -.0564901
_IstaXyear_44 |  -.0324975   .0249469    -1.30   0.193    -.0814734    .0164784
_IstaXyear_45 |  -.0499423   .0208388    -2.40   0.017    -.0908531   -.0090314
_IstaXyear_46 |  -.0454383   .0104174    -4.36   0.000    -.0658898   -.0249868
_IstaXyear_47 |  -.0078129   .0095131    -0.82   0.412    -.0264892    .0108633
_IstaXyear_51 |  -.1008186    .011119    -9.07   0.000    -.1226474   -.0789897
_IstaXyear_52 |  -.0939309   .0096566    -9.73   0.000    -.1128888   -.0749729
_IstaXyear_54 |  -.0796572   .0103697    -7.68   0.000     -.100015   -.0592994
_IstaXyear_55 |  -.0672679   .0105383    -6.38   0.000    -.0879567    -.046579
_IstaXyear_56 |  -.0099554   .0097213    -1.02   0.306    -.0290404    .0091295
_IstaXyear_57 |  -.0012724   .0092504    -0.14   0.891    -.0194328     .016888
_IstaXyear_58 |  -.0514796   .0092972    -5.54   0.000    -.0697318   -.0332273
_IstaXyear_59 |  -.0310693   .0103735    -3.00   0.003    -.0514346   -.0107039
_IstaXyear_61 |  -.0404103   .0101995    -3.96   0.000     -.060434   -.0203866
_IstaXyear_62 |  -.0182214   .0113764    -1.60   0.110    -.0405556    .0041129
_IstaXyear_63 |  -.0054994   .0119773    -0.46   0.646    -.0290133    .0180145
_IstaXyear_64 |   .0876899   .0163389     5.37   0.000     .0556133    .1197665
_IstaXyear_71 |   .0343497   .0132692     2.59   0.010     .0082996    .0603999
_IstaXyear_72 |  -.0822234   .0100972    -8.14   0.000    -.1020462   -.0624006
_IstaXyear_73 |  -.0551852   .0111107    -4.97   0.000    -.0769977   -.0333727
_IstaXyear_74 |  -.0547346   .0117161    -4.67   0.000    -.0777356   -.0317335
_IstaXyear_81 |   .0440522   .0135285     3.26   0.001      .017493    .0706114
_IstaXyear_82 |   -.009325   .0113939    -0.82   0.413    -.0316936    .0130437
_IstaXyear_83 |   -.024653   .0167958    -1.47   0.143    -.0576267    .0083206
_IstaXyear_84 |  -.0954928   .0097869    -9.76   0.000    -.1147065    -.076279
_IstaXyear_85 |  -.0262562   .0091504    -2.87   0.004    -.0442202   -.0082921
_IstaXyear_86 |   -.076577   .0111457    -6.87   0.000    -.0984582   -.0546957
_IstaXyear_87 |   .0077712   .0136503     0.57   0.569    -.0190272    .0345695
_IstaXyear_88 |    -.06463   .0117603    -5.50   0.000    -.0877179    -.041542
_IstaXyear_91 |  -.0704529   .0093461    -7.54   0.000    -.0888012   -.0521045
_IstaXyear_92 |  -.0326463   .0087623    -3.73   0.000    -.0498485   -.0154442
_IstaXyear_93 |  -.0993569   .0082086   -12.10   0.000    -.1154722   -.0832416
_IstaXyear_94 |  -.0497143   .0122473    -4.06   0.000    -.0737582   -.0256704
_IstaXyear_95 |  -.1042808    .011792    -8.84   0.000    -.1274308   -.0811307
        _cons |  -13.32548   3.559779    -3.74   0.000    -20.31406   -6.336901
-------------------------------------------------------------------------------

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Robust)
results/table2.xml
dir : seeout

. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  , cluster(state) /*OLS + State Cluster*/

Linear regression                               Number of obs     =        850
                                                F(16, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

                                  (Std. Err. adjusted for 50 clusters in state)
-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0583994     2.49   0.016     .0277837    .2624997
        lnemp |   1.499868   .4271839     3.51   0.001     .6414103    2.358326
              |
         year |
          80  |   .0228275   .0318813     0.72   0.477    -.0412404    .0868954
          81  |   .0501135   .0498013     1.01   0.319    -.0499659    .1501929
          82  |   .0943474   .0560909     1.68   0.099    -.0183715    .2070663
          83  |   .1425118   .0460038     3.10   0.003     .0500638    .2349599
          84  |    .498567   .0492231    10.13   0.000     .3996495    .5974845
          85  |   .7175139    .060448    11.87   0.000      .596039    .8389889
          86  |   .8454916   .0651168    12.98   0.000     .7146346    .9763487
          87  |   .9771231   .0753424    12.97   0.000     .8257169    1.128529
          88  |   1.301494   .0700871    18.57   0.000     1.160648    1.442339
          89  |   1.409538   .0782071    18.02   0.000     1.252375    1.566701
          90  |    1.47865   .0853992    17.31   0.000     1.307034    1.650266
          91  |   1.570146     .08527    18.41   0.000      1.39879    1.741502
          92  |   1.747922   .0898576    19.45   0.000     1.567347    1.928498
          93  |   2.037697   .0979778    20.80   0.000     1.840803     2.23459
          94  |   2.193295   .1143771    19.18   0.000     1.963445    2.423144
          95  |   2.312267   .1266629    18.26   0.000     2.057729    2.566806
              |
        state |
          12  |   4.161048   .4647597     8.95   0.000     3.227078    5.095017
          13  |  -2.989472   .4977384    -6.01   0.000    -3.989715   -1.989229
          14  |    9.11025    1.41176     6.45   0.000     6.273212    11.94729
          15  |    5.00001    .416609    12.00   0.000     4.162802    5.837217
          16  |   10.60946   1.136461     9.34   0.000     8.325655    12.89326
          21  |   9.848309   1.738079     5.67   0.000     6.355508    13.34111
          22  |   9.587233   1.304661     7.35   0.000     6.965417    12.20905
          23  |   6.610883   1.417544     4.66   0.000     3.762221    9.459545
          31  |   3.834553   1.299659     2.95   0.005      1.22279    6.446317
          32  |   3.723175   .9322915     3.99   0.000     1.849665    5.596685
          33  |   3.855385   1.304079     2.96   0.005      1.23474    6.476029
          34  |   3.898319   1.054135     3.70   0.001     1.779954    6.016683
          35  |    7.70993   .8332104     9.25   0.000     6.035531    9.384329
          41  |    9.25227   .6997398    13.22   0.000      7.84609    10.65845
          42  |   5.727127   .8074531     7.09   0.000     4.104489    7.349765
          43  |   6.353889    .709584     8.95   0.000     4.927927    7.779852
          44  |    1.83218   .3932353     4.66   0.000     1.041944    2.622416
          45  |   3.992405   .4942637     8.08   0.000     2.999145    4.985665
          46  |   4.272376   .4250511    10.05   0.000     3.418204    5.126548
          47  |   .4720782   .6460612     0.73   0.468    -.8262304    1.770387
          51  |   10.16903   .4052272    25.09   0.000       9.3547    10.98337
          52  |   8.228764   .8355439     9.85   0.000     6.549676    9.907853
          54  |   6.705244   .6395896    10.48   0.000     5.419941    7.990548
          55  |   5.491493    .901498     6.09   0.000     3.679865    7.303121
          56  |   .6147688    .517063     1.19   0.240    -.4243083    1.653846
          57  |   .1733435    .604218     0.29   0.775    -1.040878    1.387565
          58  |   4.597464   .3511137    13.09   0.000     3.891874    5.303053
          59  |   2.910721   .3745213     7.77   0.000     2.158092    3.663349
          61  |   3.429778   .5337292     6.43   0.000      2.35721    4.502347
          62  |   1.529689   .4964817     3.08   0.003     .5319718    2.527406
          63  |   .1110399    .722517     0.15   0.878    -1.340912    1.562992
          64  |  -8.360757   .3425248   -24.41   0.000    -9.049086   -7.672428
          71  |   -2.84782   .4006998    -7.11   0.000    -3.653057   -2.042584
          72  |   7.545168   1.054001     7.16   0.000     5.427074    9.663261
          73  |   5.065417   .8452861     5.99   0.000     3.366751    6.764083
          74  |   4.444996   1.314643     3.38   0.001     1.803122    7.086869
          81  |  -4.667171   .4807288    -9.71   0.000    -5.633232    -3.70111
          82  |   .6493388   .3036154     2.14   0.037     .0392008    1.259477
          83  |   1.764114   .6144766     2.87   0.006     .5292773    2.998951
          84  |   8.679613   .5472741    15.86   0.000     7.579824    9.779401
          85  |   2.398924   .1461975    16.41   0.000      2.10513    2.692719
          86  |   7.228274   .3636178    19.88   0.000     6.497557    7.958991
          87  |  -.2487644   .4919375    -0.51   0.615     -1.23735     .739821
          88  |   5.872883   .9510628     6.18   0.000     3.961651    7.784116
          91  |   5.839442   .2104484    27.75   0.000      5.41653    6.262354
          92  |   3.007486    .244874    12.28   0.000     2.515393    3.499578
          93  |    8.27507   1.377914     6.01   0.000     5.506047    11.04409
          94  |   4.072716   .5625016     7.24   0.000     2.942327    5.203106
          95  |   9.403113   .4564124    20.60   0.000     8.485918    10.32031
              |
_IstaXyear_12 |    -.04131   .0049986    -8.26   0.000    -.0513551   -.0312649
_IstaXyear_13 |   .0317075   .0045957     6.90   0.000      .022472     .040943
_IstaXyear_14 |  -.1027491   .0081759   -12.57   0.000    -.1191792   -.0863191
_IstaXyear_15 |  -.0450472   .0051637    -8.72   0.000     -.055424   -.0346704
_IstaXyear_16 |  -.1178754   .0078515   -15.01   0.000    -.1336535   -.1020973
_IstaXyear_21 |  -.1178324   .0067422   -17.48   0.000    -.1313813   -.1042834
_IstaXyear_22 |  -.1118645   .0064469   -17.35   0.000    -.1248201    -.098909
_IstaXyear_23 |  -.0809985    .004695   -17.25   0.000    -.0904335   -.0715636
_IstaXyear_31 |  -.0476254   .0045549   -10.46   0.000    -.0567789   -.0384719
_IstaXyear_32 |  -.0452292    .005205    -8.69   0.000     -.055689   -.0347694
_IstaXyear_33 |  -.0476682   .0034772   -13.71   0.000     -.054656   -.0406805
_IstaXyear_34 |  -.0465305    .002303   -20.20   0.000    -.0511585   -.0419024
_IstaXyear_35 |  -.0882184   .0046681   -18.90   0.000    -.0975994   -.0788375
_IstaXyear_41 |  -.1031885    .003611   -28.58   0.000     -.110445    -.095932
_IstaXyear_42 |  -.0694882   .0059369   -11.70   0.000     -.081419   -.0575575
_IstaXyear_43 |  -.0738372   .0013738   -53.75   0.000     -.076598   -.0710764
_IstaXyear_44 |  -.0324975    .005867    -5.54   0.000    -.0442878   -.0207072
_IstaXyear_45 |  -.0499423    .003894   -12.83   0.000    -.0577676   -.0421169
_IstaXyear_46 |  -.0454383   .0038444   -11.82   0.000     -.053164   -.0377126
_IstaXyear_47 |  -.0078129   .0047253    -1.65   0.105    -.0173088    .0016829
_IstaXyear_51 |  -.1008186   .0026013   -38.76   0.000     -.106046   -.0955911
_IstaXyear_52 |  -.0939309   .0047831   -19.64   0.000    -.1035429   -.0843189
_IstaXyear_54 |  -.0796572   .0041069   -19.40   0.000    -.0879103   -.0714041
_IstaXyear_55 |  -.0672679   .0090454    -7.44   0.000    -.0854453   -.0490904
_IstaXyear_56 |  -.0099554   .0029376    -3.39   0.001    -.0158588   -.0040521
_IstaXyear_57 |  -.0012724   .0050557    -0.25   0.802    -.0114322    .0088874
_IstaXyear_58 |  -.0514796   .0046174   -11.15   0.000    -.0607586   -.0422006
_IstaXyear_59 |  -.0310693   .0070556    -4.40   0.000    -.0452481   -.0168905
_IstaXyear_61 |  -.0404103   .0036192   -11.17   0.000    -.0476833   -.0331373
_IstaXyear_62 |  -.0182214   .0027364    -6.66   0.000    -.0237203   -.0127224
_IstaXyear_63 |  -.0054994   .0050414    -1.09   0.281    -.0156305    .0046316
_IstaXyear_64 |   .0876899   .0006739   130.11   0.000     .0863356    .0890442
_IstaXyear_71 |   .0343497   .0043848     7.83   0.000     .0255381    .0431614
_IstaXyear_72 |  -.0822234   .0060358   -13.62   0.000    -.0943528   -.0700939
_IstaXyear_73 |  -.0551852   .0052766   -10.46   0.000    -.0657889   -.0445814
_IstaXyear_74 |  -.0547346    .004764   -11.49   0.000    -.0643081    -.045161
_IstaXyear_81 |   .0440522   .0063244     6.97   0.000     .0313428    .0567617
_IstaXyear_82 |   -.009325   .0021347    -4.37   0.000    -.0136149   -.0050351
_IstaXyear_83 |   -.024653   .0103674    -2.38   0.021     -.045487    -.003819
_IstaXyear_84 |  -.0954928   .0036364   -26.26   0.000    -.1028004   -.0881851
_IstaXyear_85 |  -.0262562   .0021443   -12.24   0.000    -.0305653    -.021947
_IstaXyear_86 |   -.076577    .007714    -9.93   0.000    -.0920789    -.061075
_IstaXyear_87 |   .0077712   .0063311     1.23   0.226    -.0049516     .020494
_IstaXyear_88 |    -.06463   .0112713    -5.73   0.000    -.0872805   -.0419794
_IstaXyear_91 |  -.0704529   .0043004   -16.38   0.000    -.0790949   -.0618109
_IstaXyear_92 |  -.0326463   .0014192   -23.00   0.000    -.0354982   -.0297944
_IstaXyear_93 |  -.0993569   .0003808  -260.91   0.000    -.1001222   -.0985916
_IstaXyear_94 |  -.0497143   .0038949   -12.76   0.000    -.0575414   -.0418872
_IstaXyear_95 |  -.1042808   .0049639   -21.01   0.000    -.1142562   -.0943054
        _cons |  -13.32548   5.525634    -2.41   0.020    -24.42966   -2.221303
-------------------------------------------------------------------------------

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Cluster)
results/table2.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg lnths D lnemp i.year i.state  _IstaXyear*  /*OLS*/

      Source |       SS           df       MS      Number of obs   =       850
-------------+----------------------------------   F(116, 733)     =    542.38
       Model |  2453.11017       116  21.1475015   Prob > F        =    0.0000
    Residual |  28.5800091       733  .038990463   R-squared       =    0.9885
-------------+----------------------------------   Adj R-squared   =    0.9867
       Total |  2481.69018       849  2.92307442   Root MSE        =    .19746

-------------------------------------------------------------------------------
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417    .033961     4.27   0.000     .0784692    .2118141
        lnemp |   1.499868   .2162408     6.94   0.000     1.075343    1.924394
              |
         year |
          80  |   .0228275   .0406728     0.56   0.575    -.0570217    .1026767
          81  |   .0501135   .0440825     1.14   0.256    -.0364295    .1366565
          82  |   .0943474   .0490485     1.92   0.055    -.0019448    .1906396
          83  |   .1425118   .0554341     2.57   0.010     .0336833    .2513404
          84  |    .498567   .0635292     7.85   0.000     .3738462    .6232879
          85  |   .7175139    .072529     9.89   0.000     .5751247    .8599032
          86  |   .8454916   .0813005    10.40   0.000     .6858821    1.005101
          87  |   .9771231   .0910154    10.74   0.000     .7984411    1.155805
          88  |   1.301494    .101362    12.84   0.000     1.102499    1.500488
          89  |   1.409538    .111538    12.64   0.000     1.190566     1.62851
          90  |    1.47865   .1212414    12.20   0.000     1.240628    1.716672
          91  |   1.570146   .1293665    12.14   0.000     1.316173    1.824119
          92  |   1.747922   .1389311    12.58   0.000     1.475172    2.020673
          93  |   2.037697   .1493741    13.64   0.000     1.744445    2.330949
          94  |   2.193295    .160511    13.66   0.000     1.878179    2.508411
          95  |   2.312267   .1713015    13.50   0.000     1.975967    2.648567
              |
        state |
          12  |   4.161048    1.23827     3.36   0.001      1.73007    6.592026
          13  |  -2.989472   1.246612    -2.40   0.017    -5.436827   -.5421174
          14  |    9.11025   1.376268     6.62   0.000     6.408353    11.81215
          15  |    5.00001   1.221696     4.09   0.000     2.601569     7.39845
          16  |   10.60946    1.31773     8.05   0.000     8.022485    13.19643
          21  |   9.848309   1.471267     6.69   0.000     6.959909    12.73671
          22  |   9.587233   1.352823     7.09   0.000     6.931363     12.2431
          23  |   6.610883   1.397944     4.73   0.000     3.866432    9.355334
          31  |   3.834553   1.356969     2.83   0.005     1.170544    6.498563
          32  |   3.723175   1.281958     2.90   0.004     1.206428    6.239922
          33  |   3.855385   1.373686     2.81   0.005     1.158556    6.552213
          34  |   3.898319   1.311929     2.97   0.003     1.322733    6.473904
          35  |    7.70993   1.266857     6.09   0.000     5.222829    10.19703
          41  |    9.25227   1.248656     7.41   0.000     6.800901    11.70364
          42  |   5.727127   1.264198     4.53   0.000     3.245246    8.209008
          43  |   6.353889   1.260443     5.04   0.000      3.87938    8.828398
          44  |    1.83218   1.225896     1.49   0.135    -.5745051    4.238866
          45  |   3.992405   1.243343     3.21   0.001     1.551467    6.433344
          46  |   4.272376   1.223684     3.49   0.001     1.870034    6.674719
          47  |   .4720782   1.243323     0.38   0.704    -1.968821    2.912977
          51  |   10.16903   1.223606     8.31   0.000     7.766844    12.57123
          52  |   8.228764   1.267183     6.49   0.000     5.741024     10.7165
          54  |   6.705244   1.241757     5.40   0.000     4.267419    9.143069
          55  |   5.491493   1.277077     4.30   0.000     2.984328    7.998658
          56  |   .6147688   1.231136     0.50   0.618    -1.802204    3.031741
          57  |   .1733435   1.242562     0.14   0.889    -2.266062    2.612749
          58  |   4.597464   1.216648     3.78   0.000     2.208934    6.985993
          59  |   2.910721   1.218351     2.39   0.017      .518848    5.302593
          61  |   3.429778   1.231484     2.79   0.005     1.012122    5.847435
          62  |   1.529689   1.227033     1.25   0.213    -.8792287    3.938607
          63  |   .1110399   1.253971     0.09   0.929    -2.350763    2.572843
          64  |  -8.360757   1.216051    -6.88   0.000    -10.74812   -5.973398
          71  |   -2.84782   1.225918    -2.32   0.020     -5.25455   -.4410907
          72  |   7.545168   1.314219     5.74   0.000     4.965085    10.12525
          73  |   5.065417    1.27841     3.96   0.000     2.555634    7.575199
          74  |   4.444996   1.355047     3.28   0.001      1.78476    7.105232
          81  |  -4.667171   1.235994    -3.78   0.000    -7.093681   -2.240661
          82  |   .6493388   1.214442     0.53   0.593     -1.73486    3.033538
          83  |   1.764114    1.24143     1.42   0.156    -.6730677    4.201296
          84  |   8.679613    1.23266     7.04   0.000     6.259647    11.09958
          85  |   2.398924   1.208146     1.99   0.047     .0270863    4.770763
          86  |   7.228274   1.227414     5.89   0.000     4.818607    9.637941
          87  |  -.2487644   1.245979    -0.20   0.842    -2.694877    2.197348
          88  |   5.872883   1.319585     4.45   0.000     3.282266      8.4635
          91  |   5.839442   1.209379     4.83   0.000     3.465184    8.213701
          92  |   3.007486   1.211038     2.48   0.013     .6299691    5.385002
          93  |    8.27507   1.392033     5.94   0.000     5.542223    11.00792
          94  |   4.072716   1.252498     3.25   0.001     1.613805    6.531628
          95  |   9.403113   1.239463     7.59   0.000     6.969792    11.83643
              |
_IstaXyear_12 |    -.04131   .0141624    -2.92   0.004    -.0691137   -.0135063
_IstaXyear_13 |   .0317075   .0141038     2.25   0.025     .0040188    .0593962
_IstaXyear_14 |  -.1027491    .014368    -7.15   0.000    -.1309565   -.0745418
_IstaXyear_15 |  -.0450472   .0140699    -3.20   0.001    -.0726693   -.0174251
_IstaXyear_16 |  -.1178754   .0143208    -8.23   0.000    -.1459901   -.0897608
_IstaXyear_21 |  -.1178324    .014182    -8.31   0.000    -.1456745   -.0899902
_IstaXyear_22 |  -.1118645   .0141856    -7.89   0.000    -.1397138   -.0840153
_IstaXyear_23 |  -.0809985   .0140278    -5.77   0.000    -.1085379   -.0534592
_IstaXyear_31 |  -.0476254   .0139982    -3.40   0.001    -.0751067    -.020144
_IstaXyear_32 |  -.0452292   .0141455    -3.20   0.001    -.0729997   -.0174587
_IstaXyear_33 |  -.0476682   .0139366    -3.42   0.001    -.0750286   -.0203079
_IstaXyear_34 |  -.0465305   .0138672    -3.36   0.001    -.0737547   -.0193062
_IstaXyear_35 |  -.0882184   .0140968    -6.26   0.000    -.1158933   -.0605435
_IstaXyear_41 |  -.1031885   .0140015    -7.37   0.000    -.1306763   -.0757008
_IstaXyear_42 |  -.0694882    .014172    -4.90   0.000    -.0973107   -.0416658
_IstaXyear_43 |  -.0738372   .0138535    -5.33   0.000    -.1010345     -.04664
_IstaXyear_44 |  -.0324975   .0141241    -2.30   0.022    -.0602261   -.0047689
_IstaXyear_45 |  -.0499423   .0140521    -3.55   0.000    -.0775295   -.0223551
_IstaXyear_46 |  -.0454383   .0139936    -3.25   0.001    -.0729106   -.0179659
_IstaXyear_47 |  -.0078129   .0140572    -0.56   0.579    -.0354101    .0197843
_IstaXyear_51 |  -.1008186   .0138875    -7.26   0.000    -.1280826   -.0735545
_IstaXyear_52 |  -.0939309   .0140948    -6.66   0.000    -.1216018   -.0662599
_IstaXyear_54 |  -.0796572   .0140774    -5.66   0.000    -.1072941   -.0520203
_IstaXyear_55 |  -.0672679   .0144699    -4.65   0.000    -.0956753   -.0388604
_IstaXyear_56 |  -.0099554   .0139047    -0.72   0.474    -.0372533    .0173424
_IstaXyear_57 |  -.0012724   .0141918    -0.09   0.929    -.0291338    .0265891
_IstaXyear_58 |  -.0514796   .0140212    -3.67   0.000     -.079006   -.0239532
_IstaXyear_59 |  -.0310693   .0142789    -2.18   0.030    -.0591016   -.0030369
_IstaXyear_61 |  -.0404103   .0140098    -2.88   0.004    -.0679144   -.0129062
_IstaXyear_62 |  -.0182214   .0139341    -1.31   0.191    -.0455769    .0091342
_IstaXyear_63 |  -.0054994   .0141517    -0.39   0.698    -.0332821    .0222832
_IstaXyear_64 |   .0876899   .0138292     6.34   0.000     .0605404    .1148394
_IstaXyear_71 |   .0343497   .0141108     2.43   0.015     .0066474     .062052
_IstaXyear_72 |  -.0822234   .0141586    -5.81   0.000    -.1100195   -.0544272
_IstaXyear_73 |  -.0551852   .0140806    -3.92   0.000    -.0828283    -.027542
_IstaXyear_74 |  -.0547346   .0140948    -3.88   0.000    -.0824056   -.0270635
_IstaXyear_81 |   .0440522   .0141968     3.10   0.002     .0161811    .0719234
_IstaXyear_82 |   -.009325   .0138671    -0.67   0.502     -.036549     .017899
_IstaXyear_83 |   -.024653   .0146553    -1.68   0.093    -.0534243    .0041183
_IstaXyear_84 |  -.0954928   .0140144    -6.81   0.000    -.1230059   -.0679797
_IstaXyear_85 |  -.0262562   .0138844    -1.89   0.059     -.053514    .0010017
_IstaXyear_86 |   -.076577   .0145529    -5.26   0.000    -.1051474   -.0480066
_IstaXyear_87 |   .0077712   .0144011     0.54   0.590    -.0205012    .0360435
_IstaXyear_88 |    -.06463   .0152062    -4.25   0.000    -.0944829    -.034777
_IstaXyear_91 |  -.0704529   .0139953    -5.03   0.000    -.0979285   -.0429772
_IstaXyear_92 |  -.0326463   .0138436    -2.36   0.019    -.0598242   -.0054684
_IstaXyear_93 |  -.0993569   .0138263    -7.19   0.000    -.1265008    -.072213
_IstaXyear_94 |  -.0497143   .0140522    -3.54   0.000    -.0773017   -.0221269
_IstaXyear_95 |  -.1042808   .0141835    -7.35   0.000    -.1321258   -.0764357
        _cons |  -13.32548   2.805782    -4.75   0.000    -18.83381   -7.817154
-------------------------------------------------------------------------------

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
. /*Cluster robust standard errors allowing for heteroskedasicity as well
> as autocorrelation between observation within states*/
. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  , r /*OLS + robust se*/

Linear regression                               Number of obs     =        850
                                                F(116, 733)       =    1267.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0343738     4.22   0.000     .0776589    .2126244
        lnemp |   1.499868   .2744967     5.46   0.000     .9609748    2.038762
              |
         year |
          80  |   .0228275   .0457262     0.50   0.618    -.0669424    .1125974
          81  |   .0501135   .0459611     1.09   0.276    -.0401175    .1403445
          82  |   .0943474   .0500853     1.88   0.060    -.0039803    .1926751
          83  |   .1425118   .0464957     3.07   0.002     .0512312    .2337925
          84  |    .498567   .0537563     9.27   0.000     .3930323    .6041017
          85  |   .7175139    .064882    11.06   0.000     .5901372    .8448907
          86  |   .8454916   .0741009    11.41   0.000     .7000163    .9909669
          87  |   .9771231   .0837868    11.66   0.000     .8126323    1.141614
          88  |   1.301494    .084743    15.36   0.000     1.135126    1.467861
          89  |   1.409538   .0940368    14.99   0.000     1.224924    1.594151
          90  |    1.47865   .1021715    14.47   0.000     1.278067    1.679234
          91  |   1.570146   .1082885    14.50   0.000     1.357553    1.782738
          92  |   1.747922   .1133281    15.42   0.000     1.525436    1.970409
          93  |   2.037697   .1221159    16.69   0.000     1.797958    2.277435
          94  |   2.193295   .1324259    16.56   0.000     1.933315    2.453274
          95  |   2.312267   .1417715    16.31   0.000     2.033941    2.590594
              |
        state |
          12  |   4.161048    1.84052     2.26   0.024     .5477283    7.774367
          13  |  -2.989472   2.028842    -1.47   0.141    -6.972507    .9935623
          14  |    9.11025    1.14942     7.93   0.000     6.853703     11.3668
          15  |    5.00001   1.159479     4.31   0.000     2.723713    7.276306
          16  |   10.60946   1.099627     9.65   0.000     8.450665    12.76825
          21  |   9.848309   1.291515     7.63   0.000     7.312799    12.38382
          22  |   9.587233   1.193792     8.03   0.000     7.243573    11.93089
          23  |   6.610883   1.121555     5.89   0.000      4.40904    8.812726
          31  |   3.834553   1.075218     3.57   0.000     1.723679    5.945427
          32  |   3.723175   1.008239     3.69   0.000     1.743794    5.702555
          33  |   3.855385    1.13311     3.40   0.001     1.630858    6.079912
          34  |   3.898319    1.27107     3.07   0.002     1.402947    6.393691
          35  |    7.70993    .898434     8.58   0.000     5.946119    9.473741
          41  |    9.25227   1.209408     7.65   0.000     6.877954    11.62659
          42  |   5.727127   1.156614     4.95   0.000     3.456456    7.997797
          43  |   6.353889   .9156868     6.94   0.000     4.556208    8.151571
          44  |    1.83218   2.247035     0.82   0.415    -2.579211    6.243571
          45  |   3.992405   1.879351     2.12   0.034     .3028526    7.681958
          46  |   4.272376   .9529567     4.48   0.000     2.401526    6.143226
          47  |   .4720782   .8938149     0.53   0.598    -1.282664    2.226821
          51  |   10.16903   1.014345    10.03   0.000     8.177667     12.1604
          52  |   8.228764   .9534479     8.63   0.000      6.35695    10.10058
          54  |   6.705244   .9691691     6.92   0.000     4.802566    8.607923
          55  |   5.491493    .976355     5.62   0.000     3.574707    7.408278
          56  |   .6147688   .9053289     0.68   0.497    -1.162578    2.392116
          57  |   .1733435   .8362726     0.21   0.836    -1.468432    1.815119
          58  |   4.597464   .8161614     5.63   0.000     2.995171    6.199756
          59  |   2.910721   .8587114     3.39   0.001     1.224894    4.596548
          61  |   3.429778   .9351579     3.67   0.000     1.593871    5.265686
          62  |   1.529689   1.041769     1.47   0.142    -.5155183    3.574896
          63  |   .1110399   1.114614     0.10   0.921    -2.077176    2.299256
          64  |  -8.360757    1.42726    -5.86   0.000    -11.16276   -5.558752
          71  |   -2.84782   1.156303    -2.46   0.014     -5.11788   -.5777605
          72  |   7.545168    1.06944     7.06   0.000     5.445636    9.644699
          73  |   5.065417   1.083656     4.67   0.000     2.937978    7.192856
          74  |   4.444996   1.277701     3.48   0.001     1.936606    6.953385
          81  |  -4.667171   1.188281    -3.93   0.000     -7.00001   -2.334332
          82  |   .6493388   1.007269     0.64   0.519    -1.328137    2.626814
          83  |   1.764114   1.545995     1.14   0.254    -1.270992    4.799221
          84  |   8.679613   .8978519     9.67   0.000     6.916945    10.44228
          85  |   2.398924   .8130916     2.95   0.003     .8026583     3.99519
          86  |   7.228274   .9034971     8.00   0.000     5.454524    9.002025
          87  |  -.2487644   1.173761    -0.21   0.832    -2.553099     2.05557
          88  |   5.872883   1.025537     5.73   0.000     3.859543    7.886224
          91  |   5.839442   .8143364     7.17   0.000     4.240732    7.438152
          92  |   3.007486   .8020193     3.75   0.000     1.432957    4.582014
          93  |    8.27507   1.134572     7.29   0.000     6.047673    10.50247
          94  |   4.072716   1.111653     3.66   0.000     1.890314    6.255119
          95  |   9.403113   1.043833     9.01   0.000     7.353855    11.45237
              |
_IstaXyear_12 |    -.04131   .0211214    -1.96   0.051    -.0827757    .0001556
_IstaXyear_13 |   .0317075   .0226103     1.40   0.161    -.0126811    .0760961
_IstaXyear_14 |  -.1027491   .0097698   -10.52   0.000    -.1219292   -.0835691
_IstaXyear_15 |  -.0450472   .0134773    -3.34   0.001    -.0715058   -.0185886
_IstaXyear_16 |  -.1178754   .0107679   -10.95   0.000    -.1390151   -.0967357
_IstaXyear_21 |  -.1178324    .008974   -13.13   0.000    -.1354503   -.1002145
_IstaXyear_22 |  -.1118645   .0107739   -10.38   0.000    -.1330158   -.0907132
_IstaXyear_23 |  -.0809985   .0080791   -10.03   0.000    -.0968596   -.0651375
_IstaXyear_31 |  -.0476254    .008447    -5.64   0.000    -.0642085   -.0310422
_IstaXyear_32 |  -.0452292   .0099742    -4.53   0.000    -.0648105   -.0256479
_IstaXyear_33 |  -.0476682    .008969    -5.31   0.000    -.0652762   -.0300602
_IstaXyear_34 |  -.0465305   .0120168    -3.87   0.000    -.0701218   -.0229391
_IstaXyear_35 |  -.0882184   .0089432    -9.86   0.000    -.1057759    -.070661
_IstaXyear_41 |  -.1031885   .0128823    -8.01   0.000    -.1284791    -.077898
_IstaXyear_42 |  -.0694882   .0126827    -5.48   0.000    -.0943871   -.0445894
_IstaXyear_43 |  -.0738372   .0088361    -8.36   0.000    -.0911844   -.0564901
_IstaXyear_44 |  -.0324975   .0249469    -1.30   0.193    -.0814734    .0164784
_IstaXyear_45 |  -.0499423   .0208388    -2.40   0.017    -.0908531   -.0090314
_IstaXyear_46 |  -.0454383   .0104174    -4.36   0.000    -.0658898   -.0249868
_IstaXyear_47 |  -.0078129   .0095131    -0.82   0.412    -.0264892    .0108633
_IstaXyear_51 |  -.1008186    .011119    -9.07   0.000    -.1226474   -.0789897
_IstaXyear_52 |  -.0939309   .0096566    -9.73   0.000    -.1128888   -.0749729
_IstaXyear_54 |  -.0796572   .0103697    -7.68   0.000     -.100015   -.0592994
_IstaXyear_55 |  -.0672679   .0105383    -6.38   0.000    -.0879567    -.046579
_IstaXyear_56 |  -.0099554   .0097213    -1.02   0.306    -.0290404    .0091295
_IstaXyear_57 |  -.0012724   .0092504    -0.14   0.891    -.0194328     .016888
_IstaXyear_58 |  -.0514796   .0092972    -5.54   0.000    -.0697318   -.0332273
_IstaXyear_59 |  -.0310693   .0103735    -3.00   0.003    -.0514346   -.0107039
_IstaXyear_61 |  -.0404103   .0101995    -3.96   0.000     -.060434   -.0203866
_IstaXyear_62 |  -.0182214   .0113764    -1.60   0.110    -.0405556    .0041129
_IstaXyear_63 |  -.0054994   .0119773    -0.46   0.646    -.0290133    .0180145
_IstaXyear_64 |   .0876899   .0163389     5.37   0.000     .0556133    .1197665
_IstaXyear_71 |   .0343497   .0132692     2.59   0.010     .0082996    .0603999
_IstaXyear_72 |  -.0822234   .0100972    -8.14   0.000    -.1020462   -.0624006
_IstaXyear_73 |  -.0551852   .0111107    -4.97   0.000    -.0769977   -.0333727
_IstaXyear_74 |  -.0547346   .0117161    -4.67   0.000    -.0777356   -.0317335
_IstaXyear_81 |   .0440522   .0135285     3.26   0.001      .017493    .0706114
_IstaXyear_82 |   -.009325   .0113939    -0.82   0.413    -.0316936    .0130437
_IstaXyear_83 |   -.024653   .0167958    -1.47   0.143    -.0576267    .0083206
_IstaXyear_84 |  -.0954928   .0097869    -9.76   0.000    -.1147065    -.076279
_IstaXyear_85 |  -.0262562   .0091504    -2.87   0.004    -.0442202   -.0082921
_IstaXyear_86 |   -.076577   .0111457    -6.87   0.000    -.0984582   -.0546957
_IstaXyear_87 |   .0077712   .0136503     0.57   0.569    -.0190272    .0345695
_IstaXyear_88 |    -.06463   .0117603    -5.50   0.000    -.0877179    -.041542
_IstaXyear_91 |  -.0704529   .0093461    -7.54   0.000    -.0888012   -.0521045
_IstaXyear_92 |  -.0326463   .0087623    -3.73   0.000    -.0498485   -.0154442
_IstaXyear_93 |  -.0993569   .0082086   -12.10   0.000    -.1154722   -.0832416
_IstaXyear_94 |  -.0497143   .0122473    -4.06   0.000    -.0737582   -.0256704
_IstaXyear_95 |  -.1042808    .011792    -8.84   0.000    -.1274308   -.0811307
        _cons |  -13.32548   3.559779    -3.74   0.000    -20.31406   -6.336901
-------------------------------------------------------------------------------

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Robust)
results/table2.xml
dir : seeout

. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  , cluster(state) /*OLS + State Cluster*/

Linear regression                               Number of obs     =        850
                                                F(16, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

                                  (Std. Err. adjusted for 50 clusters in state)
-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0583994     2.49   0.016     .0277837    .2624997
        lnemp |   1.499868   .4271839     3.51   0.001     .6414103    2.358326
              |
         year |
          80  |   .0228275   .0318813     0.72   0.477    -.0412404    .0868954
          81  |   .0501135   .0498013     1.01   0.319    -.0499659    .1501929
          82  |   .0943474   .0560909     1.68   0.099    -.0183715    .2070663
          83  |   .1425118   .0460038     3.10   0.003     .0500638    .2349599
          84  |    .498567   .0492231    10.13   0.000     .3996495    .5974845
          85  |   .7175139    .060448    11.87   0.000      .596039    .8389889
          86  |   .8454916   .0651168    12.98   0.000     .7146346    .9763487
          87  |   .9771231   .0753424    12.97   0.000     .8257169    1.128529
          88  |   1.301494   .0700871    18.57   0.000     1.160648    1.442339
          89  |   1.409538   .0782071    18.02   0.000     1.252375    1.566701
          90  |    1.47865   .0853992    17.31   0.000     1.307034    1.650266
          91  |   1.570146     .08527    18.41   0.000      1.39879    1.741502
          92  |   1.747922   .0898576    19.45   0.000     1.567347    1.928498
          93  |   2.037697   .0979778    20.80   0.000     1.840803     2.23459
          94  |   2.193295   .1143771    19.18   0.000     1.963445    2.423144
          95  |   2.312267   .1266629    18.26   0.000     2.057729    2.566806
              |
        state |
          12  |   4.161048   .4647597     8.95   0.000     3.227078    5.095017
          13  |  -2.989472   .4977384    -6.01   0.000    -3.989715   -1.989229
          14  |    9.11025    1.41176     6.45   0.000     6.273212    11.94729
          15  |    5.00001    .416609    12.00   0.000     4.162802    5.837217
          16  |   10.60946   1.136461     9.34   0.000     8.325655    12.89326
          21  |   9.848309   1.738079     5.67   0.000     6.355508    13.34111
          22  |   9.587233   1.304661     7.35   0.000     6.965417    12.20905
          23  |   6.610883   1.417544     4.66   0.000     3.762221    9.459545
          31  |   3.834553   1.299659     2.95   0.005      1.22279    6.446317
          32  |   3.723175   .9322915     3.99   0.000     1.849665    5.596685
          33  |   3.855385   1.304079     2.96   0.005      1.23474    6.476029
          34  |   3.898319   1.054135     3.70   0.001     1.779954    6.016683
          35  |    7.70993   .8332104     9.25   0.000     6.035531    9.384329
          41  |    9.25227   .6997398    13.22   0.000      7.84609    10.65845
          42  |   5.727127   .8074531     7.09   0.000     4.104489    7.349765
          43  |   6.353889    .709584     8.95   0.000     4.927927    7.779852
          44  |    1.83218   .3932353     4.66   0.000     1.041944    2.622416
          45  |   3.992405   .4942637     8.08   0.000     2.999145    4.985665
          46  |   4.272376   .4250511    10.05   0.000     3.418204    5.126548
          47  |   .4720782   .6460612     0.73   0.468    -.8262304    1.770387
          51  |   10.16903   .4052272    25.09   0.000       9.3547    10.98337
          52  |   8.228764   .8355439     9.85   0.000     6.549676    9.907853
          54  |   6.705244   .6395896    10.48   0.000     5.419941    7.990548
          55  |   5.491493    .901498     6.09   0.000     3.679865    7.303121
          56  |   .6147688    .517063     1.19   0.240    -.4243083    1.653846
          57  |   .1733435    .604218     0.29   0.775    -1.040878    1.387565
          58  |   4.597464   .3511137    13.09   0.000     3.891874    5.303053
          59  |   2.910721   .3745213     7.77   0.000     2.158092    3.663349
          61  |   3.429778   .5337292     6.43   0.000      2.35721    4.502347
          62  |   1.529689   .4964817     3.08   0.003     .5319718    2.527406
          63  |   .1110399    .722517     0.15   0.878    -1.340912    1.562992
          64  |  -8.360757   .3425248   -24.41   0.000    -9.049086   -7.672428
          71  |   -2.84782   .4006998    -7.11   0.000    -3.653057   -2.042584
          72  |   7.545168   1.054001     7.16   0.000     5.427074    9.663261
          73  |   5.065417   .8452861     5.99   0.000     3.366751    6.764083
          74  |   4.444996   1.314643     3.38   0.001     1.803122    7.086869
          81  |  -4.667171   .4807288    -9.71   0.000    -5.633232    -3.70111
          82  |   .6493388   .3036154     2.14   0.037     .0392008    1.259477
          83  |   1.764114   .6144766     2.87   0.006     .5292773    2.998951
          84  |   8.679613   .5472741    15.86   0.000     7.579824    9.779401
          85  |   2.398924   .1461975    16.41   0.000      2.10513    2.692719
          86  |   7.228274   .3636178    19.88   0.000     6.497557    7.958991
          87  |  -.2487644   .4919375    -0.51   0.615     -1.23735     .739821
          88  |   5.872883   .9510628     6.18   0.000     3.961651    7.784116
          91  |   5.839442   .2104484    27.75   0.000      5.41653    6.262354
          92  |   3.007486    .244874    12.28   0.000     2.515393    3.499578
          93  |    8.27507   1.377914     6.01   0.000     5.506047    11.04409
          94  |   4.072716   .5625016     7.24   0.000     2.942327    5.203106
          95  |   9.403113   .4564124    20.60   0.000     8.485918    10.32031
              |
_IstaXyear_12 |    -.04131   .0049986    -8.26   0.000    -.0513551   -.0312649
_IstaXyear_13 |   .0317075   .0045957     6.90   0.000      .022472     .040943
_IstaXyear_14 |  -.1027491   .0081759   -12.57   0.000    -.1191792   -.0863191
_IstaXyear_15 |  -.0450472   .0051637    -8.72   0.000     -.055424   -.0346704
_IstaXyear_16 |  -.1178754   .0078515   -15.01   0.000    -.1336535   -.1020973
_IstaXyear_21 |  -.1178324   .0067422   -17.48   0.000    -.1313813   -.1042834
_IstaXyear_22 |  -.1118645   .0064469   -17.35   0.000    -.1248201    -.098909
_IstaXyear_23 |  -.0809985    .004695   -17.25   0.000    -.0904335   -.0715636
_IstaXyear_31 |  -.0476254   .0045549   -10.46   0.000    -.0567789   -.0384719
_IstaXyear_32 |  -.0452292    .005205    -8.69   0.000     -.055689   -.0347694
_IstaXyear_33 |  -.0476682   .0034772   -13.71   0.000     -.054656   -.0406805
_IstaXyear_34 |  -.0465305    .002303   -20.20   0.000    -.0511585   -.0419024
_IstaXyear_35 |  -.0882184   .0046681   -18.90   0.000    -.0975994   -.0788375
_IstaXyear_41 |  -.1031885    .003611   -28.58   0.000     -.110445    -.095932
_IstaXyear_42 |  -.0694882   .0059369   -11.70   0.000     -.081419   -.0575575
_IstaXyear_43 |  -.0738372   .0013738   -53.75   0.000     -.076598   -.0710764
_IstaXyear_44 |  -.0324975    .005867    -5.54   0.000    -.0442878   -.0207072
_IstaXyear_45 |  -.0499423    .003894   -12.83   0.000    -.0577676   -.0421169
_IstaXyear_46 |  -.0454383   .0038444   -11.82   0.000     -.053164   -.0377126
_IstaXyear_47 |  -.0078129   .0047253    -1.65   0.105    -.0173088    .0016829
_IstaXyear_51 |  -.1008186   .0026013   -38.76   0.000     -.106046   -.0955911
_IstaXyear_52 |  -.0939309   .0047831   -19.64   0.000    -.1035429   -.0843189
_IstaXyear_54 |  -.0796572   .0041069   -19.40   0.000    -.0879103   -.0714041
_IstaXyear_55 |  -.0672679   .0090454    -7.44   0.000    -.0854453   -.0490904
_IstaXyear_56 |  -.0099554   .0029376    -3.39   0.001    -.0158588   -.0040521
_IstaXyear_57 |  -.0012724   .0050557    -0.25   0.802    -.0114322    .0088874
_IstaXyear_58 |  -.0514796   .0046174   -11.15   0.000    -.0607586   -.0422006
_IstaXyear_59 |  -.0310693   .0070556    -4.40   0.000    -.0452481   -.0168905
_IstaXyear_61 |  -.0404103   .0036192   -11.17   0.000    -.0476833   -.0331373
_IstaXyear_62 |  -.0182214   .0027364    -6.66   0.000    -.0237203   -.0127224
_IstaXyear_63 |  -.0054994   .0050414    -1.09   0.281    -.0156305    .0046316
_IstaXyear_64 |   .0876899   .0006739   130.11   0.000     .0863356    .0890442
_IstaXyear_71 |   .0343497   .0043848     7.83   0.000     .0255381    .0431614
_IstaXyear_72 |  -.0822234   .0060358   -13.62   0.000    -.0943528   -.0700939
_IstaXyear_73 |  -.0551852   .0052766   -10.46   0.000    -.0657889   -.0445814
_IstaXyear_74 |  -.0547346    .004764   -11.49   0.000    -.0643081    -.045161
_IstaXyear_81 |   .0440522   .0063244     6.97   0.000     .0313428    .0567617
_IstaXyear_82 |   -.009325   .0021347    -4.37   0.000    -.0136149   -.0050351
_IstaXyear_83 |   -.024653   .0103674    -2.38   0.021     -.045487    -.003819
_IstaXyear_84 |  -.0954928   .0036364   -26.26   0.000    -.1028004   -.0881851
_IstaXyear_85 |  -.0262562   .0021443   -12.24   0.000    -.0305653    -.021947
_IstaXyear_86 |   -.076577    .007714    -9.93   0.000    -.0920789    -.061075
_IstaXyear_87 |   .0077712   .0063311     1.23   0.226    -.0049516     .020494
_IstaXyear_88 |    -.06463   .0112713    -5.73   0.000    -.0872805   -.0419794
_IstaXyear_91 |  -.0704529   .0043004   -16.38   0.000    -.0790949   -.0618109
_IstaXyear_92 |  -.0326463   .0014192   -23.00   0.000    -.0354982   -.0297944
_IstaXyear_93 |  -.0993569   .0003808  -260.91   0.000    -.1001222   -.0985916
_IstaXyear_94 |  -.0497143   .0038949   -12.76   0.000    -.0575414   -.0418872
_IstaXyear_95 |  -.1042808   .0049639   -21.01   0.000    -.1142562   -.0943054
        _cons |  -13.32548   5.525634    -2.41   0.020    -24.42966   -2.221303
-------------------------------------------------------------------------------

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Cluster)
results/table2.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. qui reg lnths  D  lnemp _Iy* _Istate* _IstaXyear* 
variable _Iy* not found
r(111);

end of do-file
r(111);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. qui reg lnths  D  i.year _Istate* _IstaXyear* 

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
. qui reg lnths D lnemp i.year _Istate* _IstaXyear* , robust

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors , Robust)
results/table2.xml
dir : seeout

. 
. qui reg lnths D lnemp i.year _Istate* _IstaXyear* , cluster(state)

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Cluster)
results/table2.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. reg lnths D lnemp i.year i.state  _IstaXyear*  /*OLS*/

      Source |       SS           df       MS      Number of obs   =       850
-------------+----------------------------------   F(116, 733)     =    542.38
       Model |  2453.11017       116  21.1475015   Prob > F        =    0.0000
    Residual |  28.5800091       733  .038990463   R-squared       =    0.9885
-------------+----------------------------------   Adj R-squared   =    0.9867
       Total |  2481.69018       849  2.92307442   Root MSE        =    .19746

-------------------------------------------------------------------------------
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417    .033961     4.27   0.000     .0784692    .2118141
        lnemp |   1.499868   .2162408     6.94   0.000     1.075343    1.924394
              |
         year |
          80  |   .0228275   .0406728     0.56   0.575    -.0570217    .1026767
          81  |   .0501135   .0440825     1.14   0.256    -.0364295    .1366565
          82  |   .0943474   .0490485     1.92   0.055    -.0019448    .1906396
          83  |   .1425118   .0554341     2.57   0.010     .0336833    .2513404
          84  |    .498567   .0635292     7.85   0.000     .3738462    .6232879
          85  |   .7175139    .072529     9.89   0.000     .5751247    .8599032
          86  |   .8454916   .0813005    10.40   0.000     .6858821    1.005101
          87  |   .9771231   .0910154    10.74   0.000     .7984411    1.155805
          88  |   1.301494    .101362    12.84   0.000     1.102499    1.500488
          89  |   1.409538    .111538    12.64   0.000     1.190566     1.62851
          90  |    1.47865   .1212414    12.20   0.000     1.240628    1.716672
          91  |   1.570146   .1293665    12.14   0.000     1.316173    1.824119
          92  |   1.747922   .1389311    12.58   0.000     1.475172    2.020673
          93  |   2.037697   .1493741    13.64   0.000     1.744445    2.330949
          94  |   2.193295    .160511    13.66   0.000     1.878179    2.508411
          95  |   2.312267   .1713015    13.50   0.000     1.975967    2.648567
              |
        state |
          12  |   4.161048    1.23827     3.36   0.001      1.73007    6.592026
          13  |  -2.989472   1.246612    -2.40   0.017    -5.436827   -.5421174
          14  |    9.11025   1.376268     6.62   0.000     6.408353    11.81215
          15  |    5.00001   1.221696     4.09   0.000     2.601569     7.39845
          16  |   10.60946    1.31773     8.05   0.000     8.022485    13.19643
          21  |   9.848309   1.471267     6.69   0.000     6.959909    12.73671
          22  |   9.587233   1.352823     7.09   0.000     6.931363     12.2431
          23  |   6.610883   1.397944     4.73   0.000     3.866432    9.355334
          31  |   3.834553   1.356969     2.83   0.005     1.170544    6.498563
          32  |   3.723175   1.281958     2.90   0.004     1.206428    6.239922
          33  |   3.855385   1.373686     2.81   0.005     1.158556    6.552213
          34  |   3.898319   1.311929     2.97   0.003     1.322733    6.473904
          35  |    7.70993   1.266857     6.09   0.000     5.222829    10.19703
          41  |    9.25227   1.248656     7.41   0.000     6.800901    11.70364
          42  |   5.727127   1.264198     4.53   0.000     3.245246    8.209008
          43  |   6.353889   1.260443     5.04   0.000      3.87938    8.828398
          44  |    1.83218   1.225896     1.49   0.135    -.5745051    4.238866
          45  |   3.992405   1.243343     3.21   0.001     1.551467    6.433344
          46  |   4.272376   1.223684     3.49   0.001     1.870034    6.674719
          47  |   .4720782   1.243323     0.38   0.704    -1.968821    2.912977
          51  |   10.16903   1.223606     8.31   0.000     7.766844    12.57123
          52  |   8.228764   1.267183     6.49   0.000     5.741024     10.7165
          54  |   6.705244   1.241757     5.40   0.000     4.267419    9.143069
          55  |   5.491493   1.277077     4.30   0.000     2.984328    7.998658
          56  |   .6147688   1.231136     0.50   0.618    -1.802204    3.031741
          57  |   .1733435   1.242562     0.14   0.889    -2.266062    2.612749
          58  |   4.597464   1.216648     3.78   0.000     2.208934    6.985993
          59  |   2.910721   1.218351     2.39   0.017      .518848    5.302593
          61  |   3.429778   1.231484     2.79   0.005     1.012122    5.847435
          62  |   1.529689   1.227033     1.25   0.213    -.8792287    3.938607
          63  |   .1110399   1.253971     0.09   0.929    -2.350763    2.572843
          64  |  -8.360757   1.216051    -6.88   0.000    -10.74812   -5.973398
          71  |   -2.84782   1.225918    -2.32   0.020     -5.25455   -.4410907
          72  |   7.545168   1.314219     5.74   0.000     4.965085    10.12525
          73  |   5.065417    1.27841     3.96   0.000     2.555634    7.575199
          74  |   4.444996   1.355047     3.28   0.001      1.78476    7.105232
          81  |  -4.667171   1.235994    -3.78   0.000    -7.093681   -2.240661
          82  |   .6493388   1.214442     0.53   0.593     -1.73486    3.033538
          83  |   1.764114    1.24143     1.42   0.156    -.6730677    4.201296
          84  |   8.679613    1.23266     7.04   0.000     6.259647    11.09958
          85  |   2.398924   1.208146     1.99   0.047     .0270863    4.770763
          86  |   7.228274   1.227414     5.89   0.000     4.818607    9.637941
          87  |  -.2487644   1.245979    -0.20   0.842    -2.694877    2.197348
          88  |   5.872883   1.319585     4.45   0.000     3.282266      8.4635
          91  |   5.839442   1.209379     4.83   0.000     3.465184    8.213701
          92  |   3.007486   1.211038     2.48   0.013     .6299691    5.385002
          93  |    8.27507   1.392033     5.94   0.000     5.542223    11.00792
          94  |   4.072716   1.252498     3.25   0.001     1.613805    6.531628
          95  |   9.403113   1.239463     7.59   0.000     6.969792    11.83643
              |
_IstaXyear_12 |    -.04131   .0141624    -2.92   0.004    -.0691137   -.0135063
_IstaXyear_13 |   .0317075   .0141038     2.25   0.025     .0040188    .0593962
_IstaXyear_14 |  -.1027491    .014368    -7.15   0.000    -.1309565   -.0745418
_IstaXyear_15 |  -.0450472   .0140699    -3.20   0.001    -.0726693   -.0174251
_IstaXyear_16 |  -.1178754   .0143208    -8.23   0.000    -.1459901   -.0897608
_IstaXyear_21 |  -.1178324    .014182    -8.31   0.000    -.1456745   -.0899902
_IstaXyear_22 |  -.1118645   .0141856    -7.89   0.000    -.1397138   -.0840153
_IstaXyear_23 |  -.0809985   .0140278    -5.77   0.000    -.1085379   -.0534592
_IstaXyear_31 |  -.0476254   .0139982    -3.40   0.001    -.0751067    -.020144
_IstaXyear_32 |  -.0452292   .0141455    -3.20   0.001    -.0729997   -.0174587
_IstaXyear_33 |  -.0476682   .0139366    -3.42   0.001    -.0750286   -.0203079
_IstaXyear_34 |  -.0465305   .0138672    -3.36   0.001    -.0737547   -.0193062
_IstaXyear_35 |  -.0882184   .0140968    -6.26   0.000    -.1158933   -.0605435
_IstaXyear_41 |  -.1031885   .0140015    -7.37   0.000    -.1306763   -.0757008
_IstaXyear_42 |  -.0694882    .014172    -4.90   0.000    -.0973107   -.0416658
_IstaXyear_43 |  -.0738372   .0138535    -5.33   0.000    -.1010345     -.04664
_IstaXyear_44 |  -.0324975   .0141241    -2.30   0.022    -.0602261   -.0047689
_IstaXyear_45 |  -.0499423   .0140521    -3.55   0.000    -.0775295   -.0223551
_IstaXyear_46 |  -.0454383   .0139936    -3.25   0.001    -.0729106   -.0179659
_IstaXyear_47 |  -.0078129   .0140572    -0.56   0.579    -.0354101    .0197843
_IstaXyear_51 |  -.1008186   .0138875    -7.26   0.000    -.1280826   -.0735545
_IstaXyear_52 |  -.0939309   .0140948    -6.66   0.000    -.1216018   -.0662599
_IstaXyear_54 |  -.0796572   .0140774    -5.66   0.000    -.1072941   -.0520203
_IstaXyear_55 |  -.0672679   .0144699    -4.65   0.000    -.0956753   -.0388604
_IstaXyear_56 |  -.0099554   .0139047    -0.72   0.474    -.0372533    .0173424
_IstaXyear_57 |  -.0012724   .0141918    -0.09   0.929    -.0291338    .0265891
_IstaXyear_58 |  -.0514796   .0140212    -3.67   0.000     -.079006   -.0239532
_IstaXyear_59 |  -.0310693   .0142789    -2.18   0.030    -.0591016   -.0030369
_IstaXyear_61 |  -.0404103   .0140098    -2.88   0.004    -.0679144   -.0129062
_IstaXyear_62 |  -.0182214   .0139341    -1.31   0.191    -.0455769    .0091342
_IstaXyear_63 |  -.0054994   .0141517    -0.39   0.698    -.0332821    .0222832
_IstaXyear_64 |   .0876899   .0138292     6.34   0.000     .0605404    .1148394
_IstaXyear_71 |   .0343497   .0141108     2.43   0.015     .0066474     .062052
_IstaXyear_72 |  -.0822234   .0141586    -5.81   0.000    -.1100195   -.0544272
_IstaXyear_73 |  -.0551852   .0140806    -3.92   0.000    -.0828283    -.027542
_IstaXyear_74 |  -.0547346   .0140948    -3.88   0.000    -.0824056   -.0270635
_IstaXyear_81 |   .0440522   .0141968     3.10   0.002     .0161811    .0719234
_IstaXyear_82 |   -.009325   .0138671    -0.67   0.502     -.036549     .017899
_IstaXyear_83 |   -.024653   .0146553    -1.68   0.093    -.0534243    .0041183
_IstaXyear_84 |  -.0954928   .0140144    -6.81   0.000    -.1230059   -.0679797
_IstaXyear_85 |  -.0262562   .0138844    -1.89   0.059     -.053514    .0010017
_IstaXyear_86 |   -.076577   .0145529    -5.26   0.000    -.1051474   -.0480066
_IstaXyear_87 |   .0077712   .0144011     0.54   0.590    -.0205012    .0360435
_IstaXyear_88 |    -.06463   .0152062    -4.25   0.000    -.0944829    -.034777
_IstaXyear_91 |  -.0704529   .0139953    -5.03   0.000    -.0979285   -.0429772
_IstaXyear_92 |  -.0326463   .0138436    -2.36   0.019    -.0598242   -.0054684
_IstaXyear_93 |  -.0993569   .0138263    -7.19   0.000    -.1265008    -.072213
_IstaXyear_94 |  -.0497143   .0140522    -3.54   0.000    -.0773017   -.0221269
_IstaXyear_95 |  -.1042808   .0141835    -7.35   0.000    -.1321258   -.0764357
        _cons |  -13.32548   2.805782    -4.75   0.000    -18.83381   -7.817154
-------------------------------------------------------------------------------

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
. /*Cluster robust standard errors allowing for heteroskedasicity as well
> as autocorrelation between observation within states*/
. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  , r /*OLS + robust se*/

Linear regression                               Number of obs     =        850
                                                F(116, 733)       =    1267.50
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0343738     4.22   0.000     .0776589    .2126244
        lnemp |   1.499868   .2744967     5.46   0.000     .9609748    2.038762
              |
         year |
          80  |   .0228275   .0457262     0.50   0.618    -.0669424    .1125974
          81  |   .0501135   .0459611     1.09   0.276    -.0401175    .1403445
          82  |   .0943474   .0500853     1.88   0.060    -.0039803    .1926751
          83  |   .1425118   .0464957     3.07   0.002     .0512312    .2337925
          84  |    .498567   .0537563     9.27   0.000     .3930323    .6041017
          85  |   .7175139    .064882    11.06   0.000     .5901372    .8448907
          86  |   .8454916   .0741009    11.41   0.000     .7000163    .9909669
          87  |   .9771231   .0837868    11.66   0.000     .8126323    1.141614
          88  |   1.301494    .084743    15.36   0.000     1.135126    1.467861
          89  |   1.409538   .0940368    14.99   0.000     1.224924    1.594151
          90  |    1.47865   .1021715    14.47   0.000     1.278067    1.679234
          91  |   1.570146   .1082885    14.50   0.000     1.357553    1.782738
          92  |   1.747922   .1133281    15.42   0.000     1.525436    1.970409
          93  |   2.037697   .1221159    16.69   0.000     1.797958    2.277435
          94  |   2.193295   .1324259    16.56   0.000     1.933315    2.453274
          95  |   2.312267   .1417715    16.31   0.000     2.033941    2.590594
              |
        state |
          12  |   4.161048    1.84052     2.26   0.024     .5477283    7.774367
          13  |  -2.989472   2.028842    -1.47   0.141    -6.972507    .9935623
          14  |    9.11025    1.14942     7.93   0.000     6.853703     11.3668
          15  |    5.00001   1.159479     4.31   0.000     2.723713    7.276306
          16  |   10.60946   1.099627     9.65   0.000     8.450665    12.76825
          21  |   9.848309   1.291515     7.63   0.000     7.312799    12.38382
          22  |   9.587233   1.193792     8.03   0.000     7.243573    11.93089
          23  |   6.610883   1.121555     5.89   0.000      4.40904    8.812726
          31  |   3.834553   1.075218     3.57   0.000     1.723679    5.945427
          32  |   3.723175   1.008239     3.69   0.000     1.743794    5.702555
          33  |   3.855385    1.13311     3.40   0.001     1.630858    6.079912
          34  |   3.898319    1.27107     3.07   0.002     1.402947    6.393691
          35  |    7.70993    .898434     8.58   0.000     5.946119    9.473741
          41  |    9.25227   1.209408     7.65   0.000     6.877954    11.62659
          42  |   5.727127   1.156614     4.95   0.000     3.456456    7.997797
          43  |   6.353889   .9156868     6.94   0.000     4.556208    8.151571
          44  |    1.83218   2.247035     0.82   0.415    -2.579211    6.243571
          45  |   3.992405   1.879351     2.12   0.034     .3028526    7.681958
          46  |   4.272376   .9529567     4.48   0.000     2.401526    6.143226
          47  |   .4720782   .8938149     0.53   0.598    -1.282664    2.226821
          51  |   10.16903   1.014345    10.03   0.000     8.177667     12.1604
          52  |   8.228764   .9534479     8.63   0.000      6.35695    10.10058
          54  |   6.705244   .9691691     6.92   0.000     4.802566    8.607923
          55  |   5.491493    .976355     5.62   0.000     3.574707    7.408278
          56  |   .6147688   .9053289     0.68   0.497    -1.162578    2.392116
          57  |   .1733435   .8362726     0.21   0.836    -1.468432    1.815119
          58  |   4.597464   .8161614     5.63   0.000     2.995171    6.199756
          59  |   2.910721   .8587114     3.39   0.001     1.224894    4.596548
          61  |   3.429778   .9351579     3.67   0.000     1.593871    5.265686
          62  |   1.529689   1.041769     1.47   0.142    -.5155183    3.574896
          63  |   .1110399   1.114614     0.10   0.921    -2.077176    2.299256
          64  |  -8.360757    1.42726    -5.86   0.000    -11.16276   -5.558752
          71  |   -2.84782   1.156303    -2.46   0.014     -5.11788   -.5777605
          72  |   7.545168    1.06944     7.06   0.000     5.445636    9.644699
          73  |   5.065417   1.083656     4.67   0.000     2.937978    7.192856
          74  |   4.444996   1.277701     3.48   0.001     1.936606    6.953385
          81  |  -4.667171   1.188281    -3.93   0.000     -7.00001   -2.334332
          82  |   .6493388   1.007269     0.64   0.519    -1.328137    2.626814
          83  |   1.764114   1.545995     1.14   0.254    -1.270992    4.799221
          84  |   8.679613   .8978519     9.67   0.000     6.916945    10.44228
          85  |   2.398924   .8130916     2.95   0.003     .8026583     3.99519
          86  |   7.228274   .9034971     8.00   0.000     5.454524    9.002025
          87  |  -.2487644   1.173761    -0.21   0.832    -2.553099     2.05557
          88  |   5.872883   1.025537     5.73   0.000     3.859543    7.886224
          91  |   5.839442   .8143364     7.17   0.000     4.240732    7.438152
          92  |   3.007486   .8020193     3.75   0.000     1.432957    4.582014
          93  |    8.27507   1.134572     7.29   0.000     6.047673    10.50247
          94  |   4.072716   1.111653     3.66   0.000     1.890314    6.255119
          95  |   9.403113   1.043833     9.01   0.000     7.353855    11.45237
              |
_IstaXyear_12 |    -.04131   .0211214    -1.96   0.051    -.0827757    .0001556
_IstaXyear_13 |   .0317075   .0226103     1.40   0.161    -.0126811    .0760961
_IstaXyear_14 |  -.1027491   .0097698   -10.52   0.000    -.1219292   -.0835691
_IstaXyear_15 |  -.0450472   .0134773    -3.34   0.001    -.0715058   -.0185886
_IstaXyear_16 |  -.1178754   .0107679   -10.95   0.000    -.1390151   -.0967357
_IstaXyear_21 |  -.1178324    .008974   -13.13   0.000    -.1354503   -.1002145
_IstaXyear_22 |  -.1118645   .0107739   -10.38   0.000    -.1330158   -.0907132
_IstaXyear_23 |  -.0809985   .0080791   -10.03   0.000    -.0968596   -.0651375
_IstaXyear_31 |  -.0476254    .008447    -5.64   0.000    -.0642085   -.0310422
_IstaXyear_32 |  -.0452292   .0099742    -4.53   0.000    -.0648105   -.0256479
_IstaXyear_33 |  -.0476682    .008969    -5.31   0.000    -.0652762   -.0300602
_IstaXyear_34 |  -.0465305   .0120168    -3.87   0.000    -.0701218   -.0229391
_IstaXyear_35 |  -.0882184   .0089432    -9.86   0.000    -.1057759    -.070661
_IstaXyear_41 |  -.1031885   .0128823    -8.01   0.000    -.1284791    -.077898
_IstaXyear_42 |  -.0694882   .0126827    -5.48   0.000    -.0943871   -.0445894
_IstaXyear_43 |  -.0738372   .0088361    -8.36   0.000    -.0911844   -.0564901
_IstaXyear_44 |  -.0324975   .0249469    -1.30   0.193    -.0814734    .0164784
_IstaXyear_45 |  -.0499423   .0208388    -2.40   0.017    -.0908531   -.0090314
_IstaXyear_46 |  -.0454383   .0104174    -4.36   0.000    -.0658898   -.0249868
_IstaXyear_47 |  -.0078129   .0095131    -0.82   0.412    -.0264892    .0108633
_IstaXyear_51 |  -.1008186    .011119    -9.07   0.000    -.1226474   -.0789897
_IstaXyear_52 |  -.0939309   .0096566    -9.73   0.000    -.1128888   -.0749729
_IstaXyear_54 |  -.0796572   .0103697    -7.68   0.000     -.100015   -.0592994
_IstaXyear_55 |  -.0672679   .0105383    -6.38   0.000    -.0879567    -.046579
_IstaXyear_56 |  -.0099554   .0097213    -1.02   0.306    -.0290404    .0091295
_IstaXyear_57 |  -.0012724   .0092504    -0.14   0.891    -.0194328     .016888
_IstaXyear_58 |  -.0514796   .0092972    -5.54   0.000    -.0697318   -.0332273
_IstaXyear_59 |  -.0310693   .0103735    -3.00   0.003    -.0514346   -.0107039
_IstaXyear_61 |  -.0404103   .0101995    -3.96   0.000     -.060434   -.0203866
_IstaXyear_62 |  -.0182214   .0113764    -1.60   0.110    -.0405556    .0041129
_IstaXyear_63 |  -.0054994   .0119773    -0.46   0.646    -.0290133    .0180145
_IstaXyear_64 |   .0876899   .0163389     5.37   0.000     .0556133    .1197665
_IstaXyear_71 |   .0343497   .0132692     2.59   0.010     .0082996    .0603999
_IstaXyear_72 |  -.0822234   .0100972    -8.14   0.000    -.1020462   -.0624006
_IstaXyear_73 |  -.0551852   .0111107    -4.97   0.000    -.0769977   -.0333727
_IstaXyear_74 |  -.0547346   .0117161    -4.67   0.000    -.0777356   -.0317335
_IstaXyear_81 |   .0440522   .0135285     3.26   0.001      .017493    .0706114
_IstaXyear_82 |   -.009325   .0113939    -0.82   0.413    -.0316936    .0130437
_IstaXyear_83 |   -.024653   .0167958    -1.47   0.143    -.0576267    .0083206
_IstaXyear_84 |  -.0954928   .0097869    -9.76   0.000    -.1147065    -.076279
_IstaXyear_85 |  -.0262562   .0091504    -2.87   0.004    -.0442202   -.0082921
_IstaXyear_86 |   -.076577   .0111457    -6.87   0.000    -.0984582   -.0546957
_IstaXyear_87 |   .0077712   .0136503     0.57   0.569    -.0190272    .0345695
_IstaXyear_88 |    -.06463   .0117603    -5.50   0.000    -.0877179    -.041542
_IstaXyear_91 |  -.0704529   .0093461    -7.54   0.000    -.0888012   -.0521045
_IstaXyear_92 |  -.0326463   .0087623    -3.73   0.000    -.0498485   -.0154442
_IstaXyear_93 |  -.0993569   .0082086   -12.10   0.000    -.1154722   -.0832416
_IstaXyear_94 |  -.0497143   .0122473    -4.06   0.000    -.0737582   -.0256704
_IstaXyear_95 |  -.1042808    .011792    -8.84   0.000    -.1274308   -.0811307
        _cons |  -13.32548   3.559779    -3.74   0.000    -20.31406   -6.336901
-------------------------------------------------------------------------------

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Robust)
results/table2.xml
dir : seeout

. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  , cluster(state) /*OLS + State Cluster*/

Linear regression                               Number of obs     =        850
                                                F(16, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9885
                                                Root MSE          =     .19746

                                  (Std. Err. adjusted for 50 clusters in state)
-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417   .0583994     2.49   0.016     .0277837    .2624997
        lnemp |   1.499868   .4271839     3.51   0.001     .6414103    2.358326
              |
         year |
          80  |   .0228275   .0318813     0.72   0.477    -.0412404    .0868954
          81  |   .0501135   .0498013     1.01   0.319    -.0499659    .1501929
          82  |   .0943474   .0560909     1.68   0.099    -.0183715    .2070663
          83  |   .1425118   .0460038     3.10   0.003     .0500638    .2349599
          84  |    .498567   .0492231    10.13   0.000     .3996495    .5974845
          85  |   .7175139    .060448    11.87   0.000      .596039    .8389889
          86  |   .8454916   .0651168    12.98   0.000     .7146346    .9763487
          87  |   .9771231   .0753424    12.97   0.000     .8257169    1.128529
          88  |   1.301494   .0700871    18.57   0.000     1.160648    1.442339
          89  |   1.409538   .0782071    18.02   0.000     1.252375    1.566701
          90  |    1.47865   .0853992    17.31   0.000     1.307034    1.650266
          91  |   1.570146     .08527    18.41   0.000      1.39879    1.741502
          92  |   1.747922   .0898576    19.45   0.000     1.567347    1.928498
          93  |   2.037697   .0979778    20.80   0.000     1.840803     2.23459
          94  |   2.193295   .1143771    19.18   0.000     1.963445    2.423144
          95  |   2.312267   .1266629    18.26   0.000     2.057729    2.566806
              |
        state |
          12  |   4.161048   .4647597     8.95   0.000     3.227078    5.095017
          13  |  -2.989472   .4977384    -6.01   0.000    -3.989715   -1.989229
          14  |    9.11025    1.41176     6.45   0.000     6.273212    11.94729
          15  |    5.00001    .416609    12.00   0.000     4.162802    5.837217
          16  |   10.60946   1.136461     9.34   0.000     8.325655    12.89326
          21  |   9.848309   1.738079     5.67   0.000     6.355508    13.34111
          22  |   9.587233   1.304661     7.35   0.000     6.965417    12.20905
          23  |   6.610883   1.417544     4.66   0.000     3.762221    9.459545
          31  |   3.834553   1.299659     2.95   0.005      1.22279    6.446317
          32  |   3.723175   .9322915     3.99   0.000     1.849665    5.596685
          33  |   3.855385   1.304079     2.96   0.005      1.23474    6.476029
          34  |   3.898319   1.054135     3.70   0.001     1.779954    6.016683
          35  |    7.70993   .8332104     9.25   0.000     6.035531    9.384329
          41  |    9.25227   .6997398    13.22   0.000      7.84609    10.65845
          42  |   5.727127   .8074531     7.09   0.000     4.104489    7.349765
          43  |   6.353889    .709584     8.95   0.000     4.927927    7.779852
          44  |    1.83218   .3932353     4.66   0.000     1.041944    2.622416
          45  |   3.992405   .4942637     8.08   0.000     2.999145    4.985665
          46  |   4.272376   .4250511    10.05   0.000     3.418204    5.126548
          47  |   .4720782   .6460612     0.73   0.468    -.8262304    1.770387
          51  |   10.16903   .4052272    25.09   0.000       9.3547    10.98337
          52  |   8.228764   .8355439     9.85   0.000     6.549676    9.907853
          54  |   6.705244   .6395896    10.48   0.000     5.419941    7.990548
          55  |   5.491493    .901498     6.09   0.000     3.679865    7.303121
          56  |   .6147688    .517063     1.19   0.240    -.4243083    1.653846
          57  |   .1733435    .604218     0.29   0.775    -1.040878    1.387565
          58  |   4.597464   .3511137    13.09   0.000     3.891874    5.303053
          59  |   2.910721   .3745213     7.77   0.000     2.158092    3.663349
          61  |   3.429778   .5337292     6.43   0.000      2.35721    4.502347
          62  |   1.529689   .4964817     3.08   0.003     .5319718    2.527406
          63  |   .1110399    .722517     0.15   0.878    -1.340912    1.562992
          64  |  -8.360757   .3425248   -24.41   0.000    -9.049086   -7.672428
          71  |   -2.84782   .4006998    -7.11   0.000    -3.653057   -2.042584
          72  |   7.545168   1.054001     7.16   0.000     5.427074    9.663261
          73  |   5.065417   .8452861     5.99   0.000     3.366751    6.764083
          74  |   4.444996   1.314643     3.38   0.001     1.803122    7.086869
          81  |  -4.667171   .4807288    -9.71   0.000    -5.633232    -3.70111
          82  |   .6493388   .3036154     2.14   0.037     .0392008    1.259477
          83  |   1.764114   .6144766     2.87   0.006     .5292773    2.998951
          84  |   8.679613   .5472741    15.86   0.000     7.579824    9.779401
          85  |   2.398924   .1461975    16.41   0.000      2.10513    2.692719
          86  |   7.228274   .3636178    19.88   0.000     6.497557    7.958991
          87  |  -.2487644   .4919375    -0.51   0.615     -1.23735     .739821
          88  |   5.872883   .9510628     6.18   0.000     3.961651    7.784116
          91  |   5.839442   .2104484    27.75   0.000      5.41653    6.262354
          92  |   3.007486    .244874    12.28   0.000     2.515393    3.499578
          93  |    8.27507   1.377914     6.01   0.000     5.506047    11.04409
          94  |   4.072716   .5625016     7.24   0.000     2.942327    5.203106
          95  |   9.403113   .4564124    20.60   0.000     8.485918    10.32031
              |
_IstaXyear_12 |    -.04131   .0049986    -8.26   0.000    -.0513551   -.0312649
_IstaXyear_13 |   .0317075   .0045957     6.90   0.000      .022472     .040943
_IstaXyear_14 |  -.1027491   .0081759   -12.57   0.000    -.1191792   -.0863191
_IstaXyear_15 |  -.0450472   .0051637    -8.72   0.000     -.055424   -.0346704
_IstaXyear_16 |  -.1178754   .0078515   -15.01   0.000    -.1336535   -.1020973
_IstaXyear_21 |  -.1178324   .0067422   -17.48   0.000    -.1313813   -.1042834
_IstaXyear_22 |  -.1118645   .0064469   -17.35   0.000    -.1248201    -.098909
_IstaXyear_23 |  -.0809985    .004695   -17.25   0.000    -.0904335   -.0715636
_IstaXyear_31 |  -.0476254   .0045549   -10.46   0.000    -.0567789   -.0384719
_IstaXyear_32 |  -.0452292    .005205    -8.69   0.000     -.055689   -.0347694
_IstaXyear_33 |  -.0476682   .0034772   -13.71   0.000     -.054656   -.0406805
_IstaXyear_34 |  -.0465305    .002303   -20.20   0.000    -.0511585   -.0419024
_IstaXyear_35 |  -.0882184   .0046681   -18.90   0.000    -.0975994   -.0788375
_IstaXyear_41 |  -.1031885    .003611   -28.58   0.000     -.110445    -.095932
_IstaXyear_42 |  -.0694882   .0059369   -11.70   0.000     -.081419   -.0575575
_IstaXyear_43 |  -.0738372   .0013738   -53.75   0.000     -.076598   -.0710764
_IstaXyear_44 |  -.0324975    .005867    -5.54   0.000    -.0442878   -.0207072
_IstaXyear_45 |  -.0499423    .003894   -12.83   0.000    -.0577676   -.0421169
_IstaXyear_46 |  -.0454383   .0038444   -11.82   0.000     -.053164   -.0377126
_IstaXyear_47 |  -.0078129   .0047253    -1.65   0.105    -.0173088    .0016829
_IstaXyear_51 |  -.1008186   .0026013   -38.76   0.000     -.106046   -.0955911
_IstaXyear_52 |  -.0939309   .0047831   -19.64   0.000    -.1035429   -.0843189
_IstaXyear_54 |  -.0796572   .0041069   -19.40   0.000    -.0879103   -.0714041
_IstaXyear_55 |  -.0672679   .0090454    -7.44   0.000    -.0854453   -.0490904
_IstaXyear_56 |  -.0099554   .0029376    -3.39   0.001    -.0158588   -.0040521
_IstaXyear_57 |  -.0012724   .0050557    -0.25   0.802    -.0114322    .0088874
_IstaXyear_58 |  -.0514796   .0046174   -11.15   0.000    -.0607586   -.0422006
_IstaXyear_59 |  -.0310693   .0070556    -4.40   0.000    -.0452481   -.0168905
_IstaXyear_61 |  -.0404103   .0036192   -11.17   0.000    -.0476833   -.0331373
_IstaXyear_62 |  -.0182214   .0027364    -6.66   0.000    -.0237203   -.0127224
_IstaXyear_63 |  -.0054994   .0050414    -1.09   0.281    -.0156305    .0046316
_IstaXyear_64 |   .0876899   .0006739   130.11   0.000     .0863356    .0890442
_IstaXyear_71 |   .0343497   .0043848     7.83   0.000     .0255381    .0431614
_IstaXyear_72 |  -.0822234   .0060358   -13.62   0.000    -.0943528   -.0700939
_IstaXyear_73 |  -.0551852   .0052766   -10.46   0.000    -.0657889   -.0445814
_IstaXyear_74 |  -.0547346    .004764   -11.49   0.000    -.0643081    -.045161
_IstaXyear_81 |   .0440522   .0063244     6.97   0.000     .0313428    .0567617
_IstaXyear_82 |   -.009325   .0021347    -4.37   0.000    -.0136149   -.0050351
_IstaXyear_83 |   -.024653   .0103674    -2.38   0.021     -.045487    -.003819
_IstaXyear_84 |  -.0954928   .0036364   -26.26   0.000    -.1028004   -.0881851
_IstaXyear_85 |  -.0262562   .0021443   -12.24   0.000    -.0305653    -.021947
_IstaXyear_86 |   -.076577    .007714    -9.93   0.000    -.0920789    -.061075
_IstaXyear_87 |   .0077712   .0063311     1.23   0.226    -.0049516     .020494
_IstaXyear_88 |    -.06463   .0112713    -5.73   0.000    -.0872805   -.0419794
_IstaXyear_91 |  -.0704529   .0043004   -16.38   0.000    -.0790949   -.0618109
_IstaXyear_92 |  -.0326463   .0014192   -23.00   0.000    -.0354982   -.0297944
_IstaXyear_93 |  -.0993569   .0003808  -260.91   0.000    -.1001222   -.0985916
_IstaXyear_94 |  -.0497143   .0038949   -12.76   0.000    -.0575414   -.0418872
_IstaXyear_95 |  -.1042808   .0049639   -21.01   0.000    -.1142562   -.0943054
        _cons |  -13.32548   5.525634    -2.41   0.020    -24.42966   -2.221303
-------------------------------------------------------------------------------

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Cluster)
results/table2.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. arbitrary form of heteroskedasticity */
command arbitrary is unrecognized
r(199);

end of do-file
r(199);
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. 
. /* Simple OLS standard errors assuming standard errors that are robust to 
> arbitrary form of heteroskedasticity */
. 
. qui reg lnths D lnemp i.year i.state  _IstaXyear*  /*OLS*/

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
. /*Cluster robust standard errors allowing for heteroskedasicity as well
> as autocorrelation between observation within states*/
. 
. qui reg lnths D lnemp i.year i.state  _IstaXyear*  , r /*OLS + robust se*/

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Robust)
results/table2.xml
dir : seeout

. 
. qui reg lnths D lnemp i.year i.state  _IstaXyear*  , cluster(state) /*OLS + State Cluster*/

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Cluster)
results/table2.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  /*OLS*/

      Source |       SS           df       MS      Number of obs   =       850
-------------+----------------------------------   F(116, 733)     =    542.38
       Model |  2453.11017       116  21.1475015   Prob > F        =    0.0000
    Residual |  28.5800091       733  .038990463   R-squared       =    0.9885
-------------+----------------------------------   Adj R-squared   =    0.9867
       Total |  2481.69018       849  2.92307442   Root MSE        =    .19746

-------------------------------------------------------------------------------
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417    .033961     4.27   0.000     .0784692    .2118141
        lnemp |   1.499868   .2162408     6.94   0.000     1.075343    1.924394
              |
         year |
          80  |   .0228275   .0406728     0.56   0.575    -.0570217    .1026767
          81  |   .0501135   .0440825     1.14   0.256    -.0364295    .1366565
          82  |   .0943474   .0490485     1.92   0.055    -.0019448    .1906396
          83  |   .1425118   .0554341     2.57   0.010     .0336833    .2513404
          84  |    .498567   .0635292     7.85   0.000     .3738462    .6232879
          85  |   .7175139    .072529     9.89   0.000     .5751247    .8599032
          86  |   .8454916   .0813005    10.40   0.000     .6858821    1.005101
          87  |   .9771231   .0910154    10.74   0.000     .7984411    1.155805
          88  |   1.301494    .101362    12.84   0.000     1.102499    1.500488
          89  |   1.409538    .111538    12.64   0.000     1.190566     1.62851
          90  |    1.47865   .1212414    12.20   0.000     1.240628    1.716672
          91  |   1.570146   .1293665    12.14   0.000     1.316173    1.824119
          92  |   1.747922   .1389311    12.58   0.000     1.475172    2.020673
          93  |   2.037697   .1493741    13.64   0.000     1.744445    2.330949
          94  |   2.193295    .160511    13.66   0.000     1.878179    2.508411
          95  |   2.312267   .1713015    13.50   0.000     1.975967    2.648567
              |
        state |
          12  |   4.161048    1.23827     3.36   0.001      1.73007    6.592026
          13  |  -2.989472   1.246612    -2.40   0.017    -5.436827   -.5421174
          14  |    9.11025   1.376268     6.62   0.000     6.408353    11.81215
          15  |    5.00001   1.221696     4.09   0.000     2.601569     7.39845
          16  |   10.60946    1.31773     8.05   0.000     8.022485    13.19643
          21  |   9.848309   1.471267     6.69   0.000     6.959909    12.73671
          22  |   9.587233   1.352823     7.09   0.000     6.931363     12.2431
          23  |   6.610883   1.397944     4.73   0.000     3.866432    9.355334
          31  |   3.834553   1.356969     2.83   0.005     1.170544    6.498563
          32  |   3.723175   1.281958     2.90   0.004     1.206428    6.239922
          33  |   3.855385   1.373686     2.81   0.005     1.158556    6.552213
          34  |   3.898319   1.311929     2.97   0.003     1.322733    6.473904
          35  |    7.70993   1.266857     6.09   0.000     5.222829    10.19703
          41  |    9.25227   1.248656     7.41   0.000     6.800901    11.70364
          42  |   5.727127   1.264198     4.53   0.000     3.245246    8.209008
          43  |   6.353889   1.260443     5.04   0.000      3.87938    8.828398
          44  |    1.83218   1.225896     1.49   0.135    -.5745051    4.238866
          45  |   3.992405   1.243343     3.21   0.001     1.551467    6.433344
          46  |   4.272376   1.223684     3.49   0.001     1.870034    6.674719
          47  |   .4720782   1.243323     0.38   0.704    -1.968821    2.912977
          51  |   10.16903   1.223606     8.31   0.000     7.766844    12.57123
          52  |   8.228764   1.267183     6.49   0.000     5.741024     10.7165
          54  |   6.705244   1.241757     5.40   0.000     4.267419    9.143069
          55  |   5.491493   1.277077     4.30   0.000     2.984328    7.998658
          56  |   .6147688   1.231136     0.50   0.618    -1.802204    3.031741
          57  |   .1733435   1.242562     0.14   0.889    -2.266062    2.612749
          58  |   4.597464   1.216648     3.78   0.000     2.208934    6.985993
          59  |   2.910721   1.218351     2.39   0.017      .518848    5.302593
          61  |   3.429778   1.231484     2.79   0.005     1.012122    5.847435
          62  |   1.529689   1.227033     1.25   0.213    -.8792287    3.938607
          63  |   .1110399   1.253971     0.09   0.929    -2.350763    2.572843
          64  |  -8.360757   1.216051    -6.88   0.000    -10.74812   -5.973398
          71  |   -2.84782   1.225918    -2.32   0.020     -5.25455   -.4410907
          72  |   7.545168   1.314219     5.74   0.000     4.965085    10.12525
          73  |   5.065417    1.27841     3.96   0.000     2.555634    7.575199
          74  |   4.444996   1.355047     3.28   0.001      1.78476    7.105232
          81  |  -4.667171   1.235994    -3.78   0.000    -7.093681   -2.240661
          82  |   .6493388   1.214442     0.53   0.593     -1.73486    3.033538
          83  |   1.764114    1.24143     1.42   0.156    -.6730677    4.201296
          84  |   8.679613    1.23266     7.04   0.000     6.259647    11.09958
          85  |   2.398924   1.208146     1.99   0.047     .0270863    4.770763
          86  |   7.228274   1.227414     5.89   0.000     4.818607    9.637941
          87  |  -.2487644   1.245979    -0.20   0.842    -2.694877    2.197348
          88  |   5.872883   1.319585     4.45   0.000     3.282266      8.4635
          91  |   5.839442   1.209379     4.83   0.000     3.465184    8.213701
          92  |   3.007486   1.211038     2.48   0.013     .6299691    5.385002
          93  |    8.27507   1.392033     5.94   0.000     5.542223    11.00792
          94  |   4.072716   1.252498     3.25   0.001     1.613805    6.531628
          95  |   9.403113   1.239463     7.59   0.000     6.969792    11.83643
              |
_IstaXyear_12 |    -.04131   .0141624    -2.92   0.004    -.0691137   -.0135063
_IstaXyear_13 |   .0317075   .0141038     2.25   0.025     .0040188    .0593962
_IstaXyear_14 |  -.1027491    .014368    -7.15   0.000    -.1309565   -.0745418
_IstaXyear_15 |  -.0450472   .0140699    -3.20   0.001    -.0726693   -.0174251
_IstaXyear_16 |  -.1178754   .0143208    -8.23   0.000    -.1459901   -.0897608
_IstaXyear_21 |  -.1178324    .014182    -8.31   0.000    -.1456745   -.0899902
_IstaXyear_22 |  -.1118645   .0141856    -7.89   0.000    -.1397138   -.0840153
_IstaXyear_23 |  -.0809985   .0140278    -5.77   0.000    -.1085379   -.0534592
_IstaXyear_31 |  -.0476254   .0139982    -3.40   0.001    -.0751067    -.020144
_IstaXyear_32 |  -.0452292   .0141455    -3.20   0.001    -.0729997   -.0174587
_IstaXyear_33 |  -.0476682   .0139366    -3.42   0.001    -.0750286   -.0203079
_IstaXyear_34 |  -.0465305   .0138672    -3.36   0.001    -.0737547   -.0193062
_IstaXyear_35 |  -.0882184   .0140968    -6.26   0.000    -.1158933   -.0605435
_IstaXyear_41 |  -.1031885   .0140015    -7.37   0.000    -.1306763   -.0757008
_IstaXyear_42 |  -.0694882    .014172    -4.90   0.000    -.0973107   -.0416658
_IstaXyear_43 |  -.0738372   .0138535    -5.33   0.000    -.1010345     -.04664
_IstaXyear_44 |  -.0324975   .0141241    -2.30   0.022    -.0602261   -.0047689
_IstaXyear_45 |  -.0499423   .0140521    -3.55   0.000    -.0775295   -.0223551
_IstaXyear_46 |  -.0454383   .0139936    -3.25   0.001    -.0729106   -.0179659
_IstaXyear_47 |  -.0078129   .0140572    -0.56   0.579    -.0354101    .0197843
_IstaXyear_51 |  -.1008186   .0138875    -7.26   0.000    -.1280826   -.0735545
_IstaXyear_52 |  -.0939309   .0140948    -6.66   0.000    -.1216018   -.0662599
_IstaXyear_54 |  -.0796572   .0140774    -5.66   0.000    -.1072941   -.0520203
_IstaXyear_55 |  -.0672679   .0144699    -4.65   0.000    -.0956753   -.0388604
_IstaXyear_56 |  -.0099554   .0139047    -0.72   0.474    -.0372533    .0173424
_IstaXyear_57 |  -.0012724   .0141918    -0.09   0.929    -.0291338    .0265891
_IstaXyear_58 |  -.0514796   .0140212    -3.67   0.000     -.079006   -.0239532
_IstaXyear_59 |  -.0310693   .0142789    -2.18   0.030    -.0591016   -.0030369
_IstaXyear_61 |  -.0404103   .0140098    -2.88   0.004    -.0679144   -.0129062
_IstaXyear_62 |  -.0182214   .0139341    -1.31   0.191    -.0455769    .0091342
_IstaXyear_63 |  -.0054994   .0141517    -0.39   0.698    -.0332821    .0222832
_IstaXyear_64 |   .0876899   .0138292     6.34   0.000     .0605404    .1148394
_IstaXyear_71 |   .0343497   .0141108     2.43   0.015     .0066474     .062052
_IstaXyear_72 |  -.0822234   .0141586    -5.81   0.000    -.1100195   -.0544272
_IstaXyear_73 |  -.0551852   .0140806    -3.92   0.000    -.0828283    -.027542
_IstaXyear_74 |  -.0547346   .0140948    -3.88   0.000    -.0824056   -.0270635
_IstaXyear_81 |   .0440522   .0141968     3.10   0.002     .0161811    .0719234
_IstaXyear_82 |   -.009325   .0138671    -0.67   0.502     -.036549     .017899
_IstaXyear_83 |   -.024653   .0146553    -1.68   0.093    -.0534243    .0041183
_IstaXyear_84 |  -.0954928   .0140144    -6.81   0.000    -.1230059   -.0679797
_IstaXyear_85 |  -.0262562   .0138844    -1.89   0.059     -.053514    .0010017
_IstaXyear_86 |   -.076577   .0145529    -5.26   0.000    -.1051474   -.0480066
_IstaXyear_87 |   .0077712   .0144011     0.54   0.590    -.0205012    .0360435
_IstaXyear_88 |    -.06463   .0152062    -4.25   0.000    -.0944829    -.034777
_IstaXyear_91 |  -.0704529   .0139953    -5.03   0.000    -.0979285   -.0429772
_IstaXyear_92 |  -.0326463   .0138436    -2.36   0.019    -.0598242   -.0054684
_IstaXyear_93 |  -.0993569   .0138263    -7.19   0.000    -.1265008    -.072213
_IstaXyear_94 |  -.0497143   .0140522    -3.54   0.000    -.0773017   -.0221269
_IstaXyear_95 |  -.1042808   .0141835    -7.35   0.000    -.1321258   -.0764357
        _cons |  -13.32548   2.805782    -4.75   0.000    -18.83381   -7.817154
-------------------------------------------------------------------------------

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. 
. qui reg lnths D lnemp i.year _Istate* _IstaXyear* , robust

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors , Robust)
results/table2.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. qui reg lnths D lnemp i.year _Istate* _IstaXyear* , cluster(state)

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Cluster)
results/table2.xml
dir : seeout

. 
.         
. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. 
. reg lnths D lnemp i.year i.state  _IstaXyear*  /*OLS*/

      Source |       SS           df       MS      Number of obs   =       850
-------------+----------------------------------   F(116, 733)     =    542.38
       Model |  2453.11017       116  21.1475015   Prob > F        =    0.0000
    Residual |  28.5800091       733  .038990463   R-squared       =    0.9885
-------------+----------------------------------   Adj R-squared   =    0.9867
       Total |  2481.69018       849  2.92307442   Root MSE        =    .19746

-------------------------------------------------------------------------------
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
            D |   .1451417    .033961     4.27   0.000     .0784692    .2118141
        lnemp |   1.499868   .2162408     6.94   0.000     1.075343    1.924394
              |
         year |
          80  |   .0228275   .0406728     0.56   0.575    -.0570217    .1026767
          81  |   .0501135   .0440825     1.14   0.256    -.0364295    .1366565
          82  |   .0943474   .0490485     1.92   0.055    -.0019448    .1906396
          83  |   .1425118   .0554341     2.57   0.010     .0336833    .2513404
          84  |    .498567   .0635292     7.85   0.000     .3738462    .6232879
          85  |   .7175139    .072529     9.89   0.000     .5751247    .8599032
          86  |   .8454916   .0813005    10.40   0.000     .6858821    1.005101
          87  |   .9771231   .0910154    10.74   0.000     .7984411    1.155805
          88  |   1.301494    .101362    12.84   0.000     1.102499    1.500488
          89  |   1.409538    .111538    12.64   0.000     1.190566     1.62851
          90  |    1.47865   .1212414    12.20   0.000     1.240628    1.716672
          91  |   1.570146   .1293665    12.14   0.000     1.316173    1.824119
          92  |   1.747922   .1389311    12.58   0.000     1.475172    2.020673
          93  |   2.037697   .1493741    13.64   0.000     1.744445    2.330949
          94  |   2.193295    .160511    13.66   0.000     1.878179    2.508411
          95  |   2.312267   .1713015    13.50   0.000     1.975967    2.648567
              |
        state |
          12  |   4.161048    1.23827     3.36   0.001      1.73007    6.592026
          13  |  -2.989472   1.246612    -2.40   0.017    -5.436827   -.5421174
          14  |    9.11025   1.376268     6.62   0.000     6.408353    11.81215
          15  |    5.00001   1.221696     4.09   0.000     2.601569     7.39845
          16  |   10.60946    1.31773     8.05   0.000     8.022485    13.19643
          21  |   9.848309   1.471267     6.69   0.000     6.959909    12.73671
          22  |   9.587233   1.352823     7.09   0.000     6.931363     12.2431
          23  |   6.610883   1.397944     4.73   0.000     3.866432    9.355334
          31  |   3.834553   1.356969     2.83   0.005     1.170544    6.498563
          32  |   3.723175   1.281958     2.90   0.004     1.206428    6.239922
          33  |   3.855385   1.373686     2.81   0.005     1.158556    6.552213
          34  |   3.898319   1.311929     2.97   0.003     1.322733    6.473904
          35  |    7.70993   1.266857     6.09   0.000     5.222829    10.19703
          41  |    9.25227   1.248656     7.41   0.000     6.800901    11.70364
          42  |   5.727127   1.264198     4.53   0.000     3.245246    8.209008
          43  |   6.353889   1.260443     5.04   0.000      3.87938    8.828398
          44  |    1.83218   1.225896     1.49   0.135    -.5745051    4.238866
          45  |   3.992405   1.243343     3.21   0.001     1.551467    6.433344
          46  |   4.272376   1.223684     3.49   0.001     1.870034    6.674719
          47  |   .4720782   1.243323     0.38   0.704    -1.968821    2.912977
          51  |   10.16903   1.223606     8.31   0.000     7.766844    12.57123
          52  |   8.228764   1.267183     6.49   0.000     5.741024     10.7165
          54  |   6.705244   1.241757     5.40   0.000     4.267419    9.143069
          55  |   5.491493   1.277077     4.30   0.000     2.984328    7.998658
          56  |   .6147688   1.231136     0.50   0.618    -1.802204    3.031741
          57  |   .1733435   1.242562     0.14   0.889    -2.266062    2.612749
          58  |   4.597464   1.216648     3.78   0.000     2.208934    6.985993
          59  |   2.910721   1.218351     2.39   0.017      .518848    5.302593
          61  |   3.429778   1.231484     2.79   0.005     1.012122    5.847435
          62  |   1.529689   1.227033     1.25   0.213    -.8792287    3.938607
          63  |   .1110399   1.253971     0.09   0.929    -2.350763    2.572843
          64  |  -8.360757   1.216051    -6.88   0.000    -10.74812   -5.973398
          71  |   -2.84782   1.225918    -2.32   0.020     -5.25455   -.4410907
          72  |   7.545168   1.314219     5.74   0.000     4.965085    10.12525
          73  |   5.065417    1.27841     3.96   0.000     2.555634    7.575199
          74  |   4.444996   1.355047     3.28   0.001      1.78476    7.105232
          81  |  -4.667171   1.235994    -3.78   0.000    -7.093681   -2.240661
          82  |   .6493388   1.214442     0.53   0.593     -1.73486    3.033538
          83  |   1.764114    1.24143     1.42   0.156    -.6730677    4.201296
          84  |   8.679613    1.23266     7.04   0.000     6.259647    11.09958
          85  |   2.398924   1.208146     1.99   0.047     .0270863    4.770763
          86  |   7.228274   1.227414     5.89   0.000     4.818607    9.637941
          87  |  -.2487644   1.245979    -0.20   0.842    -2.694877    2.197348
          88  |   5.872883   1.319585     4.45   0.000     3.282266      8.4635
          91  |   5.839442   1.209379     4.83   0.000     3.465184    8.213701
          92  |   3.007486   1.211038     2.48   0.013     .6299691    5.385002
          93  |    8.27507   1.392033     5.94   0.000     5.542223    11.00792
          94  |   4.072716   1.252498     3.25   0.001     1.613805    6.531628
          95  |   9.403113   1.239463     7.59   0.000     6.969792    11.83643
              |
_IstaXyear_12 |    -.04131   .0141624    -2.92   0.004    -.0691137   -.0135063
_IstaXyear_13 |   .0317075   .0141038     2.25   0.025     .0040188    .0593962
_IstaXyear_14 |  -.1027491    .014368    -7.15   0.000    -.1309565   -.0745418
_IstaXyear_15 |  -.0450472   .0140699    -3.20   0.001    -.0726693   -.0174251
_IstaXyear_16 |  -.1178754   .0143208    -8.23   0.000    -.1459901   -.0897608
_IstaXyear_21 |  -.1178324    .014182    -8.31   0.000    -.1456745   -.0899902
_IstaXyear_22 |  -.1118645   .0141856    -7.89   0.000    -.1397138   -.0840153
_IstaXyear_23 |  -.0809985   .0140278    -5.77   0.000    -.1085379   -.0534592
_IstaXyear_31 |  -.0476254   .0139982    -3.40   0.001    -.0751067    -.020144
_IstaXyear_32 |  -.0452292   .0141455    -3.20   0.001    -.0729997   -.0174587
_IstaXyear_33 |  -.0476682   .0139366    -3.42   0.001    -.0750286   -.0203079
_IstaXyear_34 |  -.0465305   .0138672    -3.36   0.001    -.0737547   -.0193062
_IstaXyear_35 |  -.0882184   .0140968    -6.26   0.000    -.1158933   -.0605435
_IstaXyear_41 |  -.1031885   .0140015    -7.37   0.000    -.1306763   -.0757008
_IstaXyear_42 |  -.0694882    .014172    -4.90   0.000    -.0973107   -.0416658
_IstaXyear_43 |  -.0738372   .0138535    -5.33   0.000    -.1010345     -.04664
_IstaXyear_44 |  -.0324975   .0141241    -2.30   0.022    -.0602261   -.0047689
_IstaXyear_45 |  -.0499423   .0140521    -3.55   0.000    -.0775295   -.0223551
_IstaXyear_46 |  -.0454383   .0139936    -3.25   0.001    -.0729106   -.0179659
_IstaXyear_47 |  -.0078129   .0140572    -0.56   0.579    -.0354101    .0197843
_IstaXyear_51 |  -.1008186   .0138875    -7.26   0.000    -.1280826   -.0735545
_IstaXyear_52 |  -.0939309   .0140948    -6.66   0.000    -.1216018   -.0662599
_IstaXyear_54 |  -.0796572   .0140774    -5.66   0.000    -.1072941   -.0520203
_IstaXyear_55 |  -.0672679   .0144699    -4.65   0.000    -.0956753   -.0388604
_IstaXyear_56 |  -.0099554   .0139047    -0.72   0.474    -.0372533    .0173424
_IstaXyear_57 |  -.0012724   .0141918    -0.09   0.929    -.0291338    .0265891
_IstaXyear_58 |  -.0514796   .0140212    -3.67   0.000     -.079006   -.0239532
_IstaXyear_59 |  -.0310693   .0142789    -2.18   0.030    -.0591016   -.0030369
_IstaXyear_61 |  -.0404103   .0140098    -2.88   0.004    -.0679144   -.0129062
_IstaXyear_62 |  -.0182214   .0139341    -1.31   0.191    -.0455769    .0091342
_IstaXyear_63 |  -.0054994   .0141517    -0.39   0.698    -.0332821    .0222832
_IstaXyear_64 |   .0876899   .0138292     6.34   0.000     .0605404    .1148394
_IstaXyear_71 |   .0343497   .0141108     2.43   0.015     .0066474     .062052
_IstaXyear_72 |  -.0822234   .0141586    -5.81   0.000    -.1100195   -.0544272
_IstaXyear_73 |  -.0551852   .0140806    -3.92   0.000    -.0828283    -.027542
_IstaXyear_74 |  -.0547346   .0140948    -3.88   0.000    -.0824056   -.0270635
_IstaXyear_81 |   .0440522   .0141968     3.10   0.002     .0161811    .0719234
_IstaXyear_82 |   -.009325   .0138671    -0.67   0.502     -.036549     .017899
_IstaXyear_83 |   -.024653   .0146553    -1.68   0.093    -.0534243    .0041183
_IstaXyear_84 |  -.0954928   .0140144    -6.81   0.000    -.1230059   -.0679797
_IstaXyear_85 |  -.0262562   .0138844    -1.89   0.059     -.053514    .0010017
_IstaXyear_86 |   -.076577   .0145529    -5.26   0.000    -.1051474   -.0480066
_IstaXyear_87 |   .0077712   .0144011     0.54   0.590    -.0205012    .0360435
_IstaXyear_88 |    -.06463   .0152062    -4.25   0.000    -.0944829    -.034777
_IstaXyear_91 |  -.0704529   .0139953    -5.03   0.000    -.0979285   -.0429772
_IstaXyear_92 |  -.0326463   .0138436    -2.36   0.019    -.0598242   -.0054684
_IstaXyear_93 |  -.0993569   .0138263    -7.19   0.000    -.1265008    -.072213
_IstaXyear_94 |  -.0497143   .0140522    -3.54   0.000    -.0773017   -.0221269
_IstaXyear_95 |  -.1042808   .0141835    -7.35   0.000    -.1321258   -.0764357
        _cons |  -13.32548   2.805782    -4.75   0.000    -18.83381   -7.817154
-------------------------------------------------------------------------------

. outreg2 using "results/table2", replace excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Simple)
results/table2.xml
dir : seeout

. 
. 
. /*Cluster robust standard errors allowing for heteroskedasicity as well
> as autocorrelation between observation within states*/
. 
. qui reg lnths D lnemp i.year i.state  _IstaXyear*  , r /*OLS + robust se*/

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Robust)
results/table2.xml
dir : seeout

. 
. qui reg lnths D lnemp i.year i.state  _IstaXyear*  , cluster(state) /*OLS + State Cluster*/

. outreg2 using "results/table2", append excel dec(4) ctitle("OLS") ///
> drop(_Iy* _Istate* _IstaXyear* ) addtext(State FE, YES, Year FE, YES, StateXyear, YES, Errors, Cluster)
results/table2.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gr two  (connect D year if state==12, lcolor(red) mcolor(red) lpattern(solid) ) ///
>                 (connect D year if state==16, lcolor(green) mcolor(green) lpattern(solid) ) ///
>                 (connect D year if state==21, lcolor(blue) mcolor(blue) lpattern(solid) ) ///
>                 , legend( col(3) lab(1 "State 12") lab(2 "State 14") lab(3 "State 21")) ///
>                 saving("graphs/Fig4", replace)
(note: file graphs/Fig4.gph not found)
(file graphs/Fig4.gph saved)

.                 graph export "graphs/Fig4.eps", replace
(note: file graphs/Fig4.eps not found)
(file graphs/Fig4.eps written in EPS format)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. sort state year

. 
end of do-file
-> . -> do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen TreatYear_temp = year if D==1 & L.D==0
(815 missing values generated)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. by state: egen TreatYear = max(TreatYear_temp)
(255 missing values generated)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. drop TreatYear_temp

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen etime = year-TreatYear
(255 missing values generated)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen byte D_5=(etime==-5)

. gen byte D_4=(etime==-4)

. gen byte D_3=(etime==-3)

. gen byte D_2=(etime==-2)

. gen byte D_1=(etime==-1)

. gen byte D0=(etime==0)

. gen byte D1=(etime==1)

. gen byte D2=(etime==2)

. gen byte D3=(etime==3)

. gen byte D4=(etime==4)

. gen byte D5=(etime==5)

. gen byte D6=(etime==6)

. gen byte D7=(etime==7)

. gen byte D7_=(etime>=7)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. global lags D_4 D_3 D_2 D_1 D0 D1 D2 D3 D4 D5 D6 D7 

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. global lags D_4 D_3 D_2 D_1 D0 D1 D2 D3 D4 D5 D6 D7 

. 
. reg  lnths  $lags i.year i.state _IstaXyear* , cluster(state) /*controlling for lags*/

Linear regression                               Number of obs     =        850
                                                F(27, 49)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9880
                                                Root MSE          =     .20269

                                  (Std. Err. adjusted for 50 clusters in state)
-------------------------------------------------------------------------------
              |               Robust
        lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
          D_4 |   .0416442   .0706708     0.59   0.558     -.100374    .1836624
          D_3 |  -.0525687    .086675    -0.61   0.547    -.2267487    .1216113
          D_2 |   -.042934   .0782732    -0.55   0.586    -.2002299    .1143619
          D_1 |  -.0311855   .0652886    -0.48   0.635    -.1623879    .1000168
           D0 |   .0696615    .069987     1.00   0.324    -.0709826    .2103056
           D1 |   .0858708   .0668734     1.28   0.205    -.0485163    .2202579
           D2 |   .1390603   .0830471     1.67   0.100    -.0278292    .3059497
           D3 |   .0294822   .0778379     0.38   0.706     -.126939    .1859034
           D4 |   .0811574   .0638863     1.27   0.210    -.0472269    .2095418
           D5 |   .1416149   .0567396     2.50   0.016     .0275924    .2556374
           D6 |     .09359   .0517506     1.81   0.077    -.0104067    .1975868
           D7 |   .0922357   .0419403     2.20   0.033     .0079535    .1765178
              |
         year |
          80  |   .0419791    .034517     1.22   0.230    -.0273853    .1113436
          81  |   .0744205   .0467513     1.59   0.118    -.0195298    .1683709
          82  |   .0944289   .0542691     1.74   0.088     -.014629    .2034868
          83  |   .1620019   .0490938     3.30   0.002     .0633443    .2606595
          84  |   .5833193   .0499816    11.67   0.000     .4828775    .6837611
          85  |   .8339343   .0617022    13.52   0.000     .7099391    .9579294
          86  |   .9966044   .0609992    16.34   0.000      .874022    1.119187
          87  |   1.149506   .0599113    19.19   0.000      1.02911    1.269903
          88  |   1.520073   .0483329    31.45   0.000     1.422944    1.617202
          89  |   1.663576   .0446692    37.24   0.000      1.57381    1.753342
          90  |   1.758956   .0473168    37.17   0.000     1.663869    1.854043
          91  |   1.857973   .0438942    42.33   0.000     1.769765    1.946182
          92  |   2.050718   .0359551    57.04   0.000     1.978463    2.122972
          93  |   2.387553   .0312402    76.43   0.000     2.324774    2.450333
          94  |    2.59457   .0353547    73.39   0.000     2.523522    2.665618
          95  |   2.757677   .0364204    75.72   0.000     2.684487    2.830866
              |
        state |
          12  |   3.278016   .3124536    10.49   0.000     2.650117    3.905915
          13  |  -5.095111   .2813853   -18.11   0.000    -5.660576   -4.529646
          14  |   12.88617   .3124536    41.24   0.000     12.25827    13.51407
          15  |   6.253973          .        .       .            .           .
          16  |   13.15967   .2813853    46.77   0.000      12.5942    13.72513
          21  |   14.92265   .5012492    29.77   0.000     13.91535    15.92995
          22  |   12.76634   .2813853    45.37   0.000     12.20087     13.3318
          23  |   11.38879          .        .       .            .           .
          31  |   7.345322   .5012492    14.65   0.000     6.338024     8.35262
          32  |   5.536323    .241796    22.90   0.000     5.050416     6.02223
          33  |   8.434085   3.89e-08  2.2e+08   0.000     8.434085    8.434085
          34  |   6.730726   .4832771    13.93   0.000     5.759545    7.701908
          35  |   9.080019   .2813853    32.27   0.000     8.514554    9.645484
          41  |   10.30232   .4815998    21.39   0.000     9.334507    11.27013
          42  |   7.022503    .241796    29.04   0.000     6.536596     7.50841
          43  |   9.087396   .4815998    18.87   0.000     8.119585    10.05521
          44  |   1.039772   .3728967     2.79   0.008     .2904075    1.789136
          45  |   1.570584   .4815998     3.26   0.002     .6027735    2.538396
          46  |   4.103078   .4815998     8.52   0.000     3.135267    5.070889
          47  |   1.147951   .3728967     3.08   0.003     .3985871    1.897315
          51  |   8.565022          .        .       .            .           .
          52  |   9.608324   .2813853    34.15   0.000     9.042859    10.17379
          54  |   7.513117   .4815998    15.60   0.000     6.545306    8.480928
          55  |   7.126036   .2287257    31.16   0.000     6.666394    7.585677
          56  |   2.224088   2.60e-08  8.6e+07   0.000     2.224088    2.224088
          57  |   .5118903    .241796     2.12   0.039      .025983    .9977976
          58  |   5.618905   1.24e-08  4.5e+08   0.000     5.618905    5.618905
          59  |   4.015369          .        .       .            .           .
          61  |   3.788567   .4815998     7.87   0.000     2.820755    4.756378
          62  |    2.21379   .4914337     4.50   0.000     1.226217    3.201363
          63  |    1.03202    .241796     4.27   0.000     .5461131    1.517928
          64  |  -7.369882          .        .       .            .           .
          71  |   -3.55181   .3728967    -9.52   0.000    -4.301174   -2.802446
          72  |   11.04528   7.70e-08  1.4e+08   0.000     11.04528    11.04528
          73  |   8.033267          .        .       .            .           .
          74  |   7.661083   .2813853    27.23   0.000     7.095619    8.226548
          81  |  -5.224443    .241796   -21.61   0.000    -5.710351   -4.738536
          82  |  -.4166732          .        .       .            .           .
          83  |   2.184284   .2813853     7.76   0.000     1.618819    2.749749
          84  |   9.098165   .4815998    18.89   0.000     8.130354    10.06598
          85  |   1.172225   .4832771     2.43   0.019     .2010432    2.143407
          86  |   5.550667   .4815998    11.53   0.000     4.582856    6.518478
          87  |  -2.093925   .2287257    -9.15   0.000    -2.553567   -1.634284
          88  |   1.616167   .4815998     3.36   0.002     .6483555    2.583978
          91  |   6.578339   4.59e-08  1.4e+08   0.000     6.578339    6.578339
          92  |   3.867253   2.88e-08  1.3e+08   0.000     3.867253    3.867253
          93  |   13.11301   2.55e-08  5.1e+08   0.000     13.11301    13.11301
          94  |   1.345053   .4815998     2.79   0.007     .3772421    2.312864
          95  |   7.946241   .2287257    34.74   0.000     7.486599    8.405882
              |
_IstaXyear_12 |  -.0329891    .003885    -8.49   0.000    -.0407963   -.0251819
_IstaXyear_13 |   .0424962   .0030077    14.13   0.000     .0364521    .0485404
_IstaXyear_14 |  -.1166975    .003885   -30.04   0.000    -.1245047   -.1088904
_IstaXyear_15 |  -.0631772   3.80e-10 -1.7e+08   0.000    -.0631772   -.0631772
_IstaXyear_16 |  -.1281661   .0030077   -42.61   0.000    -.1342102   -.1221219
_IstaXyear_21 |   -.128977   .0054113   -23.83   0.000    -.1398515   -.1181025
_IstaXyear_22 |  -.1156941   .0030077   -38.47   0.000    -.1217383     -.10965
_IstaXyear_23 |  -.0974829          .        .       .            .           .
_IstaXyear_31 |  -.0497135   .0054113    -9.19   0.000     -.060588    -.038839
_IstaXyear_32 |  -.0399842   .0029523   -13.54   0.000    -.0459171   -.0340514
_IstaXyear_33 |   -.059877   8.00e-10 -7.5e+07   0.000     -.059877    -.059877
_IstaXyear_34 |  -.0444269   .0052506    -8.46   0.000    -.0549784   -.0338753
_IstaXyear_35 |  -.0792792   .0030077   -26.36   0.000    -.0853234    -.073235
_IstaXyear_41 |  -.0916897    .005179   -17.70   0.000    -.1020974   -.0812821
_IstaXyear_42 |  -.0703848   .0029523   -23.84   0.000    -.0763177    -.064452
_IstaXyear_43 |  -.0806648    .005179   -15.58   0.000    -.0910725   -.0702572
_IstaXyear_44 |  -.0347581   .0039691    -8.76   0.000    -.0427342   -.0267819
_IstaXyear_45 |  -.0328827    .005179    -6.35   0.000    -.0432903    -.022475
_IstaXyear_46 |  -.0381656    .005179    -7.37   0.000    -.0485733    -.027758
_IstaXyear_47 |   -.003404   .0039691    -0.86   0.395    -.0113801    .0045722
_IstaXyear_51 |  -.0916854   7.28e-10 -1.3e+08   0.000    -.0916854   -.0916854
_IstaXyear_52 |  -.0866672   .0030077   -28.82   0.000    -.0927114   -.0806231
_IstaXyear_54 |  -.0608507    .005179   -11.75   0.000    -.0712583   -.0504431
_IstaXyear_55 |  -.0825892   .0025885   -31.91   0.000     -.087791   -.0773874
_IstaXyear_56 |   .0003588   9.69e-10  3.7e+05   0.000     .0003588    .0003588
_IstaXyear_57 |   .0117843   .0029523     3.99   0.000     .0058515    .0177172
_IstaXyear_58 |  -.0352676          .        .       .            .           .
_IstaXyear_59 |  -.0062965   1.37e-09 -4.6e+06   0.000    -.0062965   -.0062965
_IstaXyear_61 |  -.0275312    .005179    -5.32   0.000    -.0379388   -.0171236
_IstaXyear_62 |   -.002012   .0053172    -0.38   0.707    -.0126974    .0086734
_IstaXyear_63 |   .0025153   .0029523     0.85   0.398    -.0034175    .0084481
_IstaXyear_64 |   .0853236   2.88e-10  3.0e+08   0.000     .0853236    .0853236
_IstaXyear_71 |   .0514231   .0039691    12.96   0.000      .043447    .0593992
_IstaXyear_72 |  -.1034155          .        .       .            .           .
_IstaXyear_73 |  -.0737117   8.07e-10 -9.1e+07   0.000    -.0737117   -.0737117
_IstaXyear_74 |  -.0472322   .0030077   -15.70   0.000    -.0532763    -.041188
_IstaXyear_81 |   .0408003   .0029523    13.82   0.000     .0348674    .0467331
_IstaXyear_82 |  -.0018299   8.46e-10 -2.2e+06   0.000    -.0018299   -.0018299
_IstaXyear_83 |  -.0452091   .0030077   -15.03   0.000    -.0512532   -.0391649
_IstaXyear_84 |   -.082001    .005179   -15.83   0.000    -.0924086   -.0715934
_IstaXyear_85 |  -.0106281   .0052506    -2.02   0.048    -.0211796   -.0000765
_IstaXyear_86 |   -.040715    .005179    -7.86   0.000    -.0511226   -.0303073
_IstaXyear_87 |   .0334932   .0025885    12.94   0.000     .0282914     .038695
_IstaXyear_88 |  -.0152147    .005179    -2.94   0.005    -.0256223   -.0048071
_IstaXyear_91 |  -.0553539   5.20e-10 -1.1e+08   0.000    -.0553539   -.0553539
_IstaXyear_92 |  -.0276636          .        .       .            .           .
_IstaXyear_93 |   -.100694   5.61e-10 -1.8e+08   0.000     -.100694    -.100694
_IstaXyear_94 |  -.0326466    .005179    -6.30   0.000    -.0430543    -.022239
_IstaXyear_95 |   -.089234   .0025885   -34.47   0.000    -.0944358   -.0840323
        _cons |    6.25495   .0337993   185.06   0.000     6.187027    6.322872
-------------------------------------------------------------------------------

. outreg2 using "results/table3", replace excel dec(4) ctitle("SLP") keep(D_5 D_4 D_3 D_2 D_1 D0 D1 D2 D3 D4 D5 D6 D7 ) ///
> addtext(State FE, YES, Year FE, YES, StateXt, YES, Clustered err, YES)
results/table3.xml
dir : seeout

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. test D_4=D_3=D_2=D_1=0

 ( 1)  D_4 - D_3 = 0
 ( 2)  D_4 - D_2 = 0
 ( 3)  D_4 - D_1 = 0
 ( 4)  D_4 = 0

       F(  4,    49) =    0.57
            Prob > F =    0.6890

. test D1=D2=D3=D4=D5=D6=D7=0

 ( 1)  D1 - D2 = 0
 ( 2)  D1 - D3 = 0
 ( 3)  D1 - D4 = 0
 ( 4)  D1 - D5 = 0
 ( 5)  D1 - D6 = 0
 ( 6)  D1 - D7 = 0
 ( 7)  D1 = 0

       F(  7,    49) =    1.88
            Prob > F =    0.0932

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. gen lnths_up=(_b[D_4]+1.96*_se[D_4])*D_4 +(_b[D_3]+1.96*_se[D_3])*D_3 + (_b[D_2]+1.96*_se[D_2])*D_2 + (_b[D_1]+1.96*_se[D_1])*D_1  ///
>                         + (_b[D0]*D0+1.96*_se[D0])*D0  + (_b[D1]+1.96*_se[D1])*D1  + (_b[D2]+1.96*_se[D2])*D2  + (_b[D3]+1.96*_se[D3])*D
> 3 ///
>                         + (_b[D4]+1.96*_se[D4])*D4 + (_b[D5]+1.96*_se[D5])*D5 + (_b[D6]+1.96*_se[D6])*D6 + (_b[D7]+1.96*_se[D7])*D7  

. 
. gen lnths_low=(_b[D_4]-1.96*_se[D_4])*D_4 +(_b[D_3]-1.96*_se[D_3])*D_3 + (_b[D_2]-1.96*_se[D_2])*D_2 + (_b[D_1]-1.96*_se[D_1])*D_1  ///
>                         + (_b[D0]*D0-1.96*_se[D0])*D0  + (_b[D1]-1.96*_se[D1])*D1  + (_b[D2]-1.96*_se[D2])*D2  + (_b[D3]-1.96*_se[D3])*D
> 3 ///
>                         + (_b[D4]-1.96*_se[D4])*D4 + (_b[D5]-1.96*_se[D5])*D5 + (_b[D6]-1.96*_se[D6])*D6 + (_b[D7]-1.96*_se[D7])*D7  

.                         
. gen lnths_hat=_b[D_4]*D_4 +_b[D_3]*D_3 + _b[D_2]*D_2 + _b[D_1]*D_1 +  _b[D0]*D0 + _b[D1]*D1  + _b[D2]*D2  + _b[D3]*D3 ///
>         + _b[D4]*D4 + _b[D5]*D5 + _b[D6]*D6 + _b[D7]*D7  

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. keep if inrange(etime,-4,7)
(440 observations deleted)

. collapse lnths_hat lnths_up lnths_low, by(etime)

. replace lnths_up=. if etime==0
(1 real change made, 1 to missing)

. replace lnths_low=. if etime==0
(1 real change made, 1 to missing)

. 
. gr two  (connect lnths_hat etime  , lcolor(red)  lpattern(solid) msymbol(o) mcolor(red)) ///
>                 (line lnths_up etime      , lcolor(gs10) lpattern(dash) ) ///
>                 (line lnths_low etime     , lcolor(gs10) lpattern(dash) ) ///
>                 , legend( cols(3) lab(1 "Estimate") lab(2 "upper CI" ) lab(3 "lower CI" )) yline(0)     ///
>                 saving("graphs/Fig5", replace)
(note: file graphs/Fig5.gph not found)
(file graphs/Fig5.gph saved)

.                 graph export "graphs/Fig5.eps", replace
(note: file graphs/Fig5.eps not found)
(file graphs/Fig5.eps written in EPS format)

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. test D_4=D_3=D_2=D_1=0

 ( 1)  D_4 - D_3 = 0
 ( 2)  D_4 - D_2 = 0
 ( 3)  D_4 - D_1 = 0
 ( 4)  D_4 = 0

       F(  4,    49) =    0.57
            Prob > F =    0.6890

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. test D1=D2=D3=D4=D5=D6=D7=0

 ( 1)  D1 - D2 = 0
 ( 2)  D1 - D3 = 0
 ( 3)  D1 - D4 = 0
 ( 4)  D1 - D5 = 0
 ( 5)  D1 - D6 = 0
 ( 6)  D1 - D7 = 0
 ( 7)  D1 = 0

       F(  7,    49) =    1.88
            Prob > F =    0.0932

. 
end of do-file
-> . do "/var/folders/4v/cxtc0hzx0fq4v9g8k_8603s80000gn/T//SD01340.000000"

. ********************************************************************************
. *                                                                              *
. * Exercise 3: Lemieux and Milligan (2008)                                      *
. *                                                                              *
. ********************************************************************************
. 
. 
. ******************************************
. *   Initial options                      *
. ******************************************
. 
. cls

. clear all

. cap log c
